       ID DIVISION.
      *------------*
       PROGRAM-ID.    H1SF0033.
       AUTHOR.        ALEX C. ANDREATTA.
       DATE-WRITTEN.  23/08/00.
       DATE-COMPILED.
      *
      *    *************************************************************
      *    *************************************************************
      *    *************************************************************
      *    * AAAAAAA TTTTTTT EEEEEEE NN      N CCCCCCC AAAAAAA OOOOOOO *
      *    * A     A    T    E       N N     N C       A     A O     O *
      *    * A     A    T    E       N  N    N C       A     A O     O *
      *    * AAAAAAA    T    EEEEE   N   N   N C       AAAAAAA O     O *
      *    * A     A    T    E       N    N  N C       A     A O     O *
      *    * A     A    T    E       N     N N C       A     A O     O *
      *    * A     A    T    EEEEEEE N      NN CCCCCCC A     A OOOOOOO *
      *    *************************************************************
      *    *************************************************************
      *    *************************************************************
      *    **                                                         **
      *    ** DEVIDO AOS CARACTERES ESPECIAIS DE IMPRESSAO PCL, ESTE  **
      *    **                                                         **
      *    ** PROGRAMA DEVE SER ALTERADO NO EDITOR NATIVO DO WINSCP,  **
      *    **                                                         **
      *    ** NAO PODE SER ALTERADO OU SALVO NO ULTRAEDIT.            **
      *    **                                                         **
      *    ** POIS PODERA OCASIONAR ERROS NA IMPRESSAO DOS DOCUMENTOS **
      *    **                                                         **
      *    ** DE FATURAMENTO.                                         **
      *    **                                                         **
      *    *************************************************************
      *    *************************************************************
      *    *************************************************************
      *    *                   OBJETIVOS DO PROGRAMA                   *
      *    *                                                           *
      *    *   O OBJETIVO DESSE PROGRAMA E EFETUAR A MONTAGEM DE DANFES*
      *    *  FISCAIS E PROTOCOLOS DE DESPACHO.                        *
      *    *                                                           *
      *    *  FATURAMENTO - FASE 4                                     *
      *    *************************************************************
      
      *    *************************************************************
      *    *                                                           *
      *    *              SECTION UTILIZADAS PELO PROGRAMA             *
      *    *                                                           *
      *    *           NOME DA SECTION                   AUTOR         *
      *    *                                                           *
      *    *                                                           *
      *    *   SECTION PARA PROCESSAMENTO CENTRAL                      *
      *    *  ------------------------------------                     *
      *    *                                                           *
      *    *  000-00-ROTINA-PRINCIPAL                  A.C.ANDREATTA   *
      *    *                                                           *
      *    *                                                           *
      *    *   SECTION PARA PREPARACAO                                 *
      *    *  -------------------------                                *
      *    *                                                           *
      *    *  100-00-PROCESSAMENTO-LOGICO              A.C.ANDREATTA   *
      *    *  110-00-PESQUISA-SUB-TRIB                 A.C.ANDREATTA   *
      *    *  120-00-DEFINE-IMPRESSORAS                A.C.ANDREATTA   *
      *    *  130-00-DEFINE-PJL-OUTBIN-S               A.C.ANDREATTA   *
      *    *  135-00-DEFINE-PJL-OUTBIN-S               E. FRIOLI JR.   *
      *    *  140-00-DEFINE-PJL-OUTBIN-P               A.C.ANDREATTA   *
      *    *  145-00-DEFINE-PJL-OUTBIN-P               E. FRIOLI JR.   *
      *    *  150-00-PESQUISA-INCENTIVO                A.C.ANDREATTA   *
      *    *  160-00-VERIFICA-SE-PECA-REMAN            P.F.NETO        *
      *    *  170-00-DEFINE-VIAS-ORDENACAO             E. FRIOLI JR.   *
      *    *  180-00-DEFINE-VIA-IMPRESS                E. FRIOLI JR.   *
      *    *                                                           *
      *    *                                                           *
      *    *   SECTION PARA I-O                                        *
      *    *  ------------------                                       *
      *    *                                                           *
      *    *  500-00-LE-PROTOCOLO                      A.C.ANDREATTA   *
      *    *  505-00-RECUPERA-EMITENTE                 E. FRIOLI JR.   *
      *    *  510-00-RECUPERA-DATA-HORA                A.C.ANDREATTA   *
      *    *  520-00-RECUPERA-CLAS-FISCAL              A.C.ANDREATTA   *
      *    *  525-00-RECUPERA-CLAS-INCENTIVO           A.C.ANDREATTA   *
      *    *  530-00-RECUPERA-PARAMETRO                A.C.ANDREATTA   *
      *    *  532-00-RECUPERA-ITEM-RCBM                A.C.ANDREATTA   *
      *    *  533-00-RECUPERA-CONTA-CT                 A.C.ANDREATTA   *
      *    *  535-00-ATUALIZA-PWS                      A.C.ANDREATTA   *
      *    *  537-00-FINALIZA-ITEM-REC-PEND            E. FRIOLI JR.   *
      *    *  540-00-ATUALIZA-PROTOCOLO                A.C.ANDREATTA   *
      *    *  542-00-GRAVA-LANCAMENTOS-CT              A.C.ANDREATTA   *
      *    *  545-00-GRAVA-DETALHE-REL                 A.C.ANDREATTA   *
      *    *  546-00-INSERT-DETALHE                    A.C.ANDREATTA   *
      *    *  550-00-GRAVA-RESUMO-REL                  A.C.ANDREATTA   *
      *    *  555-00-GRAVA-MENSAGEM-MQ                 A.C.ANDREATTA   *
      *    *  560-00-ATUALIZA-MONITOR                  A.C.ANDREATTA   *
      *    *  565-00-ATUALIZA-LBRC-IMPS                E. FRIOLI JR.   *
      *    *  567-00-ATUALIZA-ODA-CMIS2                E. FRIOLI JR.   *
      *    *  570-00-RETRIEVE-PARAMETRO                A.C.ANDREATTA   *
      *    *  572-00-SQL-RECUPERA-CNPJ                 E. FRIOLI JR.   *
      *    *  573-00-ENTRADA-NF-IC-RIS                 E. FRIOLI JR.   *
      *    *  575-00-EMITE-LINK-H1CB5026               A.C.ANDREATTA   *
      *    *  580-00-EMITE-LINK-H1CB5010               A.C.ANDREATTA   *
      *    *  581-00-EMITE-LINK-H1CB5035               P.F.NETO        *       
      *    *  582-00-EMITE-LINK-H1SF5049               E. FRIOLI JR.   *
      *    *  583-00-EMITE-LINK-H1SF5053               E. FRIOLI JR.   *
      *    *  584-00-EMITE-LINK-H1SF5008-02            E. FRIOLI JR.   *
      *    *  585-00-EMITE-ROLLBACK                    A.C.ANDREATTA   *
      *    *  590-00-EMITE-SYNCPOINT                   A.C.ANDREATTA   *
      *    *  595-00-EMITE-RETURN-CICS                 A.C.ANDREATTA   *
      *    *  600-00-VERIFICA-DELTA                    A.C.ANDREATTA   *
      *    *  605-00-VERIFICA-CME                      A.C.ANDREATTA   *
      *    *  607-00-VERIFICA-DEA                      A.C.ANDREATTA   *
      *    *  608-00-RECUPERA-DADOS-S                  E. FRIOLI JR.   *
      *    *  610-00-GETMAIN-TRSC                      A.C.ANDREATTA   *
      *    *  615-00-FREEMAIN-TRSC                     A.C.ANDREATTA   *
      *    *  620-00-GRAVA-INTERFACE-DEA               A.C.ANDREATTA   *
      *    *  625-00-START-SF30-FASE2                  E. FRIOLI JR.   *
      *    *  630-00-EMITE-ENQ-CONTROLE                E. FRIOLI JR.   *
      *    *  635-00-LIBERA-ENQ-CONTROLE               E. FRIOLI JR.   *
      *    *  640-00-EMITE-DELAY                       E. FRIOLI JR.   *
      *    *  645-00-START-SF31                        E. FRIOLI JR.   *
      *    *                                                           *
      *    *                                                           *
      *    *   SECTION PARA MOVIMENTACAO                               *
      *    *  ---------------------------                              *
      *    *                                                           *
      *    *  700-00-TRATA-PROTOCOLO                   A.C.ANDREATTA   *
      *    *  705-00-MONTA-DANFE                       E. FRIOLI JR.   *
      *    *  710-00-MONTA-PROTOCOLO                   A.C.ANDREATTA   *
      *    *  715-00-MONTA-CORPO-PROTOCOLO             A.C.ANDREATTA   *
      *    *  720-00-MONTA-PCK-LIST                    E. FRIOLI JR.   *
      *    *  725-00-MONTA-CORPO-PCK-LIST              E. FRIOLI JR.   *
      *    *  730-00-MONTA-PCK-LIST-RES                E. FRIOLI JR.   *
      *    *  735-00-MONTA-CORPO-PCK-LIST-RE           E. FRIOLI JR.   *
      *    *  740-00-PCL-DETALHE                       E. FRIOLI JR.   *
      *    *  745-00-PCL-DANFE                         E. FRIOLI JR.   *
      *    *  746-00-CALCULA-LINHAS-DANFE              E. FRIOLI JR.   *
      *    *  747-00-TRATA-QUEBRA-PAGINA               E. FRIOLI JR.   *
      *    *  750-00-PREPARA-DETALHE-DANFE             E. FRIOLI JR.   *
      *    *  755-00-PREPARA-DETALHE-PTD               A.C.ANDREATTA   *
      *    *  756-00-PREPARA-DETALHE-INST              A.C.ANDREATTA   *
      *    *  757-00-PREPARA-DETALHE-PCK-LST           E. FRIOLI JR.   *
      *    *  760-00-PREPARA-RESUMO-DANFE              E. FRIOLI JR.   *
      *    *  765-00-PREPARA-RESUMO-PTD                A.C.ANDREATTA   *
      *    *  766-00-PREPARA-RESUMO-INST               A.C.ANDREATTA   *
      *    *  767-00-PREPARA-RESUMO-PCK-LST            E. FRIOLI JR.   *
      *    *  770-00-TROCA-PONTO-CORPO                 A.C.ANDREATTA   *
      *    *  780-00-TROCA-PONTO-DETALHE               A.C.ANDREATTA   *
      *    *  790-00-MONTA-LOG-NF-TOTAL                A.C.ANDREATTA   *
      *    *  791-00-MONTA-LOG-NF-ITEM                 A.C.ANDREATTA   *
      *    *  795-00-MONTA-LOG-PROTOCOLO               A.C.ANDREATTA   *
      *    *  800-00-DESCARREGA-VIAS-DANFE             E. FRIOLI JR.   *
      *    *  805-00-GRAVA-TAB-DANFE                   E. FRIOLI JR.   *
      *    *  810-00-DESCARREGA-VIAS-PTD               A.C.ANDREATTA   *
      *    *  815-00-GRAVA-TAB-PTD                     A.C.ANDREATTA   *
      *    *  820-00-DESCARREGA-VIAS-PCK-LST           E. FRIOLI JR.   *
      *    *  825-00-GRAVA-TAB-PCK-LST                 E. FRIOLI JR.   *
      *    *  830-00-INTERFACE-SAP-DADOS-EXP           C.O.CARVALHO    *
      *    *  840-00-GERA-LANCAMENTOS-CT               A.C.ANDREATTA   *
      *    *  845-00-CONTABILIZA-ITEM                  A.C.ANDREATTA   *
      *    *  850-00-CONTABILIZA-DANFE                 A.C.ANDREATTA   *
      *    *  855-00-INTERFACE-CME-ITEM                A.C.ANDREATTA   *
      *    *  860-00-INTERFACE-CME-DANFE               A.C.ANDREATTA   *
      *    *  865-00-INTERFACE-DEA-ITEM                A.C.ANDREATTA   *
      *    *  870-00-INTERFACE-DEA-DANFE               A.C.ANDREATTA   *
      *    *  875-00-MONTA-LOG-CAPS                    E. FRIOLI JR.   *
      *    *  880-00-INTERFACE-S-DE-ITEM               E. FRIOLI JR.   *
      *    *  885-00-INTERFACE-S-DE-FAT                E. FRIOLI JR.   *
      *    *  890-00-INTERFACE-EXP-CTRL-ITM            E. FRIOLI JR.   *
      *    *  895-00-INTERFACE-EXP-CTRL-TTL            E. FRIOLI JR.   *
      *    *                                                           *
      *    *                                                           * 
      *    *   SECTION COMPLEMENTARES                                  *
      *    *  ------------------------                                 *
      *    *                                                           *
      *    *  900-00-REGISTRA-ERRO-TRNS                A.C.ANDREATTA   *
      *    *  910-00-TIPO-PEDIDO                       A.C.ANDREATTA   *
      *    *  920-00-MONTA-COD-BARRA                   A.C.ANDREATTA   *
      *    *  930-00-MONTA-COD-BARRA-PRT               E. FRIOLI JR.   *
      *    *  940-00-CONVERTE-UF                       A.C.ANDREATTA   *
      *    *  950-00-MENSAGENS-LEGAIS                  E. FRIOLI JR.   *
      *    *  960-00-INSTRUCAO-ESPECIAL                A.C.ANDREATTA   *
      *    *                                                           *
      *    *                                                           *
      *    *************************************************************
      *
       ENVIRONMENT DIVISION.
      *---------------------*
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
                DECIMAL-POINT IS COMMA.
       DATA DIVISION.
      *--------------*
      
       WORKING-STORAGE SECTION.
      *------------------------*
      
      *----------------------------------------------------------------*
      *          === AREAS PARA CONTROLE DE SQL ===          ACA 10/00 *
      *----------------------------------------------------------------*
      
           EXEC SQL INCLUDE       SQLCA
                END-EXEC.

      *----------------------------------------------------------------*
      *     === AREA PARA UTILIZACAO EM COMANDOS SQL ===     ACA 10/00 *
      *----------------------------------------------------------------*
      
           EXEC SQL BEGIN         DECLARE SECTION
                END-EXEC.
                
       01  H1SF-PTD-PROTODSP. 
           05 SF0001-PTD-CD-MERC-DST         PIC  X(001).
           05 SF0001-PTD-DTC-SEL-FTRM        PIC  X(014).
           05 SF0001-PTD-LGON-FUNC           PIC  X(008).
           05 SF0001-PTD-CD-SEQ              PIC  X(004).
           05 SF0001-PTD-CD-T-REC            PIC  X(002).
           05 SF0001-PTD-CD-T-MTZ            PIC  X(001).
           05 SF0001-PTD-ID-MTZ              PIC  X(004).
           05 SF0001-PTD-ID-CLI              PIC  X(004).
           05 SF0001-PTD-ID-PTC-DSP          PIC  X(007).
           05 SF0001-PTD-ID-PTC-DSP-E        PIC  X(010).
           05 SF0001-PTD-DTC-PTC-DSP         PIC  X(020).
           05 SF0001-PTD-CD-PGT-FRT          PIC  X(001).
           05 SF0001-PTD-CD-TRSR             PIC  X(007).
           05 SF0001-PTD-PESO-TTL-LQD        PIC  X(020).
           05 SF0001-PTD-PESO-TTL-BRT        PIC  X(020).
           05 SF0001-PTD-PESO-TTL-EMB        PIC  X(020).
           05 SF0001-PTD-Q-TTL-VOL           PIC  X(004).
           05 SF0001-PTD-V-TTL-MRCD          PIC  X(020).
           05 SF0001-PTD-PESO-TTL-LQD-LOG    PIC S9(012)V999 COMP-3.
           05 SF0001-PTD-PESO-TTL-BRT-LOG    PIC S9(012)V999 COMP-3.
           05 SF0001-PTD-PESO-TTL-EMB-LOG    PIC S9(012)V999 COMP-3.
           05 SF0001-PTD-Q-TTL-VOL-LOG       PIC  X(005).
           05 SF0001-PTD-V-TTL-MRCD-LOG      PIC S9(015)V99  COMP-3.
           05 SF0001-PTD-IC-DSP-IMPS         PIC  X(001).

       01  H1SF-ITD-ITMFATURADO. 
           05 SF0002-ITD-CD-MERC-DST         PIC  X(001).
           05 SF0002-ITD-DTC-SEL-FTRM        PIC  X(014).
           05 SF0002-ITD-LGON-FUNC           PIC  X(008).
           05 SF0002-ITD-CD-SEQ              PIC  X(004).
           05 SF0002-ITD-CD-T-REC            PIC  X(002).
           05 SF0002-ITD-CD-T-MTZ            PIC  X(001).
           05 SF0002-ITD-ID-MTZ              PIC  X(004).
           05 SF0002-ITD-ID-DCT-FSCL         PIC  X(007).
           05 SF0002-ITD-ID-CLI              PIC  X(004).
           05 SF0002-ITD-ID-CLI-PWS          PIC  X(004).
           05 SF0002-ITD-CD-NOP              PIC  X(020).
           05 SF0002-ITD-ID-PRFL             PIC  X(005).
           05 SF0002-ITD-ID-PDD              PIC  X(010).
           05 SF0002-ITD-CD-MOD-TRSP         PIC  X(001).
           05 SF0002-ITD-V-DSCT-ESP          PIC  X(013).
           05 SF0002-ITD-ID-QBR-AUX          PIC  X(010).
           05 SF0002-ITD-ID-PECA             PIC  X(020).
           05 SF0002-ITD-Q-PECA-FTRD         PIC  X(005).
           05 SF0002-ITD-Q-PECA-FTRD-CTB     PIC  X(009).
           05 SF0002-ITD-Q-PECA-FTRD-PWS     PIC  X(005).
           05 SF0002-ITD-ID-ETIQ-REC         PIC  X(010).
           05 SF0002-ITD-ID-ETIQ-REC-PWS     PIC  X(010).
           05 SF0002-ITD-ID-ETIQ-ACND        PIC  X(008).
           05 SF0002-ITD-ID-VOL              PIC  X(008).
           05 SF0002-ITD-ID-VOL-PWS          PIC  X(008).
           05 SF0002-ITD-SRIE-PECA           PIC  X(012).
           05 SF0002-ITD-PREC-FTRD-UNT-EMIF  PIC  X(013).
           05 SF0002-ITD-CD-T-PGT            PIC  X(002).
           05 SF0002-ITD-RATE-US             PIC  X(005).
           05 SF0002-ITD-RATE-PGT            PIC  X(005).
           05 SF0002-ITD-V-FRT               PIC  X(013).
           05 SF0002-ITD-V-FRT-R REDEFINES SF0002-ITD-V-FRT.
              10 SF0002-ITD-V-FRT-FILL       PIC  X(004).
              10 SF0002-ITD-V-FRT-9          PIC  X(009).
           05 SF0002-ITD-PERC-TX-SERV        PIC  X(005).
           05 SF0002-ITD-PERC-SUR-CHRG       PIC  X(005).
           05 SF0002-ITD-V-TX-SERV           PIC  X(013).
           05 SF0002-ITD-V-TX-SERV-R REDEFINES SF0002-ITD-V-TX-SERV.
              10 SF0002-ITD-V-TX-SERV-FILL   PIC  X(004).
              10 SF0002-ITD-V-TX-SERV-9      PIC  X(009).
           05 SF0002-ITD-V-SUR-CHRG          PIC  X(013).
           05 SF0002-ITD-V-SUR-CHRG-R REDEFINES SF0002-ITD-V-SUR-CHRG.
              10 SF0002-ITD-V-SUR-CHRG-FILL  PIC  X(004).
              10 SF0002-ITD-V-SUR-CHRG-9     PIC  X(009).
           05 SF0002-ITD-PERC-DSCT           PIC  X(005).
           05 SF0002-ITD-CD-MOD-TRSP-LOG     PIC  X(001).
           05 SF0002-ITD-ID-ETIQ-REC-LOG     PIC  X(010).
           05 SF0002-ITD-DTC-NF-LOG          PIC  X(008).
           05 SF0002-ITD-HOR-NF-LOG          PIC  X(006).
           05 SF0002-ITD-CD-SUFR-LOG         PIC  X(012).
           05 SF0002-ITD-ID-NF-LOG           PIC  X(009).
           05 SF0002-ITD-ID-NF-PWS           PIC  X(009).
           05 SF0002-ITD-CD-NF-LOG           PIC  X(001).
           05 SF0002-ITD-CD-T-PGT-LOG        PIC  X(002).
           05 SF0002-ITD-ID-VOL-LOG          PIC  X(008).
           05 SF0002-ITD-ID-PDD-LOG          PIC  X(010).
           05 SF0002-ITD-ID-PECA-LOG         PIC  X(020).
           05 SF0002-ITD-ID-ETIQ-ACND-LOG    PIC  X(008).
           05 SF0002-ITD-FTR-EXP-LOG         PIC  X(007).
           05 SF0002-ITD-DTC-FTR-EXP         PIC  X(014).
           05 SF0002-ITD-FTR-EXP             PIC  X(007).
           05 SF0002-ITD-ID-CLI-REF          PIC  X(004).
           05 SF0002-ITD-ID-ITM-DE           PIC  X(012).
           05 SF0002-ITD-NM-PECA             PIC  X(020).
           05 SF0002-ITD-NF-TIMESTAMP        PIC  X(026).
           05 SF0002-ITD-V-ADC-IPI           PIC  X(013).
           05 SF0002-ITD-V-ADC-IPI-R REDEFINES SF0002-ITD-V-ADC-IPI.
              10 SF0002-ITD-V-ADC-IPI-FILL   PIC  X(004).
              10 SF0002-ITD-V-ADC-IPI-9      PIC  X(009).
           05 SF0002-ITD-PESO-LQD-PECA       PIC  X(008).
           05 SF0002-ITD-PESO-BRT-PECA       PIC  X(008).
           05 SF0002-ITD-V-CAS-RMAN-ODA      PIC  X(013).
           05 SF0002-ITD-V-CAS-RMAN-ODA-R REDEFINES
                                              SF0002-ITD-V-CAS-RMAN-ODA.
              10 SF0002-ITD-V-RMAN-ODA-FILL  PIC  X(004).
              10 SF0002-ITD-V-RMAN-ODA-9     PIC  X(009).
           05 SF0002-ITD-V-CAS-RMAN-CMIS2    PIC  X(013).
           05 SF0002-ITD-V-CAS-RMAN-CMIS2-R REDEFINES
                                            SF0002-ITD-V-CAS-RMAN-CMIS2.
              10 SF0002-ITD-V-RMAN-CMIS2-FILL PIC  X(004).
              10 SF0002-ITD-V-RMAN-CMIS2-9   PIC  X(009).
           05 SF0002-ITD-ID-CASC-CBL         PIC  X(020).
           05 SF0002-ITD-PREC-US-DN-CORE     PIC  X(015).
           05 SF0002-ITD-PREC-US-IC-CORE     PIC  X(015).
           05 SF0002-ITD-V-US-RT-FRT         PIC  X(009).
           05 SF0002-ITD-V-US-RT-SGR         PIC  X(009).
           05 SF0002-ITD-V-US-RT-ODA         PIC  X(009).
           05 SF0002-ITD-V-AI-CHRG-API       PIC  X(015).
           05 SF0002-ITD-V-EMG-CHRG-API      PIC  X(015).
           05 SF0002-ITD-V-MKT-DISC-API      PIC  X(015).
           05 SF0002-ITD-ID-FTR-API-LOG      PIC  X(012).
           05 SF0002-ITD-V-US-ARED-CES-ODA   PIC  X(009).
           05 SF0002-ITD-V-SUR-CHRG-API      PIC  X(015).

       01  H1SF-TPT-TRANSPORTADORA. 
           05 SF0003-TPT-ID-CLI              PIC  X(004).
           05 SF0003-TPT-CD-MOD-TRSP         PIC  X(001).
           05 SF0003-TPT-CD-TRSR             PIC  X(007).
           05 SF0003-TPT-CD-TRSR-DSP         PIC  X(007).

       01  H1SF-SUF-SUFRAMA. 
           05 SF0004-SUF-CD-SUFR             PIC  X(012).

       01  H1SF-SFT-SELECAO-FTRM.
           05 SF0005-SFT-CD-T-REC            PIC  X(002).
           05 SF0005-SFT-ID-AGRP             PIC  X(005).
           05 SF0005-SFT-ID-IMPR-FTRM        PIC  X(010).
           05 SF0005-SFT-IC-FTRM-TRGD        PIC  X(001).
           05 SF0005-SFT-IC-NACZ-ICPN-BT     PIC  X(001).
           05 SF0005-SFT-CD-MERC-DST-ORIG    PIC  X(001).
           05 SF0005-SFT-DTC-SEL-FTRM-ORIG   PIC  X(014).
           05 SF0005-SFT-LGON-FUNC-ORIG      PIC  X(008).

       01  H1SF-AID-AIDF. 
           05 SF0006-AID-ID-AIDF             PIC  X(006).
           05 SF0006-AID-ID-NF-INL           PIC  X(009).
           05 SF0006-AID-ID-NF-FNL           PIC  X(009).

       01  H1SF-CTB-LANCAMENTOS. 
           05 SF0007-CTB-CD-MERC-DST         PIC  X(001).
           05 SF0007-CTB-CD-T-REC            PIC  X(002).
           05 SF0007-CTB-CD-T-MTZ            PIC  X(001).
           05 SF0007-CTB-ID-MTZ              PIC  X(004).
           05 SF0007-CTB-ID-CLI              PIC  X(004).
           05 SF0007-CTB-ID-NF               PIC  X(009).
           05 SF0007-CTB-DTC-NF              PIC  X(014).
           05 SF0007-CTB-CD-CFOP             PIC  X(005).
           05 SF0007-CTB-CD-T-CT             PIC  X(001).
           05 SF0007-CTB-DS-CT               PIC  X(020).
           05 SF0007-CTB-ID-CT               PIC  X(010).
           05 SF0007-CTB-V-LCTO-CTB          PIC  X(013).
           05 SF0007-CTB-ID-LD               PIC  X(005).

       01  H1SF-SPP-PROGRAMAS. 
           05 SF0008-SPP-ID-CT-CTBL          PIC  X(001).
           
       01  H1SF-SUP-FORNECEDOR. 
           05 SF0009-SUP-CD-FNT-ATND         PIC  X(006).
           05 SF0009-SUP-CD-FORN-SPR         PIC  X(007).

       01  H1SF-CLS-CLASSE-FISCAL.
           05 SF0010-CLS-ID-CLS-FSC          PIC  X(006).
           05 SF0010-CLS-NM-CLS              PIC  X(255).
           05 SF0010-CLS-IC-SBSC-TRBT        PIC  X(001).
           05 SF0010-CLS-IC-PRD-PGSO         PIC  X(001).
           05 SF0010-CLS-IC-RDC-BS           PIC  X(001).
           05 SF0010-CLS-IC-RDC-PERC         PIC  X(001).
           05 SF0010-CLS-IC-CLS-ATV          PIC  X(001).
           05 SF0010-CLS-LGON-ULT-ALTC       PIC  X(008).
           05 SF0010-CLS-DTC-ULT-ALTC        PIC  X(014).

       01  H1SF-RGI-REGIAO.
           05 SF0011-RGI-RATE-RDC-BS         PIC  X(005).
           05 SF0011-RGI-RATE-RDC-PERC       PIC  X(005).

       01  H1SF-IMP-IMPORTADOR. 
           05 SF0012-IMP-CD-IMPT             PIC  X(006).
           05 SF0012-IMP-NM-IMPT             PIC  X(050).
           05 SF0012-IMP-END-IMPT            PIC  X(050).
           05 SF0012-IMP-BAI-IMPT            PIC  X(025).
           05 SF0012-IMP-CID-IMPT            PIC  X(050).
           05 SF0012-IMP-UF-IMPT             PIC  X(002).
           05 SF0012-IMP-CD-CEP              PIC  X(009).
           05 SF0012-IMP-PAIS-IMPT           PIC  X(025).
           05 SF0012-IMP-SL-PAIS             PIC  X(002).
           05 SF0012-IMP-NM-PAIS-ING         PIC  X(025).
           05 SF0012-IMP-RSP-IMPT            PIC  X(025).
           05 SF0012-IMP-DESC-IMPT           PIC  X(050).
           05 SF0012-IMP-NM-DPT              PIC  X(035).
           05 SF0012-IMP-T-MERC-DST          PIC  X(010).
           05 SF0012-IMP-CD-FBR              PIC  X(002).
           05 SF0012-IMP-CD-VAT              PIC  X(002).
           05 SF0012-IMP-ID-VAT              PIC  X(025).
           05 SF0012-IMP-DTC-ULT-ATUA        PIC  X(008).
           05 SF0012-IMP-LGON-ULT-ATUA       PIC  X(008).

       01  H1SF-SHT-SHIP-TO. 
           05 SF0013-SHT-CD-CLI              PIC  X(005).
           05 SF0013-SHT-NM-CLI              PIC  X(050).
           05 SF0013-SHT-DS-CLI              PIC  X(050).
           05 SF0013-SHT-END-CLI             PIC  X(060).
           05 SF0013-SHT-CID-CLI             PIC  X(050).
           05 SF0013-SHT-UF-CLI              PIC  X(002).
           05 SF0013-SHT-CD-CEP              PIC  X(009).
           05 SF0013-SHT-PAIS-CLI            PIC  X(025).
           05 SF0013-SHT-NM-RSP              PIC  X(025).
           05 SF0013-SHT-CD-FBR              PIC  X(002).
           05 SF0013-SHT-CD-VAT              PIC  X(002).
           05 SF0013-SHT-ID-VAT              PIC  X(025).
           05 SF0013-SHT-DTC-ULT-ATUA        PIC  X(008).
           05 SF0013-SHT-LGON-ULT-ATUA       PIC  X(008).

       01  H1SF-CON-CONSIGNATARIO. 
           05 SF0014-CON-CD-CSG              PIC  X(005).
           05 SF0014-CON-NM-CSG              PIC  X(050).
           05 SF0014-CON-END-CSG             PIC  X(060).
           05 SF0014-CON-CID-CSG             PIC  X(025).
           05 SF0014-CON-UF-CSG              PIC  X(002).
           05 SF0014-CON-CD-CEP              PIC  X(009).
           05 SF0014-CON-PAIS-CSG            PIC  X(025).
           05 SF0014-CON-NM-RSP              PIC  X(025).
           05 SF0014-CON-CD-FBR              PIC  X(002).
           05 SF0014-CON-CD-VAT              PIC  X(002).
           05 SF0014-CON-ID-VAT              PIC  X(025).
           05 SF0014-CON-DTC-ULT-ATUA        PIC  X(008).
           05 SF0014-CON-LGON-ULT-ATUA       PIC  X(008).

       01  H1SF-LED-LOCAL-EMBARQUE-DEST.
           05 SF0015-LED-CD-LCL              PIC  X(005).
           05 SF0015-LED-NOM-LCL             PIC  X(050).
           05 SF0015-LED-CID-LCL             PIC  X(030).
           05 SF0015-LED-PAIS-LCL            PIC  X(025).
           05 SF0015-LED-T-LCL               PIC  X(001).
           05 SF0015-LED-CD-UF-LCL           PIC  X(002).
           05 SF0015-LED-DTC-ULT-ATUA        PIC  X(008).
           05 SF0015-LED-LGON-ULT-ATUA       PIC  X(008).

       01  H1SF-CRO-CARE-OF. 
           05 SF0016-CRO-CD-CAREOF           PIC  X(007).
           05 SF0016-CRO-NM-CAREOF           PIC  X(050).
           05 SF0016-CRO-END-CAREOF          PIC  X(060).
           05 SF0016-CRO-CID-CAREOF          PIC  X(025).
           05 SF0016-CRO-PAIS-CAREOF         PIC  X(025).
           05 SF0016-CRO-NM-RSP              PIC  X(025).
           05 SF0016-CRO-CD-CEP              PIC  X(009).
           05 SF0016-CRO-DTC-ULT-ATUA        PIC  X(008).
           05 SF0016-CRO-LGON-ULT-ATUA       PIC  X(008).

       01  H1SF-TEV-TERMO-VENDAS. 
           05 SF0017-TEV-CD-TRM-VND          PIC  X(003).
           05 SF0017-TEV-DS-TRM-VND          PIC  X(020).
           05 SF0017-TEV-IC-APL-DSCT         PIC  X(001).
           05 SF0017-TEV-DTC-ULT-ATUA        PIC  X(008).
           05 SF0017-TEV-LGON-ULT-ATUA       PIC  X(008).

       01  H1SF-FTE-FATURAS-TRSP-EXP.
           05 SF0018-FTE-DTC-MVTO            PIC  X(010).
           05 SF0018-FTE-CD-MOD-TRSP         PIC  X(001).
           05 SF0018-FTE-CD-T-TRSP           PIC  X(020).
           05 SF0018-FTE-ID-SQN-TRSP         PIC  X(002).
           05 SF0018-FTE-FTR-EXP             PIC  X(007).
           05 SF0018-FTE-CD-FASE             PIC  X(001).
           05 SF0018-FTE-ID-DCT-TRSP         PIC  X(009).
           05 SF0018-FTE-CD-IMPT             PIC  X(006).
           05 SF0018-FTE-CD-CLI              PIC  X(005).
           05 SF0018-FTE-CD-PRT-SD           PIC  X(005).
           05 SF0018-FTE-CD-PRT-ETD          PIC  X(005).
           05 SF0018-FTE-CD-CAREOF           PIC  X(007).
           05 SF0018-FTE-CD-CSG              PIC  X(005).
           05 SF0018-FTE-CD-TRM-VND          PIC  X(003).
           05 SF0018-FTE-CD-TRM-PGT          PIC  X(030).
           05 SF0018-FTE-CD-TRSR             PIC  X(007).
           05 SF0018-FTE-DTC-DE              PIC  X(008).
           05 SF0018-FTE-ID-DE               PIC  X(015).
           05 SF0018-FTE-DTC-SD              PIC  X(008).
           05 SF0018-FTE-ID-SD               PIC  X(025).
           05 SF0018-FTE-DTC-ENVI-DE         PIC  X(014).
           05 SF0018-FTE-DTC-SD-FBR          PIC  X(008).
           05 SF0018-FTE-DTC-AVRB            PIC  X(008).
           05 SF0018-FTE-DTC-CHD-FRNT        PIC  X(008).
           05 SF0018-FTE-DTC-CRZ-FRNT        PIC  X(008).
           05 SF0018-FTE-DTC-FNL-PRC         PIC  X(014).
           05 SF0018-FTE-LGON-FNL-PRC        PIC  X(008).
           05 SF0018-FTE-DTC-INCL-PRC        PIC  X(014).
           05 SF0018-FTE-LGON-INCL-PRC       PIC  X(008).
           05 SF0018-FTE-DTC-ATUA-RE         PIC  X(014).
           05 SF0018-FTE-LGON-ATUA-RE        PIC  X(008).
           05 SF0018-FTE-DTC-ATUA-SD         PIC  X(014).
           05 SF0018-FTE-LGON-ATUA-SD        PIC  X(008).
           05 SF0018-FTE-DTC-ULT-ATUA        PIC  X(014).
           05 SF0018-FTE-LGON-ULT-ATUA       PIC  X(008).
           05 SF0018-FTE-LGON-RSP-EXP        PIC  X(008).
           05 SF0018-FTE-CD-T-DE             PIC  X(003).

       01  H1SF-SUP-FORNECEDOR. 
           05 SF0019-SUP-CD-FNT-ATND          PIC  X(006).
           05 SF0019-SUP-CD-FORN-SPR          PIC  X(007).

       01  H1SF-TIP-PAGAMENTO. 
           05 SF0020-TIP-Q-DIA-PGT            PIC  X(003).

       01  H1SF-CES-DESPESAS-FATURA.
           05 SF0021-ID-FTR                  PIC  X(007).
           05 SF0021-V-FEE1-CES              PIC  X(015).
           05 SF0021-V-FEE2-CES              PIC  X(015).
           05 SF0021-V-FEE3-CES              PIC  X(015).
           05 SF0021-V-FEE4-DISC-CES         PIC  X(015).
           05 SF0021-V-CES-TOTAL             PIC  X(015).
           
       01  B8CC-COR-DOF. 
           05 CC0001-IND-ENTRADA-SAIDA       PIC  X(001).
           05 CC0001-PRECO-TOTAL-M           PIC S9(015)V99 COMP-3.
           05 CC0001-SERIE-SUBSERIE          PIC  X(006).
           05 CC0001-SERIE-SUBSERIE-R REDEFINES CC0001-SERIE-SUBSERIE.
              10 CC0001-SERIE-SUBSERIE-2     PIC  X(002).
              10 CC0001-SERIE-SUBSERIE-FILL  PIC  X(004).
           05 CC0001-SERIE-SUBSERIE-R1 REDEFINES CC0001-SERIE-SUBSERIE.
              10 CC0001-SERIE-SUBSERIE-3     PIC  X(003).
              10 CC0001-SERIE-SUBSERIE-FILL1 PIC  X(003).
           05 CC0001-VL-AJUSTE-PRECO-TOTAL-M PIC S9(015)V99 COMP-3.
           05 CC0001-VL-FISCAL-M             PIC S9(015)V99 COMP-3.
           05 CC0001-VL-FRETE                PIC S9(015)V99 COMP-3.
           05 CC0001-VL-OUTRAS-DESPESAS      PIC S9(015)V99 COMP-3.
           05 CC0001-VL-SEGURO               PIC S9(015)V99 COMP-3.
           05 CC0001-VL-TOTAL-BASE-ICMS      PIC S9(015)V99 COMP-3.
           05 CC0001-VL-TOTAL-BASE-STF       PIC S9(015)V99 COMP-3.
           05 CC0001-VL-TOTAL-BASE-IPI-CTB   PIC  X(018).
           05 CC0001-VL-TOTAL-BASE-IPI-DEA   PIC  X(013).
           05 CC0001-VL-TOTAL-BASE-ICMS-CTB  PIC  X(018).
           05 CC0001-VL-TOTAL-BASE-ICMS-DEA  PIC  X(013).
           05 CC0001-VL-TOTAL-BASE-STF-CTB   PIC  X(018).
           05 CC0001-VL-TOTAL-BASE-STF-DEA   PIC  X(013).
           05 CC0001-VL-TOTAL-BASE-ISS-CTB   PIC  X(018).
           05 CC0001-VL-TOTAL-IPI-CTB        PIC  X(018).
           05 CC0001-VL-TOTAL-IPI-DEA        PIC  X(013).
           05 CC0001-VL-TOTAL-ICMS-CTB       PIC  X(018).
           05 CC0001-VL-TOTAL-ICMS-DEA       PIC  X(013).
           05 CC0001-VL-TOTAL-STF-CTB        PIC  X(018).
           05 CC0001-VL-TOTAL-STF-DEA        PIC  X(013).
           05 CC0001-VL-TOTAL-IRRF-CTB       PIC  X(018).
           05 CC0001-VL-FRETE-CTB            PIC  X(018).
           05 CC0001-VL-FRETE-DEA            PIC  X(013).
           05 CC0001-VL-OUTRAS-DESPESAS-CTB  PIC  X(018).
           05 CC0001-VL-OUTRAS-DESPESAS-DEA  PIC  X(013).
           05 CC0001-VL-SEGURO-CTB           PIC  X(018).
           05 CC0001-PRECO-TOTAL-M-CTB       PIC  X(018).
           05 CC0001-PRECO-TOTAL-M-DEA       PIC  X(013).
           05 CC0001-VL-TOTAL-CONTABIL-CTB   PIC  X(018).
           05 CC0001-VL-TOTAL-CONTABIL-DEA   PIC  X(013).
           05 CC0001-VL-TOTAL-CONTABIL       PIC S9(015)V99 COMP-3.
           05 CC0001-VL-TOTAL-ICMS           PIC S9(015)V99 COMP-3.
           05 CC0001-VL-TOTAL-IPI            PIC S9(015)V99 COMP-3.
           05 CC0001-VL-TOTAL-STF            PIC S9(015)V99 COMP-3.
           05 CC0001-CFOP-CODIGO             PIC  X(008).
           05 CC0001-CFOP-CODIGO-LOG         PIC  X(004).
           05 CC0001-DESTINATARIO-PFJ-CODIGO PIC  X(020).
           05 CC0001-DH-EMISSAO              PIC  X(010).
           05 CC0001-DH-EMISSAO-R REDEFINES CC0001-DH-EMISSAO.
              10 CC0001-DH-EMISSAO-FILL      PIC  X(008).
              10 CC0001-DH-EMISSAO-SEC       PIC  X(002).
           05 CC0001-DH-EMISSAO-I            PIC  X(010).
           05 CC0001-DH-EMISSAO-I-R REDEFINES CC0001-DH-EMISSAO-I.
              10 CC0001-DH-EMISSAO-I-FILL-1  PIC  X(002).
              10 CC0001-DH-EMISSAO-I-SEC     PIC  X(002).
              10 CC0001-DH-EMISSAO-I-FILL-2  PIC  X(006).
           05 CC0001-DH-EMISSAO-BARRA        PIC  X(008).
           05 CC0001-IND-RESP-FRETE          PIC  X(001).
           05 CC0001-NOP-CODIGO              PIC  X(020).
           05 CC0001-NOP-CODIGO-R REDEFINES CC0001-NOP-CODIGO.
              10 CC0001-NOP-COD-1            PIC  X(003).
              10 CC0001-NOP-FILL-1           PIC  X(001).
              10 CC0001-NOP-COD-2            PIC  X(002).
              10 CC0001-NOP-FILL-2           PIC  X(014).
           05 CC0001-NUMERO                  PIC  X(012).
           05 CC0001-NUMERO-CTB              PIC  X(005).
           05 CC0001-NUMERO-CTB-6            PIC  X(006).
           05 CC0001-NUMERO-CTB-6-R REDEFINES CC0001-NUMERO-CTB-6.
              10 CC0001-NUMERO-CTB-6-FILL-1  PIC  X(001).
              10 CC0001-NUMERO-CTB-5         PIC  X(005).
           05 CC0001-NUMERO-DEA              PIC  X(009).
           05 CC0001-PESO-BRUTO-KG           PIC S9(013)V9999 COMP-3.
           05 CC0001-PESO-BRUTO-KG-DEA       PIC  X(014).
           05 CC0001-PESO-LIQUIDO-KG         PIC S9(013)V9999 COMP-3.
           05 CC0001-TRANSPORTADOR-PFJ-COD   PIC  X(020).
           05 CC0001-DOF-SEQUENCE            PIC  X(015).
           05 CC0001-PESO-BRUTO-KG-LOG       PIC S9(013)V999  COMP-3.
           05 CC0001-VL-OUTRAS-DESPESAS-LOG  PIC S9(015)V99 COMP-3.
           05 CC0001-VL-FRETE-LOG            PIC S9(015)V99 COMP-3.
           05 CC0001-VL-SEGURO-LOG           PIC S9(015)V99 COMP-3.
           05 CC0001-VL-DESCONTO-LOG         PIC S9(015)V99 COMP-3.
           05 CC0001-VL-DESCONTO-DEA         PIC  X(013).
           05 CC0001-PRECO-TOTAL-M-LOG       PIC S9(015)V99 COMP-3.
           05 CC0001-VL-TOTAL-BASE-ICMS-LOG  PIC S9(015)V99 COMP-3.
           05 CC0001-VL-TOTAL-BASE-STF-LOG   PIC S9(015)V99 COMP-3.
           05 CC0001-VL-TOTAL-STF-LOG        PIC S9(015)V99 COMP-3.
           05 CC0001-VL-TOTAL-ICMS-LOG       PIC S9(015)V99 COMP-3.
           05 CC0001-VL-TOTAL-IPI-LOG        PIC S9(015)V99 COMP-3.
           05 CC0001-VL-TOTAL-CONTABIL-LOG   PIC S9(015)V99 COMP-3.
           05 CC0001-VL-TOTAL-PIS-PASEP-LOG  PIC S9(011)V99 COMP-3.
           05 CC0001-VL-TOTAL-COFINS-LOG     PIC S9(011)V99 COMP-3.
           05 CC0001-PLACA-VEICULO-UF-CODIGO PIC  X(002).
           05 CC0001-NUM-PLACA-VEICULO       PIC  X(007).
           05 CC0001-SUBSTITUIDO-PFJ-CODIGO  PIC  X(020).
           05 CC0001-NFE-CONTINGENCIA        PIC  X(001).
           05 CC0001-NFE-LOCALIZADOR         PIC  X(044).
           05 CC0001-DT-SAIDA-MERCADORIAS    PIC  X(010).
           05 CC0001-NFE-PROTOCOLO           PIC  X(015).
           05 CC0001-CTRL-DT-ULT-ALTERACAO   PIC  X(019).
           05 CC0001-NFE-COD-SITUACAO        PIC  X(050).
           05 CC0001-UF-CODIGO-EMITENTE      PIC  X(002).
           05 CC0001-VL-TOTAL-FCP-ST         PIC S9(015)V99 COMP-3.

       01  B8CC-COR-IDF. 
           05 CC0002-ALIQ-ICMS               PIC S9(013)V9999 COMP-3.
           05 CC0002-ALIQ-ICMS-LOG           PIC  X(006).
           05 CC0002-ALIQ-ICMS-LOG-R REDEFINES CC0002-ALIQ-ICMS-LOG.
              10 CC0002-ALIQ-ICMS-LOG-FILL   PIC  X(001).
              10 CC0002-ALIQ-ICMS-LOG-5      PIC  X(005).
           05 CC0002-ALIQ-IPI-LOG            PIC  X(006).
           05 CC0002-ALIQ-IPI-LOG-R REDEFINES CC0002-ALIQ-IPI-LOG.
              10 CC0002-ALIQ-IPI-LOG-FILL    PIC  X(001).
              10 CC0002-ALIQ-IPI-LOG-5       PIC  X(005).
           05 CC0002-ALIQ-IPI                PIC S9(013)V9999 COMP-3.
           05 CC0002-ALIQ-IPI-CTB            PIC  X(004).
           05 CC0002-PRECO-TOTAL             PIC S9(015)V99   COMP-3.
           05 CC0002-PRECO-TOTAL-CTB         PIC  X(018).
           05 CC0002-PRECO-TOTAL-CTB-1       PIC  X(018).
           05 CC0002-PRECO-TOTAL-CTB-2       PIC  X(018).
           05 CC0002-PRECO-TOTAL-DEA         PIC  X(013).
           05 CC0002-PRECO-TOTAL-DEA-NUM REDEFINES 
                                                 CC0002-PRECO-TOTAL-DEA.
              10 CC0002-PRECO-TOT-DEA-N      PIC  9(011)V99.           
           05 CC0002-PRECO-TOTAL-DEA-US      PIC  9(011)V99.
           05 CC0002-PRECO-TOTAL-DEA-CHR REDEFINES 
                                              CC0002-PRECO-TOTAL-DEA-US.
              10 CC0002-PRECO-TOT-DEA-US-X   PIC  X(013).           
           05 CC0002-PRECO-UNITARIO          PIC  X(013).
           05 CC0002-PRECO-UNITARIO-LOG      PIC S9(009)V99   COMP-3.
           05 CC0002-PRECO-UNITARIO-CME      PIC  X(018).
           05 CC0002-PRECO-UNITARIO-CTB      PIC  X(016).
           05 CC0002-PRECO-UNITARIO-DEA      PIC  X(013).
           05 CC0002-PRECO-UNITARIO-DEA-NUM REDEFINES 
                                              CC0002-PRECO-UNITARIO-DEA.
              10 CC0002-PRECO-UNITARIO-DEA-N PIC  9(011)V99.
           05 CC0002-PRECO-UNITARIO-DEA-US   PIC  9(011)V99.           
           05 CC0002-PRECO-UNIT-DEA-CHR REDEFINES 
                                           CC0002-PRECO-UNITARIO-DEA-US.
              10 CC0002-PRECO-UNIT-DEA-US-X  PIC  X(013).           
           05 CC0002-QTD                     PIC  X(007).
           05 CC0002-QTD-DEA                 PIC  X(005).
           05 CC0002-VL-IPI                  PIC S9(015)V99   COMP-3.
           05 CC0002-VL-BASE-IPI             PIC  X(018).
           05 CC0002-VL-IPI-CTB              PIC  X(016).
           05 CC0002-VL-IPI-DEA              PIC  X(013).
           05 CC0002-ENTSAI-UNI-CODIGO       PIC  X(006).
           05 CC0002-IDF-TEXTO-COMPLEMENTAR  PIC  X(1000).
           05 CC0002-MERC-CODIGO             PIC  X(030).
           05 CC0002-MERC-CODIGO-LIMPO       PIC  X(030).
           05 CC0002-NBM-CODIGO              PIC  X(012).
           05 CC0002-NBM-CODIGO-E            PIC  X(010).
           05 CC0002-NBM-CODIGO-DEA          PIC  X(008).
           05 CC0002-OM-CODIGO               PIC  X(001).
           05 CC0002-STC-CODIGO              PIC  X(002).
           05 CC0002-IDF-NUM                 PIC  X(006).
           05 CC0002-IDF-NUM-R REDEFINES CC0002-IDF-NUM.
              10 CC0002-IDF-NUM-FILL         PIC  X(004).
              10 CC0002-IDF-NUM-2            PIC  X(002).
           05 CC0002-IDF-NUM-R1 REDEFINES CC0002-IDF-NUM.
              10 CC0002-IDF-NUM-FILL-1       PIC  X(002).
              10 CC0002-IDF-NUM-4            PIC  X(004).
           05 CC0002-IDF-NUM-CTB             PIC  X(006).
           05 CC0002-DESCONTO-ITEM-LOG       PIC S9(009)V99   COMP-3.
           05 CC0002-DESCONTO-ITEM-DEA       PIC  X(013).
           05 CC0002-VL-TRIBUTAVEL-ICMS      PIC S9(009)V99   COMP-3.
           05 CC0002-VL-ICMS                 PIC S9(009)V99   COMP-3.
           05 CC0002-VL-IMPOSTO-PIS          PIC S9(009)V99   COMP-3.
           05 CC0002-VL-IMPOSTO-COFINS       PIC S9(009)V99   COMP-3.
           05 CC0002-VL-ALIQ-PIS             PIC  X(006).
           05 CC0002-VL-ALIQ-PIS-R REDEFINES CC0002-VL-ALIQ-PIS.
              10 CC0002-VL-ALIQ-PIS-FILL     PIC  X(001).
              10 CC0002-VL-ALIQ-PIS-5        PIC  X(005).
           05 CC0002-VL-ALIQ-COFINS          PIC  X(006).
           05 CC0002-VL-ALIQ-COFINS-R REDEFINES CC0002-VL-ALIQ-COFINS.
              10 CC0002-VL-ALIQ-COFINS-FILL  PIC  X(001).
              10 CC0002-VL-ALIQ-COFINS-5     PIC  X(005).
           05 CC0002-VL-ICMS-CME             PIC  X(018).
           05 CC0002-VL-IPI-CME              PIC  X(018).
           05 CC0002-VL-BASE-ICMS            PIC  X(018).
           05 CC0002-VL-BASE-ICMS-DEA        PIC  X(013).
           05 CC0002-VL-ICMS-CTB             PIC  X(016).
           05 CC0002-VL-ICMS-DEA             PIC  X(013).
           05 CC0002-FRETE-DEA               PIC  X(013).
           05 CC0002-VL-BASE-STF             PIC  X(018).
           05 CC0002-VL-TRIBUTAVEL-STF       PIC  X(018).
           05 CC0002-VL-STF-CTB              PIC  X(016).
           05 CC0002-IC-NF-TRBT              PIC  X(001).
           05 CC0002-FAT-BASE-CALC-STF       PIC S9(005)V9999 COMP-3.
           05 CC0002-CFOP-CODIGO             PIC  X(004).
           05 CC0002-VL-FISCAL               PIC S9(009)V99   COMP-3.
           05 CC0002-VL-BASE-STT             PIC  X(018).
           05 CC0002-NOP-CODIGO              PIC  X(020).
           05 CC0002-NOP-CODIGO-R REDEFINES CC0002-NOP-CODIGO.
              10 CC0002-NOP-COD-1            PIC  X(003).
              10 CC0002-NOP-FILL-1           PIC  X(001).
              10 CC0002-NOP-COD-2            PIC  X(002).
              10 CC0002-NOP-FILL-2           PIC  X(014).
           05 CC0002-VL-PIS-ST               PIC  X(018).
           05 CC0002-VL-COFINS-ST            PIC  X(018).
           05 CC0002-VL-ICMS-FCPST           PIC  X(016).
           05 CC0002-STA-CODIGO              PIC  X(002).
           05 CC0002-STN-CODIGO              PIC  X(002).
           
       01  B8CC-COR-NATUREZA-DE-OPERACAO. 
           05 CC0003-DESCRICAO-RESUMIDA      PIC  X(030).

       01  B8CC-COR-PESSOA-VIGENTE. 
           05 CC0004-RAZAO-SOCIAL            PIC  X(055).
           05 CC0004-CPF-CGC                 PIC  X(019).
           05 CC0004-CPF-CGC-E               PIC  X(065).
           05 CC0004-ENDERECO                PIC  X(090).
           05 CC0004-BAIRRO                  PIC  X(060).
           05 CC0004-CEP                     PIC  X(020).
           05 CC0004-MUN-NOME                PIC  X(060).
           05 CC0004-MUN-NOME-E              PIC  X(065).
           05 CC0004-TELEFONE1               PIC  X(030).
           05 CC0004-UF-CODIGO               PIC  X(002).
           05 CC0004-PAIS                    PIC  X(080).
           05 CC0004-INSCR-ESTADUAL          PIC  X(030).
           05 CC0004-INSCR-ESTADUAL-E        PIC  X(065).
           05 CC0004-ENDERECO-EPD            PIC  X(100).
           05 CC0004-COMPLEMENTO-EPD         PIC  X(100).
           05 CC0004-BAIRRO-MUN-NOME-UF-EPD  PIC  X(100).

       01  B8CC-COR-MERCADORIA. 
           05 CC0005-NOME                    PIC  X(012).
           05 CC0005-DESCRICAO               PIC  X(255).

       01  B8CC-COR-PESSOA-VIGENTE-TRANSP. 
           05 CC0005-RAZAO-SOCIAL            PIC  X(055).
           05 CC0005-RAZAO-SOCIAL-E          PIC  X(060).
           05 CC0005-RAZAO-SOCIAL-N          PIC  X(100).
           05 CC0005-CPF-CGC                 PIC  X(019).
           05 CC0005-CPF-CGC-E               PIC  X(030).
           05 CC0005-ENDERECO                PIC  X(090).
           05 CC0005-ENDERECO-E              PIC  X(100).
           05 CC0005-ENDERECO-N              PIC  X(200).
           05 CC0005-MUN-NOME                PIC  X(060).
           05 CC0005-UF-CODIGO               PIC  X(002).
           05 CC0005-INSCR-ESTADUAL          PIC  X(030).
           05 CC0005-INSCR-ESTADUAL-E        PIC  X(031).

       01  B8CC-COR-MENSAGEM.
           05 CC0006-ID                      PIC  X(0015).
           05 CC0006-MENSAGEM                PIC  X(1200).
           05 CC0006-MENSAGEM-R REDEFINES CC0006-MENSAGEM.
              10 CC0006-MENSAGEM-1           PIC  X(0001).
              10 CC0006-MENSAGEM-1199        PIC  X(1199).

       01  B8CC-COR-REGISTRO-PESSOA-UF. 
           05 CC0007-PFJ-CODIGO              PIC  X(020).
           05 CC0007-UF-CODIGO               PIC  X(002).
           05 CC0007-INSCR-ESTADUAL          PIC  X(030).

       01  B8CC-COR-PESSOA-VIGENTE-EMIT.
           05 CC0008-RAZAO-SOCIAL-E          PIC  X(100).
           05 CC0008-RAZAO-SOCIAL-EPM        PIC  X(100).
           05 CC0008-ENDERECO-ED             PIC  X(094).
           05 CC0008-ENDERECO-EP             PIC  X(100).
           05 CC0008-ENDERECO-EI             PIC  X(100).
           05 CC0008-BAIRRO-EP               PIC  X(060).
           05 CC0008-BAIRRO-CEP-ED           PIC  X(100).
           05 CC0008-BAIRRO-MUN-NOME-UF-EP   PIC  X(100).
           05 CC0008-BAIRRO-MUN-NOME-UF-EI   PIC  X(100).
           05 CC0008-CEP-E                   PIC  X(009).
           05 CC0008-MUN-NOME-UF-E           PIC  X(100).
           05 CC0008-UF-E                    PIC  X(002).
           05 CC0008-CPF-CGC                 PIC  X(019).
           05 CC0008-CPF-CGC-E               PIC  X(100).
           05 CC0008-INSCR-ESTADUAL          PIC  X(030).
           05 CC0008-INSCR-ESTADUAL-E        PIC  X(100).
           05 CC0008-COMPLEMENTO             PIC  X(100).
           05 CC0008-CPF-CGC-INSCR-EST-EI    PIC  X(100).

       01  B8CC-COR-CLASSE-MERCADORIA.
           05 CC0009-CMERC-CODIGO            PIC  X(006).

       01  B8CC-ITF-SNF-VOLUME-CARGA.
           05 CC0010-ESPECIE-VOLUMES         PIC  X(015).
           05 CC0010-MARCA-VOLUMES           PIC  X(015).
           05 CC0010-QTD-VOLUMES             PIC  X(008).

       01  H1CB-RRE-RESREL. 
           05 CB0001-RRE-CD-STM              PIC  X(008).
           05 CB0001-RRE-DTC-GRC             PIC  X(014).
           05 CB0001-RRE-ID-PRCP             PIC  X(040).
           05 CB0001-RRE-ID-PRCP-R REDEFINES CB0001-RRE-ID-PRCP.
              10 CB0001-RRE-ID-PRCP-PTD-LOTE PIC  X(032).
              10 CB0001-RRE-ID-PRCP-PTD-LIT  PIC  X(008).
           05 CB0001-RRE-CD-SQN-DCT          PIC  X(007).
           05 CB0001-RRE-CD-SQN-PJL          PIC  X(002).
           05 CB0001-RRE-ID-AUX-IMPS-1       PIC  X(020).
           05 CB0001-RRE-ID-AUX-IMPS-2       PIC  X(020).
           05 CB0001-RRE-ID-AUX-IMPS-3       PIC  X(020).
           05 CB0001-RRE-ID-AUX-IMPS-4       PIC  X(020).
           05 CB0001-RRE-ID-AUX-IMPS-5       PIC  X(020).
           05 CB0001-RRE-ID-REL              PIC  X(050).
           05 CB0001-RRE-ID-IMPR             PIC  X(030).

       01  H1CB-DRE-DETREL. 
           05 CB0002-DRE-CD-STM              PIC  X(008).
           05 CB0002-DRE-DTC-GRC             PIC  X(014).
           05 CB0002-DRE-ID-PRCP             PIC  X(040).
           05 CB0002-DRE-ID-PRCP-R REDEFINES CB0002-DRE-ID-PRCP.
              10 CB0002-DRE-ID-PRCP-PTD-LOTE PIC  X(032).
              10 CB0002-DRE-ID-PRCP-PTD-LIT  PIC  X(008).
           05 CB0002-DRE-CD-SQN-DCT          PIC  X(007).
           05 CB0002-DRE-CD-SQN-PJL          PIC  X(002).
           05 CB0002-DRE-CD-SQN-LNH          PIC  X(005).
           05 CB0002-DRE-CN-LNH-REL          PIC  X(500).
           05 CB0002-DRE-ID-VIA              PIC  X(002).

       01  H1CB-IMPRESSORA. 
           05 CB0003-NM-IMPR-AIX             PIC  X(010).

       01  H1CB-FABRICA.
           05 CB0004-CD-FBR                  PIC  X(002).
           05 CB0004-CD-T-PRD                PIC  X(001).
           05 CB0004-NM-CDAD                 PIC  X(030).
           05 CB0004-ID-CNPJ                 PIC  X(014).

       01  B8CC-C-VIEW-EPEC.
           05 CC0011-DH-EVENTO               PIC  X(019).
           05 CC0011-DH-PROTOCOLO            PIC  X(019).

       01  H1ST-TIPO-RECOLHIMENTO.
           05 ST0001-CD-FBR                  PIC  X(002).
           05 ST0001-CD-T-REC                PIC  X(002).
           05 ST0001-DESC-REC                PIC  X(025).
           05 ST0001-CD-T-ATND               PIC  X(020).
           05 ST0001-CD-REGR-DCT             PIC  X(001).
           05 ST0001-CD-REGR-FTRM            PIC  X(001).
           05 ST0001-CD-CLI-ESP              PIC  X(001).

       01  H1ST-INSTRUCAO-ESPECIAL. 
           05 ST0002-TXT-INS-ESP             PIC  X(065).

       01  H1ST-RECOLHIMENTO. 
           05 ST0003-CD-CLS-PDD              PIC  X(001).
           05 ST0003-CD-DSPS-PDD             PIC  X(001).
           05 ST0003-CD-STM-ATND             PIC  X(001).
           05 ST0003-CD-MOD-TRSP-IMP         PIC  X(001).
           05 ST0003-ID-REF-CLI              PIC  X(030).
           05 ST0003-ID-PRFL-ATND            PIC  X(005).
           05 ST0003-ID-CLI-RLCD             PIC  X(004).

       01  H1ST-VOLUME-RECOLHIMENTO. 
           05 ST0004-CD-T-ACND               PIC  X(002).
           05 ST0004-ID-VEIC-TRSP            PIC  X(008).
           05 ST0004-UF-VEIC-TRSP            PIC  X(002).
           05 ST0004-NM-RESP-VEIC            PIC  X(080).

       01  H1ST-ITEM-RECOLHIMENTO. 
           05 ST0005-CD-SIT-ATND             PIC  X(001).
           05 ST0005-ID-PDD                  PIC  X(010).
           05 ST0005-ID-PSO                  PIC  X(009).
           05 ST0005-ID-SQN-ATND-ITEM        PIC  X(009).
           05 ST0005-ID-SQN-OCR-FNT          PIC  X(003).
           05 ST0005-DTC-ATND-PECA           PIC  X(008).
           05 ST0005-ID-PECA-PDD             PIC  X(020).
           05 ST0005-CD-GR-PECA              PIC  X(002).
           05 ST0005-CD-FNT-SPR              PIC  X(002).
           05 ST0005-CD-FNT-SPR-ANTG         PIC  X(001).
           05 ST0005-CD-FNT-ATND             PIC  X(006).
           05 ST0005-CD-T-PREC-FTRM          PIC  X(001).          
           05 ST0005-CD-PREC-FRME-FTRM       PIC  X(001).          
           05 ST0005-ID-LCAC-ETQG-CLI        PIC  X(012).          
           05 ST0005-NM-FNT-ATND             PIC  X(003).          
           05 ST0005-CD-T-PGM                PIC  X(004).          
           05 ST0005-CD-NUM-PGM              PIC  X(009).          
           05 ST0005-CD-PGT-SPPP             PIC  X(005).          
           05 ST0005-ID-SQN-MTG              PIC  X(006).
           05 ST0005-CD-PFO                  PIC  X(002).
           05 ST0005-TXT-SUB-HDR             PIC  X(020).          
           05 ST0005-TXT-SUB-HDR-R REDEFINES ST0005-TXT-SUB-HDR.          
              10 ST0005-ID-ETIQ-RCBM         PIC  X(010).
              10 ST0005-FILLER               PIC  X(010).
           05 ST0005-TXT-SUB-HDR-NF-R REDEFINES ST0005-TXT-SUB-HDR.
              10 ST0005-TXT-SUB-HDR-NF-FILL  PIC  X(011).
              10 ST0005-TXT-SUB-HDR-NF       PIC  X(009).
           05 ST0005-TXT-SUB-HDR-R1 REDEFINES ST0005-TXT-SUB-HDR.
              10 ST0005-ID-VOL-CMIS2         PIC  X(008).
              10 ST0005-CD-T-CPL-CMIS2       PIC  X(003).
              10 ST0005-ID-NF-ORIG-CMIS2     PIC  X(009).
           05 ST0005-ID-CCR                  PIC  X(016).
           05 ST0005-ID-CCR-VRS              PIC  X(002).
           05 ST0005-ID-CCR-NUM-LNH          PIC  X(004).
           05 ST0005-ID-SQN-ITEM-PDD         PIC  X(011).
           05 ST0005-PREC-UNT-INFD           PIC  X(013).
           05 ST0005-ID-LOTE-FTRM-CBL        PIC  X(011).
           05 ST0005-ID-CLI-RLCD             PIC  X(004).
           05 ST0005-IC-NACZ-ICPN-BT         PIC  X(001).

       01  H1ST-CONTROLE-VOLUME.
           05 ST0006-ID-FRN                  PIC  X(007).

       01  H1ST-TIPO-ACONDICIONAMENTO. 
           05 ST0007-NM-ACND-ING             PIC  X(020).
           05 ST0007-NM-ACND-ESPN            PIC  X(020).
           05 ST0007-ALT-VOL                 PIC  X(006).
           05 ST0007-CMP-VOL                 PIC  X(006).
           05 ST0007-LRG-VOL                 PIC  X(006).

       01  H1ST-CONTROLE-VOLUME.
           05 ST0008-ID-MTZ                  PIC  X(004).

       01  H1SR-PARAMETROS-CDP. 
           05 SR0002-ID-PARM                 PIC  X(005).
           05 SR0002-CN-PARM                 PIC  X(050).
           05 SR0002-CN-PARM-R REDEFINES SR0002-CN-PARM.
              10 SR0002-CN-PARM-IMPR         PIC  X(030).
              10 SR0002-CN-PARM-FILL         PIC  X(020).

       01  H1SR-ITEM-RECEBIMENTO. 
           05 SR0003-CD-T-RCBM               PIC  X(002).
           05 SR0003-ID-FRN                  PIC  X(007).
           05 SR0003-ID-FRN-R REDEFINES SR0003-ID-FRN.
              10 SR0003-ID-FRN-FILL1         PIC  X(001).
              10 SR0003-ID-FRN-CT            PIC  X(004).
              10 SR0003-ID-FRN-FILL2         PIC  X(002).
           05 SR0003-ID-NF-CTB               PIC  X(009).
           05 SR0003-DTC-NF-CTB              PIC  X(008).
           05 SR0003-SRIE-NF-CTB             PIC  X(003).
           05 SR0003-CD-FBR                  PIC  X(002).

       01  H1SR-PECA.
           05 SR0004-PREC-US-DN-PPM-UNIT     PIC  X(009).
           05 SR0004-NM-PECA-ING             PIC  X(020).
           05 SR0004-CLSF-FSCL               PIC  X(011).
           05 SR0004-IC-RMAN-BK              PIC  X(002).
           
       01  H1SR-PRECO-FATURA-API.
           05 SR0005-ID-IDM                  PIC  X(001).

       01  H1SE-IDE-INTERFACE-DE.
           05 SE0001-IDE-NM-EMP              PIC  X(003).
           05 SE0001-IDE-ID-T-ITF            PIC  X(030).
           05 SE0001-IDE-ID-STM-ORGM         PIC  X(005).
           05 SE0001-IDE-DTC-GRC             PIC  X(019).
           05 SE0001-IDE-DTC-ITF             PIC  X(019).
           05 SE0001-IDE-NUM-CNT             PIC  X(009).
           05 SE0001-IDE-NUM-T-REG           PIC  X(009).
           05 SE0001-IDE-NUM-SQN             PIC  X(009).
           05 SE0001-IDE-IC-PRC              PIC  X(001).
           05 SE0001-IDE-TXT-MSG             PIC  X(2000).

       01  H1SF-SN-CONTAS-CT. 
           05 CT0001-CD-NOP                  PIC  X(006).
           05 CT0001-CD-AUX-ICM              PIC  X(001).
           05 CT0001-CD-AUX-IPI              PIC  X(001).
           05 CT0001-CT-RR-CR                PIC  X(010).
           05 CT0001-CT-RR-CR-R REDEFINES CT0001-CT-RR-CR.
              10 CT0001-CR-CD-CT             PIC  X(005).
              10 CT0001-CR-CD-SUB1           PIC  X(003).
              10 CT0001-CR-CD-SUB2           PIC  X(002).
           05 CT0001-CT-RR-DEB               PIC  X(010).
           05 CT0001-CT-RR-DEB-R REDEFINES CT0001-CT-RR-DEB.
              10 CT0001-DEB-CD-CT            PIC  X(005).
              10 CT0001-DEB-CD-SUB1          PIC  X(003).
              10 CT0001-DEB-CD-SUB2          PIC  X(002).

       01  WM01-ARE-MASK. 
           05 WM01-PRECO-TOTAL-M             PIC  X(018).
           05 WM01-VL-AJUSTE-PRECO-TOTAL-M   PIC  X(018).
           05 WM01-VL-FRETE                  PIC  X(018).
           05 WM01-VL-OUTRAS-DESPESAS        PIC  X(018).
           05 WM01-VL-OUTRAS-FRETE           PIC  X(018).
           05 WM01-VL-MANAUS-A               PIC  X(018).
           05 WM01-VL-MANAUS-B               PIC  X(018).
           05 WM01-VL-MANAUS-C               PIC  X(018).
           05 WM01-VL-MANAUS-D               PIC  X(018).
           05 WM01-VL-SEGURO                 PIC  X(018).
           05 WM01-VL-TOTAL-BASE-ICMS        PIC  X(018).
           05 WM01-VL-TOTAL-BASE-STF         PIC  X(018).
           05 WM01-VL-TOTAL-CONTABIL         PIC  X(018).
           05 WM01-VL-TOTAL-ICMS             PIC  X(018).
           05 WM01-VL-TOTAL-IPI              PIC  X(018).
           05 WM01-VL-TOTAL-STF              PIC  X(018).
           05 WM01-PESO-BRUTO-KG             PIC  X(018).
           05 WM01-PESO-BRUTO-KG-AUX         PIC  X(018).
           05 WM01-PESO-LIQUIDO-KG           PIC  X(018).
           05 WM01-PESO-LIQUIDO-KG-AUX       PIC  X(018).
           05 WM01-PESO-EMB-KG               PIC  X(018).
           05 WM01-ALIQ-ICMS                 PIC  X(007).
           05 WM01-ALIQ-IPI                  PIC  X(007).
           05 WM01-PRECO-TOTAL               PIC  X(018).
           05 WM01-VL-IPI                    PIC  X(018).
           05 WM01-VL-IPI-LOG                PIC S9(009)V99   COMP-3.
           05 WM01-TOTAL-MERCADORIA          PIC  X(018).
           05 WM01-PRECO-TOTAL-M-TOT         PIC  X(020).
           05 WM01-PESO-BRUTO-KG-TOT         PIC  X(020).
           05 WM01-PESO-LIQUIDO-KG-TOT       PIC  X(020).
           05 WM01-PESO-EMB-KG-TOT           PIC  X(020).
           05 WM01-QTD-AUX                   PIC  X(005).
           05 WM01-MSG-REF-PESO-VOL          PIC  X(048).
           05 WM01-MSG-REF-PESO-VOL-M1 REDEFINES  WM01-MSG-REF-PESO-VOL.
              10 WM01-MSG-REF-TXT-1          PIC  X(029).
              10 WM01-MSG-REF-NF-DE          PIC  X(007).
              10 WM01-MSG-REF-TXT-2          PIC  X(005).
              10 WM01-MSG-REF-NF-AT          PIC  X(007).
           05 WM01-PREDIO.
              10 WM01-PREDIO-P1              PIC  X(011).
              10 WM01-CD-PDIO                PIC  X(002).
              10 WM01-PREDIO-P2              PIC  X(004).
           05 WM01-VL-BASE-ICMS              PIC  X(018).
           05 WM01-VL-ICMS                   PIC  X(018).
           05 WM01-VL-BASE-ICMS-STF          PIC  X(018).
           05 WM01-VL-ICMS-STF               PIC  X(018).

       01  WQ01-ARE-AUX. 
           05 WQ03-ID-VOL                    PIC  X(008).
           05 WQ04-ITD-ID-VOL                PIC  X(008).
           05 WQ01-ID-MTZ-AUX                PIC  X(004).
           05 WQ01-ID-CLI-AUX                PIC  X(004).
           05 WQ01-ID-VOL-INST               PIC  X(008).
           05 WQ01-ID-VOL-AUX                PIC  X(008).
           05 WQ01-ID-VOL-DET-PTD            PIC  X(008).
           05 WQ01-ID-VOL-CMIS2-DET-PTD      PIC  X(008).
           05 WQ01-ID-VOL-CMIS2-PCKL         PIC  X(008).
           05 WQ01-TOT-ITEM-DET-PTD          PIC  X(005).
           05 WQ01-TOT-VOL-DET-PTD           PIC  X(005).
           05 WQ01-TOT-VOL-DET-PTD-LOG       PIC  X(005).
           05 WQ01-TOT-PECA-DET-PTD          PIC  X(005).
           05 WQ01-TOT-PESO-DET-PTD          PIC  X(011).
           05 WQ01-NM-ACND-PRTG-PTD          PIC  X(020).
           05 WQ01-ID-CNTG-CONF              PIC  X(001).
           05 WQ01-CLSF-FSC                  PIC  X(012).
           05 WQ01-MENOR-DANFE               PIC  X(009).
           05 WQ01-MAIOR-DANFE               PIC  X(009).
           05 WQ01-TTL-NF-SEQ                PIC  X(004).
           05 WQ01-TTL-NF-FAT                PIC  X(004).
           05 WQ01-ID-PDD                    PIC  X(010).
           05 WQ01-ID-PDD-INST               PIC  X(010).
           05 WQ01-PERC-ICMS                 PIC  X(005).
           05 WQ01-PRECO-TOTAL-M-TOT         PIC S9(015)V99   COMP-3.
           05 WQ01-PESO-BRUTO-KG-TOT         PIC S9(013)V9999 COMP-3
                                                            VALUE ZEROS.
           05 WQ01-PESO-LIQUIDO-KG-TOT       PIC S9(013)V9999 COMP-3
                                                            VALUE ZEROS.
           05 WQ01-PTD-PESO-TTL-LQD          PIC  X(013).
           05 WQ01-PTD-PESO-TTL-BRT          PIC  X(013).
           05 WQ01-PESO-LQD-TTL              PIC  X(013).
           05 WQ01-PESO-LQD-TTL-AUX          PIC  9(009)V99999 COMP-3.
           05 WQ01-PESO-BRT-TTL              PIC  X(013).
           05 WQ01-CUB-TTL-FTR               PIC  X(013).
           05 WQ01-PESO-BRT-VOL              PIC  X(013).
           05 WQ01-PTD-V-TTL-MRCD            PIC  X(013).
           05 WQ01-HORA-AUX                  PIC  X(015).
           05 WQ01-N                         PIC  X(001).
           05 WQ01-2                         PIC  X(002).
           05 WQ01-5                         PIC  X(005).
           05 WQ01-BULK                      PIC  X(005).
           05 WQ01-PKG                       PIC  X(005).
           05 WQ01-MINIMA                    PIC  X(005).
           05 WQ01-QTD-AUX                   PIC  X(005).
           05 WQ01-BULK-PKG                  PIC  X(005).
           05 WQ01-NM-PECA-PRTG              PIC  X(012).
           05 WQ01-NM-PECA-ING               PIC  X(012).
           05 WQ01-TESTE-AUX                 PIC  X(200).
           05 WQ01-CD-T-PGM                  PIC  X(004).
           05 WQ01-CT-ICM-CR                 PIC  X(010).
           05 WQ01-CT-ICM-DEB                PIC  X(010).
           05 WQ01-CT-IPI-CR                 PIC  X(010).
           05 WQ01-CT-IPI-DEB                PIC  X(010).
           05 WQ01-NUM-PLACA-VEICULO         PIC  X(008).
           05 WQ01-PREC-EXP-UNIT             PIC  X(009).
           05 WQ01-SYSDATE                   PIC  X(010).
           05 WQ01-SYSDATE-8                 PIC  X(008).
           05 WQ01-SYSDATE-8-I               PIC  X(008).
           05 WQ01-SYSDATE-DEA               PIC  X(019).
           05 WQ01-SYSDATE-S                 PIC  X(019).
           05 WQ01-SYSDATE-AUX               PIC  X(014).
           05 WQ01-DT-INL-FTRM               PIC  X(010).
           05 WQ01-MAX-ITEM                  PIC  X(006).
           05 WQ01-MAX-ITEM-R  REDEFINES  WQ01-MAX-ITEM.
              10 WQ01-MAX-ITEM-FILL          PIC  X(002).
              10 WQ01-MAX-ITEM-4             PIC  X(004).
           05 WQ01-CD-ANLS-PECA              PIC  X(007).
           05 WQ01-CD-ANLS-PECA-R  REDEFINES  WQ01-CD-ANLS-PECA.
              10 WQ01-CD-ANLS-PECA-1         PIC  X(003).
              10 WQ01-CD-ANLS-PECA-2         PIC  X(001).
              10 WQ01-CD-ANLS-PECA-3         PIC  X(003).
           05 WQ01-NM-RSP-VEIC               PIC  X(080).
           05 WQ01-DESCONTO-ITEM-LOG         PIC S9(009)V99   COMP-3.
           05 WQ01-TOTAL-SELECAO             PIC  X(015).
           05 WQ01-TOTAL-SELECAO-R  REDEFINES  WQ01-TOTAL-SELECAO
                                             PIC  9(013)V99.
           05 WQ01-PREC-UNIT-FAT             PIC  X(015).
           05 WQ01-PREC-UNIT-FAT-R  REDEFINES  WQ01-PREC-UNIT-FAT
                                             PIC  9(010)V9(5).
           05 WQ01-PREC-TOT-FAT              PIC  X(015).
           05 WQ01-PREC-TOT-FAT-R  REDEFINES  WQ01-PREC-TOT-FAT
                                             PIC  9(013)V99.
           05 WQ01-Q-PCK-LIST                PIC  X(010).
           05 WQ01-Q-TOTAL-PCK-LIST          PIC  X(010).
           05 WQ01-MTS-CUB-VOL               PIC  X(008).
           05 WQ01-PRECO-API-PCK-LIST        PIC  X(013).
           05 WQ01-PRECO-API-PCK-LIST-TOT    PIC  X(015).
           05 WQ01-PRECO-TOTAL-API-PCK-LIST  PIC  X(015).
           05 WQ01-PESO-PCK-LIST-TOT         PIC  X(014).
           05 WQ01-PESO-TOTAL-PCK-LIST       PIC  X(014).
           05 WQ01-PESO-PCK-LIST-TAR         PIC  X(014).
           05 WQ01-PESO-PCK-LIST-NET         PIC  X(014).           
           05 WQ01-NM-ACND-TOT-ING           PIC  X(030).
           05 WQ01-NM-ACND-TOT-ESPN          PIC  X(030).
           05 WQ01-RATE-US-ITEM              PIC  X(005).
           05 WQ01-TTL-V-FRT                 PIC  X(013).
           05 WQ01-TTL-V-TX-SERV             PIC  X(013).
           05 WQ01-TTL-V-SUR-CHRG            PIC  X(013).
           05 WQ01-TTL-V-ADC-IPI             PIC  X(013).
           05 WQ01-TTL-V-CAS-RMAN-ODA        PIC  X(013).
           05 WQ01-TTL-V-CAS-RMAN-CMIS2      PIC  X(013).
           05 WQ01-TTL-FEES-CES              PIC  X(015).
           05 WQ01-PESO-BRT-EMIF-UNIT        PIC S9(005)V999   COMP-3.
           05 WQ01-EMITENTE-PFJ-CODIGO       PIC  X(020).
           05 WQ01-EMITENTE-LOC-CODIGO       PIC  X(006).
           05 WQO1-ORDEM                     PIC  X(001).
           05 WQ01-IND-END-AUX               PIC  9(002)       COMP-3.
           05 WQ01-IND-INSTR-AUX             PIC  9(002)       COMP-3.
           05 WQ01-IND-LEN-MAX-AUX           PIC  9(002)       COMP-3.
           05 WQ01-TXT-CMPL-AUX              PIC  X(1000).
           05 WQ01-TXT-CMPL-EXP-AUX          PIC  X(1000).
           05 WQ01-ITD-PREC-US-API-UNT-REB   PIC  X(013).
           05 WQ01-ITD-PREC-US-API-TTL-REB   PIC  X(013).
           05 WQ01-TEXTO-COMPLEMENTAR-EXP    PIC  X(1000).
           05 WQ01-TOT-LNH-DESC-CPLT-D       PIC  X(005).
           05 WQ01-TOT-LNH-DESC-CPLT-E       PIC  X(005).
           05 WQ01-NOP-CODIGO-AUX            PIC  X(020).

           05 WQ01-LOTE.
              10 WQ01-CD-MERC-DST            PIC  X(001).
              10 WQ01-DTC-SEL-FTRM           PIC  X(014).
              10 WQ01-LGON-FUNC              PIC  X(008).

           05 WQ01-DOF-IMPOR-NUMERO          PIC  X(040).
           05 WQ01-DOF-IMPOR-NUMERO-R  REDEFINES  WQ01-DOF-IMPOR-NUMERO.
              10 WQ01-DOF-CD-SISTEMA         PIC  X(004).
              10 WQ01-DOF-CD-MERC-DST        PIC  X(001).
              10 WQ01-DOF-DTC-SEL-FTRM       PIC  X(014).
              10 WQ01-DOF-LGON-FUNC          PIC  X(008).
              10 WQ01-DOF-FASE-FTRM          PIC  X(001).
              10 WQ01-DOF-CD-SEQ             PIC  X(004).
              10 WQ01-DOF-FILL               PIC  X(008).

           05 WQ01-DOF-IMPOR-PROTOCOLO       PIC  X(040).

           05 WQ01-ID-NF-ASSOC               PIC  X(009).
           05 WQ01-DTC-NF-COMPL              PIC  X(010).
           05 WQ01-TTL-LNH-DESC-ITM          PIC  X(005).
           05 WQ01-INF-CNHT-DFE              PIC  X(090).
           05 WQ01-CONTROLE-ENQ              PIC  X(014).
           05 WQ01-MSG-CMPL-AUX              PIC  X(1360).
           05 WQ01-MSG-NFE-CTGC              PIC  X(069).
           05 WQ01-MSG-NFE-EPEC              PIC  X(195).
           05 WQ01-DESC-REC-AUX              PIC  X(025).
           05 WQ01-IC-SIM                    PIC  X(001) VALUE 'S'.

           05 WQ01-ITD-PREC-US-DN-CORE-TTL   PIC  X(015).
           05 WQ01-ITD-PREC-US-IC-CORE-TTL   PIC  X(015).

       01  WQ02-ARE-PARM. 
           05 WQ02-CD-MERC-DST               PIC  X(001).
           05 WQ02-DTC-SEL-FTRM              PIC  X(014).
           05 WQ02-LGON-FUNC                 PIC  X(008).
           05 WQ02-FASE-FTRM                 PIC  X(001).

       01  WI01-ARE-NULL.
           05 WI01-ITD-SRIE-PECA             PIC S9(004) COMP.
           05 WI01-CFOP-CODIGO               PIC S9(004) COMP.
           05 WI01-DESTINATARIO-PFJ-CODIGO   PIC S9(004) COMP.
           05 WI01-DH-EMISSAO                PIC S9(004) COMP.
           05 WI01-IND-RESP-FRETE            PIC S9(004) COMP.
           05 WI01-NOP-CODIGO                PIC S9(004) COMP.
           05 WI01-NUMERO                    PIC S9(004) COMP.
           05 WI01-PESO-BRUTO-KG             PIC S9(004) COMP.
           05 WI01-PESO-LIQUIDO-KG           PIC S9(004) COMP.
           05 WI01-TRANSPORTADOR-PFJ-COD     PIC S9(004) COMP.
           05 WI01-ENTSAI-UNI-CODIGO         PIC S9(004) COMP.
           05 WI01-IDF-TEXTO-COMPLEMENTAR    PIC S9(004) COMP.
           05 WI01-TXT-CMPL-AUX              PIC S9(004) COMP.
           05 WI01-TXT-CMPL-EXP-AUX          PIC S9(004) COMP.
           05 WI01-MERC-CODIGO               PIC S9(004) COMP.
           05 WI01-NBM-CODIGO                PIC S9(004) COMP.
           05 WI01-OM-CODIGO                 PIC S9(004) COMP.
           05 WI01-STC-CODIGO                PIC S9(004) COMP.
           05 WI01-CPF-CGC                   PIC S9(004) COMP.
           05 WI01-BAIRRO                    PIC S9(004) COMP.
           05 WI01-CEP                       PIC S9(004) COMP.
           05 WI01-MUN-NOME                  PIC S9(004) COMP.
           05 WI01-TELEFONE1                 PIC S9(004) COMP.
           05 WI01-UF-CODIGO                 PIC S9(004) COMP.
           05 WI01-PAIS                      PIC S9(004) COMP.
           05 WI01-INSCR-ESTADUAL            PIC S9(004) COMP.
           05 WI01-NOME                      PIC S9(004) COMP.
           05 WI01-DESCRICAO                 PIC S9(004) COMP.
           05 WI01-TPT-CD-TRSR               PIC S9(004) COMP.
           05 WI01-TPT-CD-TRSR-DSP           PIC S9(004) COMP.
           05 WI01-SFT-ID-AGRP               PIC S9(004) COMP.
           05 WI01-RRE-ID-AUX-IMPS-5         PIC S9(004) COMP.
           05 WI01-ID-CNTG-CONF              PIC S9(004) COMP.
           05 WI01-NM-PECA-PRTG              PIC S9(004) COMP.
           05 WI01-NM-PECA-ING               PIC S9(004) COMP.
           05 WI01-CN-PARM                   PIC S9(004) COMP.
           05 WI01-CD-T-PGM                  PIC S9(004) COMP.
           05 WI01-CD-MOD-TRSP-IMP           PIC S9(004) COMP.
           05 WI01-ID-LCAC-ETQG-CLI          PIC S9(004) COMP.     
           05 WI01-SPP-ID-CT-CTBL            PIC S9(004) COMP.     
           05 WI01-DESCONTO                  PIC S9(004) COMP.
           05 WI01-CD-PGT-SPPP               PIC S9(004) COMP.          
           05 WI01-SFT-IC-DTC-NF             PIC S9(004) COMP.          
           05 WI01-CD-NUM-PGM                PIC S9(004) COMP.          
           05 WI01-ID-SQN-MTG                PIC S9(004) COMP.          
           05 WI01-CD-FBR                    PIC S9(004) COMP.
           05 WI01-CD-T-ATND                 PIC S9(004) COMP.
           05 WI01-CD-REGR-DCT               PIC S9(004) COMP.
           05 WI01-CD-REGR-FTRM              PIC S9(004) COMP.
           05 WI01-CT-ICM-CR                 PIC S9(004) COMP.
           05 WI01-CT-ICM-DEB                PIC S9(004) COMP.
           05 WI01-CT-IPI-CR                 PIC S9(004) COMP.
           05 WI01-CT-IPI-DEB                PIC S9(004) COMP.
           05 WI01-PLACA-VEICULO-UF-CODIGO   PIC S9(004) COMP.
           05 WI01-NUM-PLACA-VEICULO         PIC S9(004) COMP.
           05 WI01-TXT-SUB-HDR               PIC S9(004) COMP.         
           05 WI01-DTC-NF                    PIC S9(004) COMP.
           05 WI01-SRIE-NF                   PIC S9(004) COMP.
           05 WI01-CD-AUX-ICM                PIC S9(004) COMP.
           05 WI01-CD-AUX-IPI                PIC S9(004) COMP.
           05 WI01-CT-RR-CR                  PIC S9(004) COMP.
           05 WI01-CT-RR-DEB                 PIC S9(004) COMP.
           05 WI01-ID-FRN                    PIC S9(004) COMP.
           05 WI01-FRETE-DEA                 PIC S9(004) COMP.
           05 WI01-NM-RSP-VEIC               PIC S9(004) COMP.
           05 WI01-SFT-ID-IMPR-FTRM          PIC S9(004) COMP.
           05 WI01-SFT-IC-NACZ-ICPN-BT       PIC S9(004) COMP.
           05 WI01-SFT-CD-MERC-DST-ORIG      PIC S9(004) COMP.
           05 WI01-SFT-DTC-SEL-FTRM-ORIG     PIC S9(004) COMP.
           05 WI01-SFT-LGON-FUNC-ORIG        PIC S9(004) COMP.
           05 WI01-ITD-ID-ITM-DE             PIC S9(004) COMP.
           05 WI01-ITD-FTR-EXP               PIC S9(004) COMP.
           05 WI01-ITD-ID-NF-REF             PIC S9(004) COMP.
           05 WI01-CD-PFO                    PIC S9(004) COMP.
           05 WI01-ID-IDM                    PIC S9(004) COMP.
           05 WI01-ID-NF                     PIC S9(004) COMP.           
           05 WI01-ID-NF-ASSOC               PIC S9(004) COMP.
           05 WI01-DTC-NF-COMPL              PIC S9(004) COMP.
           05 WI01-CD-PDIO                   PIC S9(004) COMP.
           05 WI01-CD-FNT-SPR-ANTG           PIC S9(004) COMP.
           05 WI01-ID-VEIC-TRSP              PIC S9(004) COMP.
           05 WI01-UF-VEIC-TRSP              PIC S9(004) COMP.
           05 WI01-NM-RESP-VEIC              PIC S9(004) COMP.
           05 WI01-NFE-CONTINGENCIA          PIC S9(004) COMP.
           05 WI01-NFE-LOCALIZADOR           PIC S9(004) COMP.
           05 WI01-DT-SAIDA-MERCADORIAS      PIC S9(004) COMP.
           05 WI01-VL-BASE-ICMS              PIC S9(004) COMP.
           05 WI01-VL-ICMS                   PIC S9(004) COMP.
           05 WI01-VL-BASE-ICMS-STF          PIC S9(004) COMP.
           05 WI01-VL-TRIBUTAVEL-STF         PIC S9(004) COMP.
           05 WI01-VL-ICMS-STF               PIC S9(004) COMP.
           05 WI01-CLS-IC-SBSC-TRBT          PIC S9(004) COMP.
           05 WI01-CLS-IC-PRD-PGSO           PIC S9(004) COMP.
           05 WI01-CLS-IC-CLS-ATV            PIC S9(004) COMP.
           05 WI01-RGI-RATE-RDC-BS           PIC S9(004) COMP.
           05 WI01-RGI-RATE-RDC-PERC         PIC S9(004) COMP.
           05 WI01-CLS-IC-RDC-BS             PIC S9(004) COMP.
           05 WI01-CLS-IC-RDC-PERC           PIC S9(004) COMP.
           05 WI01-NFE-PROTOCOLO             PIC S9(004) COMP.
           05 WI01-CTRL-DT-ULT-ALTERACAO     PIC S9(004) COMP.
           05 WI01-UF-CODIGO-EMITENTE        PIC S9(004) COMP.
           05 WI01-SHT-END-CLI               PIC S9(004) COMP.
           05 WI01-SHT-CID-CLI               PIC S9(004) COMP.
           05 WI01-SHT-UF-CLI                PIC S9(004) COMP.
           05 WI01-SHT-CD-CEP                PIC S9(004) COMP.
           05 WI01-SHT-PAIS-CLI              PIC S9(004) COMP.
           05 WI01-SHT-CD-FBR                PIC S9(004) COMP.
           05 WI01-SHT-CD-VAT                PIC S9(004) COMP.
           05 WI01-SHT-ID-VAT                PIC S9(004) COMP.
           05 WI01-CON-END-CSG               PIC S9(004) COMP.
           05 WI01-CON-CID-CSG               PIC S9(004) COMP.
           05 WI01-CON-UF-CSG                PIC S9(004) COMP.
           05 WI01-CON-CD-CEP                PIC S9(004) COMP.
           05 WI01-CON-PAIS-CSG              PIC S9(004) COMP.
           05 WI01-CON-CD-FBR                PIC S9(004) COMP.
           05 WI01-CON-CD-VAT                PIC S9(004) COMP.
           05 WI01-CON-ID-VAT                PIC S9(004) COMP.
           05 WI01-IMP-UF-IMPT               PIC S9(004) COMP.
           05 WI01-IMP-CD-CEP                PIC S9(004) COMP.
           05 WI01-IMP-T-MERC-DST            PIC S9(004) COMP.
           05 WI01-IMP-CD-FBR                PIC S9(004) COMP.
           05 WI01-IMP-CD-VAT                PIC S9(004) COMP.
           05 WI01-IMP-ID-VAT                PIC S9(004) COMP.
           05 WI01-FTE-ID-DE                 PIC S9(004) COMP.
           05 WI01-FTE-CD-TRM-PGT            PIC S9(004) COMP.
           05 WI01-FTE-DTC-SD-FBR            PIC S9(004) COMP.
           05 WI01-IC-RMAN-BK                PIC S9(004) COMP.
           05 WI01-ID-CCR                    PIC S9(004) COMP.
           05 WI01-ID-CCR-VRS                PIC S9(004) COMP.
           05 WI01-ID-CCR-NUM-LNH            PIC S9(004) COMP.
           05 WI01-ITD-ID-CASC-CBL           PIC S9(004) COMP.
           05 WI01-CPF-CGC-INSCR-EST-EI      PIC S9(004) COMP.
           05 WI01-COMPLEMENTO               PIC S9(004) COMP.
           05 WI01-COMPLEMENTO-EPD           PIC S9(004) COMP.
           05 WI01-NFE-COD-SITUACAO          PIC S9(004) COMP.
           05 WI01-ID-VOL-CMIS2-DET-PTD      PIC S9(004) COMP.
           05 WI01-ID-VOL-CMIS2-PCKL         PIC S9(004) COMP.
           05 WI01-ID-LOTE-FTRM-CBL          PIC S9(004) COMP.
           05 WI01-CD-CLI-ESP                PIC S9(004) COMP.
           05 WI01-ID-FTR-API-LOG            PIC S9(004) COMP.
           05 WI01-FTE-CD-T-DE               PIC S9(004) COMP.
           05 WI01-TEXTO-COMPLEMENTAR-EXP    PIC S9(004) COMP.
           05 WI01-SFT-IC-FTRM-TRGD          PIC S9(004) COMP.
           05 WI01-NOP-CODIGO-AUX            PIC S9(004) COMP.
           05 WI01-DH-EVENTO                 PIC S9(004) COMP.
           05 WI01-DH-PROTOCOLO              PIC S9(004) COMP.
           05 WI01-ID-CLI-RLCD               PIC S9(004) COMP.
           05 WI01-IC-NACZ-ICPN-BT           PIC S9(004) COMP.
           05 WI01-RAZAO-SOCIAL              PIC S9(004) COMP.
           05 WI01-ENDERECO                  PIC S9(004) COMP.
           05 WI01-PTD-CD-TRSR               PIC S9(004) COMP.

           EXEC SQL END           DECLARE SECTION
                END-EXEC.
   
      *----------------------------------------------------------------*
      *          === AREAS AUXILIARES DO PROGRAMA ===        ACA 10/00 *
      *----------------------------------------------------------------*
      
       01  WS01-ARE-AUX.
           05 WS01-REFERENCIA-EMIF.
              10 WS01-REF-SISTEMA            PIC  X(004)   VALUE 'BPIS'.
              10 WS01-REF-CD-MERC-DST        PIC  X(001)   VALUE SPACES.
              10 WS01-REF-DATA-HORA          PIC  X(014)   VALUE SPACES.
              10 WS01-REF-LGON-FUNC          PIC  X(008)   VALUE SPACES.
              10 WS01-REF-CD-SEQ-NF          PIC  X(004)   VALUE SPACES.

           05 WS01-REFERENCIA-EMIF-IT.
              10 WS01-REF-SISTEMA-IT         PIC  X(004)   VALUE 'BPIS'.
              10 WS01-REF-CD-MERC-DST-IT     PIC  X(001)   VALUE SPACES.
              10 WS01-REF-DATA-HORA-IT       PIC  X(014)   VALUE SPACES.
              10 WS01-REF-LGON-FUNC-IT       PIC  X(008)   VALUE SPACES.
              10 WS01-REF-CD-SEQ-NF-IT       PIC  X(004)   VALUE SPACES.
              10 WS01-REF-IDF-NUM-IT         PIC  X(006)   VALUE SPACES.

           05 WS01-NOP-AUX                   PIC  X(005).
           05 WS01-NOP-AUX-R REDEFINES WS01-NOP-AUX.
              10 WS01-NOP-AUX-COD-1          PIC  X(003).
              10 WS01-NOP-AUX-COD-2          PIC  X(002).
              
           05 WS01-DTC-AUX                   PIC  X(014).
           05 WS01-DTC-AUX-R REDEFINES WS01-DTC-AUX.
              10 WS01-DTC-ANO-AUX.
                 15 WS01-DTC-ANO-AUX-01      PIC  X(002).
                 15 WS01-DTC-ANO-AUX-02      PIC  X(002).
              10 WS01-DTC-MES-AUX            PIC  X(002).
              10 WS01-DTC-DIA-AUX            PIC  X(002).
              10 WS01-DTC-HR-AUX             PIC  X(006).
              
           05 WS01-MES-DIA-AUX               PIC  X(004).
           05 WS01-MES-DIA-AUX-R REDEFINES WS01-MES-DIA-AUX.
              10 WS01-MES-AUX                PIC  X(002).
              10 WS01-DIA-AUX                PIC  X(002).

           05 WS01-PRECO-UNIT-09-AUX         PIC  X(009).
           05 WS01-PRECO-UNIT-09-AUX-R REDEFINES WS01-PRECO-UNIT-09-AUX
                                             PIC  9(009).

           05 WS01-ID-SQN-MQ                 PIC  9(007)    VALUE ZEROS.
           05 WS01-RATE-US-ITEM              PIC  X(005).
           05 WS01-RATE-US-ITEM-R REDEFINES WS01-RATE-US-ITEM
                                             PIC  9(005).

           05 WS01-RATE-US                   PIC  9(005).

           05 WS01-ID-PTC-DSP-8.
              10 FILLER                      PIC  X(001)    VALUE ZEROS.
              10 WS01-ID-PTC-DSP-7           PIC  X(007).


      *----------------------------------------------------------------*
      *-- ATENCAO : O layout do texto complementar tambem e usado no
      *--           H1SF0031.
      *----------------------------------------------------------------*
           05 WS01-TEXTO-COMPLEMENTAR-EMIF.
              10 WS01-TEXTO-COMPLEMENTAR.
                 15 WS01-TXT-PESO-BRT         PIC  X(010).
                 15 FILLER                    PIC  X(001)  VALUE SPACES.
                 15 WS01-TXT-ID-PDD           PIC  X(010).
                 15 FILLER                    PIC  X(001)  VALUE SPACES.
                 15 WS01-TXT-ID-VOL           PIC  X(008).
                 15 FILLER                    PIC  X(001)  VALUE SPACES.
                 15 WS01-TXT-AREA-MULT        PIC  X(032)  VALUE SPACES.
                 15 WS01-TXT-AREA-MULT-VENDA
                                           REDEFINES WS01-TXT-AREA-MULT.
                    20 WS01-TXT-TX-SERV.
					   25 WS01-TXT-TX-SERV-6  PIC  X(006).
                       25 WS01-PERC-TX-SERV   PIC  X(001).
                    20 FILLER                 PIC  X(001).
                    20 WS01-TXT-IC-FRT-IPI    PIC  X(002).
                    20 FILLER                 PIC  X(001).
                    20 WS01-TXT-PERC-DSCT     PIC  X(007).
                    20 FILLER                 PIC  X(001).
                    20 WS01-TXT-CD-T-PGM      PIC  X(004).
                    20 FILLER                 PIC  X(001).
                    20 WS01-TXT-CD-NUM-PGM    PIC  X(008).
                 15 WS01-TXT-AREA-MULT-DEVOL
                                           REDEFINES WS01-TXT-AREA-MULT.
                    20 WS01-TXT-NF            PIC  X(003).
                    20 WS01-TXT-ID-NF         PIC  X(009).
                    20 FILLER                 PIC  X(002).
                    20 WS01-TXT-DTC-NF        PIC  X(010).
                    20 FILLER                 PIC  X(008).
                 15 WS01-TXT-AREA-MULT-DAEXP
                                           REDEFINES WS01-TXT-AREA-MULT.
                    20 WS01-TXT-ID-DA-LBL     PIC  X(003).
                    20 WS01-TXT-ID-DA         PIC  X(010).
                    20 FILLER                 PIC  X(019).
      *          15 WS01-TXT-AREA-MULT-WTOOL
      *                                    REDEFINES WS01-TXT-AREA-MULT.
      *             20 WS01-TXT-W-TOOL        PIC  X(012).
      *             20 WS01-ITD-SRIE-PECA     PIC  X(012).
      *             20 FILLER                 PIC  X(008).
                 15 WS01-TXT-AREA-MULT-CHAPA
                                           REDEFINES WS01-TXT-AREA-MULT.
                    20 WS01-TXT-ID-PDD-CPR-Q  PIC  X(001).
                    20 WS01-TXT-ID-PDD-CPR    PIC  X(010).
                    20 FILLER                 PIC  X(021).
                 15 WS01-TXT-AREA-MULT-CASCO
                                           REDEFINES WS01-TXT-AREA-MULT.
                    20 WS01-ID-VOL-CMIS2-CASC PIC  X(008).
                    20 FILLER                 PIC  X(001).
                    20 WS01-ID-CASC-CBL       PIC  X(020).
                    20 FILLER                 PIC  X(003).
                 15 WS01-TXT-AREA-MULT-REMAN
                                           REDEFINES WS01-TXT-AREA-MULT.
                    20 WS01-ID-PECA-REMAN-FWN PIC  X(020).
                    20 FILLER                 PIC  X(012).
                 15 WS01-TXT-AREA-MULT-OLYMP
                                           REDEFINES WS01-TXT-AREA-MULT.
                    20 WS01-ID-PECA-OLYMP     PIC  X(020).
                    20 FILLER                 PIC  X(012).
                 15 WS01-TXT-AREA-MULT-CMIS2
                                           REDEFINES WS01-TXT-AREA-MULT.
                    20 WS01-ID-VOL-CMIS2      PIC  X(008).
                    20 FILLER                 PIC  X(001).
                    20 WS01-ID-CCR            PIC  X(016).
                    20 FILLER                 PIC  X(007).
              10 FILLER                       PIC  X(001).      
              10 WS01-CTP-DESCR-COMPLETA      PIC  X(730).
      *----------------------------------------------------------------*
           05 WS01-TXT-COMPLETAR-EMIF-AUX.
              10 FILLER                       PIC  X(064)  VALUE SPACES.
              10 WS01-CTP-DESCR-COMPL-AUX     PIC  X(730).
      *----------------------------------------------------------------*

           05 WS01-PESO-BRT-EMIF             PIC  X(010).
           05 WS01-PESO-BRT-EMIF-RED  REDEFINES  WS01-PESO-BRT-EMIF.
              10 WS01-PESO-BRT-EMIF-FILL1    PIC  X(001).
              10 WS01-PESO-BRT-EMIF-INT      PIC  X(005).
              10 WS01-PESO-BRT-EMIF-FILL2    PIC  X(001).
              10 WS01-PESO-BRT-EMIF-DEC      PIC  X(003).

           05 WS01-CD-RR-CTB                 PIC  X(015) VALUE SPACES.
           05 WS01-CD-RR-CTB-R REDEFINES WS01-CD-RR-CTB.
              10 WS01-CD-RR-CTB-SEC          PIC  X(002).
              10 WS01-CD-RR-CTB-LIT          PIC  X(002).
              10 WS01-CD-RR-CTB-NF           PIC  X(005).
              10 WS01-CD-RR-CTB-FILL         PIC  X(006).

           05 WS01-PESO-BRT-EMIF-NUM         PIC  9(005)V999.
           05 WS01-PESO-BRT-EMIF-NUM-R REDEFINES WS01-PESO-BRT-EMIF-NUM.
              10 WS01-PESO-BRT-EMIF-N-I      PIC  X(005).
              10 WS01-PESO-BRT-EMIF-N-D      PIC  X(003).

           05 WS01-PESO-CTB                  PIC  X(016) VALUE ZEROS.
           05 WS01-PESO-CTB-R REDEFINES WS01-PESO-CTB.
              10 WS01-PESO-CTB-FILL1         PIC  X(007).
              10 WS01-PESO-CTB-PESO          PIC  X(008).
              10 WS01-PESO-CTB-FILL2         PIC  X(001).

           05 WS01-AUX-TX-DEA-7              PIC  X(007).
           05 WS01-AUX-TX-DEA-7-R REDEFINES WS01-AUX-TX-DEA-7.
              10 WS01-AUX-TX-DEA-7-FILL1     PIC  X(001).
              10 WS01-AUX-TX-DEA-7-INT       PIC  X(003).
              10 WS01-AUX-TX-DEA-7-FILL2     PIC  X(001).
              10 WS01-AUX-TX-DEA-7-DEC       PIC  X(002).

           05 WS01-AUX-TX-DEA-5              PIC  X(005).
           05 WS01-AUX-TX-DEA-5-R REDEFINES WS01-AUX-TX-DEA-5.
              10 WS01-AUX-TX-DEA-5-INT       PIC  X(003).
              10 WS01-AUX-TX-DEA-5-DEC       PIC  X(002).

           05 WS01-FIM-INTERFACE-DEA.
              10 WS01-FIM-DEA-PROCESSO       PIC  X(030).
              10 WS01-FIM-DEA-DATA           PIC  X(016).

           05 WS01-VALOR-AUX-4-2             PIC  X(006).
           05 WS01-VALOR-AUX-4-2-R  REDEFINES  WS01-VALOR-AUX-4-2
                                             PIC S9(004)V99.

           05 WS01-VALOR-AUX-14-4            PIC  X(018).
           05 WS01-VALOR-AUX-14-4-R  REDEFINES  WS01-VALOR-AUX-14-4
                                             PIC S9(014)V9999.

           05 WS01-VALOR-AUX-16-2            PIC  X(018).
           05 WS01-VALOR-AUX-16-2-R  REDEFINES  WS01-VALOR-AUX-16-2
                                             PIC S9(016)V99.

           05 WS01-VALOR-AUX                 PIC  X(017).
           05 WS01-VALOR-AUX-R  REDEFINES  WS01-VALOR-AUX
                                             PIC S9(015)V99.

           05 WS01-VALOR-AUX-13                 PIC  X(013).
           05 WS01-VALOR-AUX-13-R  REDEFINES  WS01-VALOR-AUX-13
                                             PIC S9(011)V99.

           05 WS01-VLR-NF-BARRA              PIC S9(015)V99.
           05 WS01-VLR-NF-BARRA-R  REDEFINES  WS01-VLR-NF-BARRA.
              10 FILLER                      PIC  X(007).
              10 WS01-VLR-NF-BARRA-10        PIC  X(010).

           05 WS01-VLR-ICMS-BARRA            PIC S9(015)V99.
           05 WS01-VLR-ICMS-BARRA-R  REDEFINES  WS01-VLR-ICMS-BARRA.
              10 FILLER                      PIC  X(008).
              10 WS01-VLR-ICMS-BARRA-9       PIC  X(009).

           05 WS01-VALOR-AUX-4-DEC           PIC  X(017).
           05 WS01-VALOR-AUX-4-DEC-R  REDEFINES  WS01-VALOR-AUX-4-DEC
                                             PIC S9(013)V9999.

           05 WS01-TEXTO-COMPL-AUX.
              10 WS01-TXT-PESO-BRT           PIC  X(008).
              10 WS01-TXT-ID-PDD             PIC  X(010).
              10 WS01-TXT-ID-VOL             PIC  X(008).

           05 WS01-SIT-TRIB.
              10 WS01-SIT-1                  PIC  X(001).
              10 WS01-SIT-2                  PIC  X(002).

           05 WS01-TIPO-RECOLHIMENTO.
              10 WS01-CD-T-REC               PIC  X(002).
              10 FILLER                      PIC  X(002)   VALUE '- '.
              10 WS01-DESC-REC               PIC  X(025).

           05 WS01-ORIGEM                    PIC  X(025).
           05 FILLER  REDEFINES  WS01-ORIGEM.
              10 WS01-ORIGEM-TAB  OCCURS  25 TIMES 
                                             PIC  X(001).

           05 WS01-DESTINO                   PIC  X(025).
           05 FILLER  REDEFINES  WS01-DESTINO.
              10 WS01-DESTINO-TAB  OCCURS  25 TIMES 
                                             PIC  X(001).

           05 WS01-TABELA-CONV-UF.
              10 FILLER                      PIC  X(058) VALUE
           'ACALAPAMBACEDFES  GO  MAMTMGPAPBPRPEPIRNRSRJRORRSCSPSEMSTO'.
           05 WS01-TABELA-CONV-UF-R  REDEFINES  WS01-TABELA-CONV-UF.
              10 FILLER  OCCURS  29 TIMES.
                 15 WS01-UF-TAB              PIC  X(002). 
 
           05 WS01-CONV-COD-BARRA.
              10 WS01-CONV-SPACE             PIC  X(001) VALUE X"A0".
              10 FILLER                      PIC  X(006) VALUE
                 '!"#$%&'.
              10 FILLER                      PIC  X(001) VALUE
                 "'".
              10 FILLER                      PIC  X(042) VALUE
                 '()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQ'.
              10 FILLER                      PIC  X(053) VALUE
                'RSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~        '.
           05 WS01-CONV-BARRA  REDEFINES  WS01-CONV-COD-BARRA.
              10 FILLER  OCCURS  103 TIMES.
                 15 WS01-CONV-BARRA-TAB      PIC  X(001).
 
           05 WS01-REFER-COD-BARRA.
              10 WS01-NFE-LOCALIZADOR-BAR    PIC  X(044) VALUE ZEROS.
           05 WS01-REFER-COD-BARRA-R  REDEFINES  WS01-REFER-COD-BARRA.
              10 FILLER  OCCURS  22 TIMES.
                 15 WS01-REF-COD-BARRA       PIC  9(002). 
 
           05 WS01-CODIGO-DE-BARRA.
              10 FILLER                      PIC  X(005) VALUE '(70X'.
              10 WS01-CODIGO-BARRA-START     PIC  X(001) VALUE X"CD".
              10 WS01-CODIGO-DE-BARRA-22     PIC  X(022) VALUE SPACES.
              10 WS01-COD-BARRA-R  REDEFINES  WS01-CODIGO-DE-BARRA-22.
                 15 FILLER  OCCURS  22 TIMES.
                    20 WS01-COD-BARRA-TAB    PIC  X(001). 
              10 WS01-CODIGO-DE-BARRA-DIG    PIC  X(001)   VALUE SPACES.
              10 WS01-CODIGO-BARRA-STOP      PIC  X(001) VALUE X"CE".
 
           05 WS01-REFER-COD-BARRA-PRT.
              10 WS01-N-LOTE-PROTOCOL-BAR    PIC  X(008) VALUE ZEROS.
           05 WS01-REFER-COD-BARRA-PRT-R  REDEFINES
                                               WS01-REFER-COD-BARRA-PRT.
              10 FILLER  OCCURS  4 TIMES.
                 15 WS01-REF-COD-BARRA-PRT   PIC  9(002).

           05 WS01-CODIGO-DE-BARRA-PRT.
              10 FILLER                       PIC  X(005) VALUE '(70X'.
              10 WS01-CODIGO-BARRA-PRT-START  PIC  X(001) VALUE X"CD".
              10 WS01-CODIGO-DE-BARRA-PRT-08  PIC  X(004) VALUE SPACES.
              10 WS01-COD-BARRA-PRT-R  REDEFINES
                                            WS01-CODIGO-DE-BARRA-PRT-08.
                 15 FILLER  OCCURS  4 TIMES.
                    20 WS01-COD-BARRA-PRT-TAB PIC  X(001). 
              10 WS01-CODIGO-DE-BARRA-PRT-DIG PIC  X(001) VALUE SPACES.
              10 WS01-CODIGO-BARRA-PRT-STOP   PIC  X(001) VALUE X"CE".

           05 WS01-CALC-DIG-COD-BARRA        PIC  9(009)V99 VALUE ZEROS.
           05 FILLER  REDEFINES  WS01-CALC-DIG-COD-BARRA.
              10 WS01-CALC-DIG-COD-BARRA-INT PIC  9(009).
              10 WS01-CALC-DIG-COD-BARRA-DEC PIC  9(002).
 
           05 WS01-CGC-EMIF-ORIG             PIC  X(018).
           05 FILLER  REDEFINES  WS01-CGC-EMIF-ORIG.
              10 WS01-CGC-EMIF-O-1           PIC  X(002).
              10 FILLER                      PIC  X(001).
              10 WS01-CGC-EMIF-O-2           PIC  X(003).
              10 FILLER                      PIC  X(001).
              10 WS01-CGC-EMIF-O-3           PIC  X(003).
              10 FILLER                      PIC  X(001).
              10 WS01-CGC-EMIF-O-4           PIC  X(004).
              10 FILLER                      PIC  X(001).
              10 WS01-CGC-EMIF-O-5           PIC  X(002).
 
           05 WS01-CGC-EMIF-DEST             PIC  X(014).
           05 FILLER  REDEFINES  WS01-CGC-EMIF-DEST.
              10 WS01-CGC-EMIF-D-1           PIC  X(002).
              10 WS01-CGC-EMIF-D-2           PIC  X(003).
              10 WS01-CGC-EMIF-D-3           PIC  X(003).
              10 WS01-CGC-EMIF-D-4           PIC  X(004).
              10 WS01-CGC-EMIF-D-5           PIC  X(002).
 
           05 WS01-PCL.
              10 FILLER                      PIC  X(003)   VALUE '*p'.
              10 WS01-PCL-POSICAO-X          PIC  X(004)   VALUE SPACES.
              10 FILLER                      PIC  X(001)   VALUE 'x'.
              10 FILLER                      PIC  X(003)   VALUE '*p'.
              10 WS01-PCL-POSICAO-Y          PIC  X(004)   VALUE SPACES.
              10 FILLER                      PIC  X(001)   VALUE 'Y'.
              10 WS01-PCL-DADOS              PIC  X(090).
 
           05 WS01-PCL-RESET.
              10 FILLER                      PIC  X(003)   VALUE '*p'.
              10 WS01-PCL-RESET-X            PIC  X(004)   VALUE SPACES.
              10 FILLER                      PIC  X(001)   VALUE 'x'.
              10 FILLER                      PIC  X(003)   VALUE '*p'.
              10 WS01-PCL-RESET-Y            PIC  X(004)   VALUE SPACES.
              10 FILLER                      PIC  X(001)   VALUE 'Y'.
              10 WS01-PCL-DADOS-RESET        PIC  X(090).
              10 FILLER                      PIC  X(007)   VALUE 
                                                              '*p0x0Y'.

            05 WS01-PCL-VERTICAL.
              10 FILLER                      PIC  X(003)   VALUE '*p'.
              10 WS01-PCL-VERTICAL-X         PIC  X(004)   VALUE SPACES.
              10 FILLER                      PIC  X(001)   VALUE 'x'.
              10 WS01-PCL-VERTICAL-Y         PIC  X(004)   VALUE SPACES.
              10 FILLER                      PIC  X(001)   VALUE 'Y'.
              10 FILLER                      PIC  X(007)   VALUE
                                                              '&a270P'.
              10 WS01-PCL-DADOS-VERTICAL     PIC  X(088).
              10 FILLER                      PIC  X(012)   VALUE 
                                                         '&a0P*p0x0Y'.
                                                              
           05 WS01-PCL-POS-AUX               PIC  X(004)   VALUE ZEROS.
           05 WS01-PCL-POS-AUX-R  REDEFINES  WS01-PCL-POS-AUX
                                             PIC  9(004).
 
           05 WS01-PCL-POS-AUX-X             PIC  X(004)   VALUE ZEROS.
           05 WS01-PCL-POS-AUX-X-R  REDEFINES  WS01-PCL-POS-AUX-X
                                             PIC  9(004).
 
           05 WS01-DRE-CN-LNH-REL            PIC  X(500)   VALUE SPACES.
           05 WS01-DRE-CN-LNH-REL-R  REDEFINES  WS01-DRE-CN-LNH-REL.
              10 FILLER  OCCURS  4 TIMES.
                 15 WS01-DRE-CN-LNH-REL-TAB  PIC  X(125). 

           05 WS01-DESC-VIA.
              10 WS01-VIA-NUM                PIC  X(001)   VALUE 'a'.
              10 FILLER                      PIC  X(001)   VALUE SPACES.
              10 WS01-VIA-LIT                PIC  X(003)   VALUE 'Via'.
 
           05 WS01-PJL-AUX.
              10 WS01-PJL-SET-AUX            PIC  X(020)  VALUE SPACES.
              10 FILLER                      PIC  X(453)  VALUE SPACES.
              10 WS01-PJL-CMD-AUX            PIC  X(025)  VALUE SPACES.
              10 FILLER                      PIC  X(002)  VALUE SPACES.
 
           05 WS01-DANFES.
              10 WS01-DANFE-MENOR            PIC  X(009).
              10 FILLER                      PIC  X(002)   VALUE SPACES.
              10 FILLER                      PIC  X(003)   VALUE 'Ate'.
              10 FILLER                      PIC  X(002)   VALUE SPACES.
              10 WS01-DANFE-MAIOR            PIC  X(009).
 
           05 WS01-CLSF-FSCL-AUX-12          PIC  X(012)    VALUE
                                                       '000000000000'.
           05 WS01-CLSF-FSCL-AUX-12-R  REDEFINES  WS01-CLSF-FSCL-AUX-12.
              10 FILLER                      PIC  X(002).
              10 WS01-CLSF-FSCL-AUX-10.
                 15 WS01-CLSF-FSCL-AUX-1-2   PIC  X(002).
                 15 WS01-CLSF-FSCL-AUX-3-4   PIC  X(002).
                 15 WS01-CLSF-FSCL-AUX-5-6   PIC  X(002).
                 15 WS01-CLSF-FSCL-AUX-7-8   PIC  X(002).
                 15 WS01-CLSF-FSCL-AUX-9-10  PIC  X(002).
 
           05 WS01-MENSAGEM                  PIC  X(1360).
           05 WS01-MENSAGEM-R  REDEFINES  WS01-MENSAGEM.
              10 FILLER  OCCURS  10 TIMES.
                 15 WS01-MENSAGEM-TAB-P1     PIC  X(068).
                 15 WS01-MENSAGEM-TAB-P2     PIC  X(068).

           05 WQ01-IND-NF-MAX                PIC  X(004).
           05 WQ01-TXT-SEQ-NF                PIC  X(344)   VALUE SPACES.
           05 WQ01-ID-NF-SEQ                 PIC  X(009).
           05 WQ01-ID-NF-SEQ-AUX             PIC  X(009).
           05 WQ01-TXT-NF-IST-ESP            PIC  X(344)   VALUE SPACES.

           05 WS01-TXT-SEQ-NF                PIC  X(345)   VALUE SPACES.
           05 WS01-TXT-SEQ-NF-R  REDEFINES  WS01-TXT-SEQ-NF.
              10 FILLER  OCCURS  345  TIMES.
                 15 WS01-TXT-SEQ-NF-C        PIC  X(001).
           
           05 WS01-TXT-SEQ-NF-LN             PIC  X(044)   VALUE SPACES.
           05 WS01-TXT-SEQ-NF-LN-R  REDEFINES  WS01-TXT-SEQ-NF-LN.
              10 FILLER  OCCURS  44  TIMES.
                 15 WS01-TXT-SEQ-NF-LN-C     PIC  X(001).

           05 WS01-MSG-NFE-CTGC.
              10 FILLER                      PIC  X(032)   VALUE
                                     'DANFE em contingencia, impresso '.
              10 FILLER                      PIC  X(037)   VALUE
                                'em decorrencia de problemas tecnicos '.

           05 WS01-MSG-NFE-EPEC.
              10 FILLER                      PIC  X(057)   VALUE
            'DANFE impresso em contingencia - Emissao Previa em Contin'.
              10 FILLER                      PIC  X(053)   VALUE
                'gencia regularmente recebida pela Receita Federal do '.
              10 FILLER                      PIC  X(052)   VALUE
                 'Brasil, Motivo: Falha no envio da NFe para Sefaz. - '.
              10 WS01-MSG-NFE-EPEC-UF        PIC  X(002).
              10 FILLER                      PIC  X(008)   VALUE
                                                             '. Data: '.
              10 WS01-MSG-NFE-EPEC-DTC       PIC  X(019).
              10 FILLER                      PIC  X(004)   VALUE '. - '.

           05 WS01-PTD-PESO-TTL-LQD          PIC  X(013).
           05 WS01-PTD-PESO-TTL-LQD-R  REDEFINES  WS01-PTD-PESO-TTL-LQD
                                             PIC  9(010)V999.

           05 WS01-PTD-PESO-TTL-BRT          PIC  X(013).
           05 WS01-PTD-PESO-TTL-BRT-R  REDEFINES  WS01-PTD-PESO-TTL-BRT
                                             PIC  9(010)V999.

           05 WS01-PTD-V-TTL-MRCD            PIC  X(013).
           05 WS01-PTD-V-TTL-MRCD-R  REDEFINES  WS01-PTD-V-TTL-MRCD
                                             PIC  9(011)V99.

           05 WS01-BULK-PKG-QTD              PIC  9(005)V99 VALUE ZEROS.
           05 WS01-BULK-PKG-R  REDEFINES  WS01-BULK-PKG-QTD.
              10 WS01-BULK-PKG-INT           PIC  9(005).
              10 WS01-BULK-PKG-RES           PIC  9(002).

           05 WS01-V-TTL-FRT                 PIC  9(013)    VALUE ZEROS.
           05 WS01-V-TTL-FRT-R  REDEFINES  WS01-V-TTL-FRT.
              10 FILLER                      PIC  9(004).
              10 WS01-V-TTL-FRT-9            PIC  9(009).

           05 WS01-V-TTL-SGR                 PIC  9(013)    VALUE ZEROS.
           05 WS01-V-TTL-SGR-R  REDEFINES  WS01-V-TTL-SGR.
              10 FILLER                      PIC  9(004).
              10 WS01-V-TTL-SGR-9            PIC  9(009).
              
           05 WS01-V-TTL-ODA                 PIC  9(013)    VALUE ZEROS.
           05 WS01-V-TTL-ODA-R  REDEFINES  WS01-V-TTL-ODA.
              10 FILLER                      PIC  9(004).
              10 WS01-V-TTL-ODA-9            PIC  9(009).

           05 WS01-V-TTL-ARED-CES            PIC  9(013)    VALUE ZEROS.
           05 WS01-V-TTL-ARED-CES-R  REDEFINES  WS01-V-TTL-ARED-CES.
              10 FILLER                      PIC  9(004).
              10 WS01-V-TTL-ARED-CES-9       PIC  9(009).

           05 WS01-V-TTL-AI                  PIC  9(015)    VALUE ZEROS.
           05 WS01-TTL-FEES-CES              PIC  9(015)    VALUE ZEROS.

           05 WS01-SEQ-ITEM                  PIC  9(003)    VALUE ZEROS.
           05 WS01-SEQ-LIN-DFE               PIC  9(006)    VALUE ZEROS.
           05 WS01-IND-DESC-CPLT             PIC  9(006)    VALUE ZEROS.
           05 WS01-V-FRT-AUX                 PIC S9(011)V99 VALUE ZEROS.
           05 WS01-TOTAL-V-FRT               PIC S9(015)V99 VALUE ZEROS.
           05 WS01-CALC-POS-AUX              PIC  9(004)    VALUE ZEROS.
           05 WS01-POS-ENDR-AUX              PIC  9(004)    VALUE ZEROS.
           05 WS01-CD-SQN-LNH                PIC  9(005)    VALUE ZEROS.
           05 WS01-CD-SQN-LNH-AUX            PIC  9(009)    VALUE ZEROS.
           05 WS01-SEQ-LIN-PAG               PIC  9(006)    VALUE ZEROS.
           05 WS01-VIA-TRANSPORTE            PIC  X(022)   VALUE SPACES.
           05 WS01-ID-VIA                    PIC  9(002)    VALUE ZEROS.
           05 WS01-ID-VIA-AUX                PIC  9(002)    VALUE ZEROS.
           05 WS01-QTDE-VIA-DANFE            PIC  9(002)    VALUE ZEROS.
           05 WS01-QTDE-VIA-PTD              PIC  9(002)    VALUE ZEROS.
           05 WS01-QTDE-VIA-PCK-LIST         PIC  9(002)    VALUE ZEROS.
           05 WS01-SEQ-VOL-PTD               PIC  9(004)    VALUE ZEROS.
           05 WS01-SEQ-VOL-PTD-IMP           PIC  9(004)    VALUE ZEROS.
           05 WS01-TOT-COD-BARRA             PIC  9(009)    VALUE ZEROS.
           05 WS01-DIG-COD-BARRA             PIC  9(009)    VALUE ZEROS.
           05 WS01-PRECO-TOTAL-M-TOT         PIC S9(015)V99   COMP-3.
           05 WS01-PESO-BRUTO-KG-TOT         PIC S9(013)V9999 COMP-3.
           05 WS01-PESO-LIQUIDO-KG-TOT       PIC S9(013)V9999 COMP-3.
           05 WS01-NUM-VIAS-PTD              PIC  9(001).
           05 WS01-NUM-VIAS-VOL              PIC  9(001).
           05 WS01-IMPRESSORA-LASER          PIC  X(030).
           05 WS01-PTD-ID-PTC-DSP-ANT        PIC  X(007).
           05 WS01-QTD-VOL-CONF              PIC  9(005)    VALUE ZEROS.
           05 WS01-TOT-VOL-CONF              PIC  9(005)    VALUE ZEROS.
           05 WS01-TOT-PECA-DET-PTD          PIC  9(005)    VALUE ZEROS.
           05 WS01-BULK                      PIC  9(005)    VALUE ZEROS.
           05 WS01-PKG                       PIC  9(005)    VALUE ZEROS.
           05 WS01-BULK-PKG                  PIC  X(005).
           05 WS01-MINIMA                    PIC  9(005)    VALUE ZEROS.
           05 WS01-LINHA-IMPR-AUX            PIC  X(125).
           05 WS01-DRE-ID-PRCP-ANT           PIC  X(040)   VALUE SPACES.
           05 WS01-DRE-ID-PRCP-AUX           PIC  X(040)   VALUE SPACES.
           05 WS01-DRE-CD-SQN-PJL-ANT        PIC  X(002)   VALUE SPACES.
           05 WS01-DRE-CD-SQN-PJL-AUX        PIC  X(002)   VALUE SPACES.
           05 WS01-ID-PRCP-PTD-ANT           PIC  X(008)   VALUE SPACES.
           05 WS01-ID-PRCP-PTD-AUX           PIC  X(008)   VALUE SPACES.
           05 WS01-UND-TAM                   PIC S9(008)         COMP.
           05 WS01-ARE-HIGH                  PIC  X(001)
                                                      VALUE HIGH-VALUES.
           05 WS01-PESO-AUX                  PIC  9(005)V999.
           05 WS01-Q-PECA-AUX                PIC  9(005).
           05 WS01-TERMO-SPPP                PIC  X(001).
           05 WS01-CONT-ITEM-CTB             PIC  9(003)    VALUE ZEROS.
           05 WS01-ID-NUM-CNT                PIC  9(009)    VALUE ZEROS.
           05 WS01-ID-NUM-CNT-S              PIC  9(009)    VALUE ZEROS.
           05 WS01-ID-NUM-T-REG              PIC  9(009)    VALUE ZEROS.
           05 WS01-ID-NUM-T-REG-S            PIC  9(009)    VALUE ZEROS.
           05 WS01-Q-TTL-ITEM-FAT            PIC  9(009)    VALUE ZEROS.
           05 WS01-Q-PECA-ITM-AUX            PIC  9(005).
           05 WS01-INVC-LN-BILL-QTY.
                10 WS01-INVC-LN-BILL-QTY-7   PIC  9(008)    VALUE ZEROS.
                10 WS01-INVC-LN-BILL-QTY-5   PIC  9(005)    VALUE ZEROS.
           05 WS01-ID-VOL-PCK-LST-ANT        PIC  X(008).
           05 WS01-ID-PDD-PCK-LST-ANT        PIC  X(010).
           05 WS01-LN-TOTAL-PCK-AUX.
              10 WS01-LN-TOTAL-PCK-AUX-1     PIC  X(035).
              10 WS01-LN-TOTAL-PCK-AUX-2     PIC  X(011).
              10 WS01-LN-TOTAL-CD-QBR        PIC  X(008).
              10 WS01-LN-TOTAL-PCK-AUX-3     PIC  X(035).
           05 WS01-LN-LST-PCK-TOT-AUX.
              10 WS01-LN-LST-PCK-AUX-1       PIC  X(025).
              10 WS01-LN-LST-PCK-AUX-2       PIC  X(025).

           05 WS01-TXT-INFR-ADIC.
              10 FILLER                      PIC  X(010)   VALUE SPACES.
              10 WS01-TXT-SUB-HDR            PIC  X(020).

           05 WS01-ID-NF-CPLM-AUX.
              10 WS01-ID-NF-CPLM-AUX-P1      PIC  X(002).
              10 WS01-ID-NF-CPLM-AUX-P2      PIC  X(007).
              
           05 WS01-NUM-DFE-FOLHA.
              10 WS01-NUM-DFE-FOLHA-P1.
                 15 WS01-NUMERO-DANFE-NFE.
                    20 WS01-NUMERO-DANFE-P1  PIC  X(003).
                    20 FILLER                PIC  X(001)   VALUE '.'.
                    20 WS01-NUMERO-DANFE-P2  PIC  X(003).
                    20 FILLER                PIC  X(001)   VALUE '.'.
                    20 WS01-NUMERO-DANFE-P3  PIC  X(003).
              10 WS01-NUM-DFE-FOLHA-P2.
                 15 FILLER                   PIC  X(007)   VALUE
                                                              '  - FL '.
                 15 WS01-NUM-TTL-PAG.
                    20 WS01-NUM-PAG          PIC  ZZ9.
                    20 FILLER                PIC  X(003)   VALUE ' / '.
                    20 WS01-TTL-PAG          PIC  ZZ9.

           05 WS01-NUM-PAG-AUX               PIC  9(003).
           05 WS01-TTL-PAG-AUX               PIC  9(003).

           05 WS01-NFE-LOCALIZADOR.
              10 WS01-NFE-LOCALIZADOR-P01    PIC  X(002).
              10 WS01-NFE-LOCALIZADOR-P02    PIC  X(004).
              10 WS01-NFE-LOCALIZADOR-P03    PIC  X(002).
              10 WS01-NFE-LOCALIZADOR-P04    PIC  X(003).
              10 WS01-NFE-LOCALIZADOR-P05    PIC  X(003).
              10 WS01-NFE-LOCALIZADOR-P06    PIC  X(004).
              10 WS01-NFE-LOCALIZADOR-P07    PIC  X(002).
              10 WS01-NFE-LOCALIZADOR-P08    PIC  X(002).
              10 WS01-NFE-LOCALIZADOR-P09    PIC  X(003).
              10 WS01-NFE-LOCALIZADOR-P10    PIC  X(003).
              10 WS01-NFE-LOCALIZADOR-P11    PIC  X(003).
              10 WS01-NFE-LOCALIZADOR-P12    PIC  X(003).
              10 WS01-NFE-LOCALIZADOR-P13    PIC  X(003).
              10 WS01-NFE-LOCALIZADOR-P14    PIC  X(003).
              10 WS01-NFE-LOCALIZADOR-P15    PIC  X(003).
              10 WS01-NFE-LOCALIZADOR-P16    PIC  X(001).

           05 WS01-NFE-LOCALIZADOR-FRTD.
              10 WS01-NFE-LOCAL-FRTD-P01     PIC  X(002).
              10 FILLER                      PIC  X(001)   VALUE '.'.
              10 WS01-NFE-LOCAL-FRTD-P02     PIC  X(004).
              10 FILLER                      PIC  X(001)   VALUE '.'.
              10 WS01-NFE-LOCAL-FRTD-P03     PIC  X(002).
              10 FILLER                      PIC  X(001)   VALUE '.'.
              10 WS01-NFE-LOCAL-FRTD-P04     PIC  X(003).
              10 FILLER                      PIC  X(001)   VALUE '.'.
              10 WS01-NFE-LOCAL-FRTD-P05     PIC  X(003).
              10 FILLER                      PIC  X(001)   VALUE '/'.
              10 WS01-NFE-LOCAL-FRTD-P06     PIC  X(004).
              10 FILLER                      PIC  X(001)   VALUE '-'.
              10 WS01-NFE-LOCAL-FRTD-P07     PIC  X(002).
              10 FILLER                      PIC  X(001)   VALUE '-'.
              10 WS01-NFE-LOCAL-FRTD-P08     PIC  X(002).
              10 FILLER                      PIC  X(001)   VALUE '-'.
              10 WS01-NFE-LOCAL-FRTD-P09     PIC  X(003).
              10 FILLER                      PIC  X(001)   VALUE '-'.
              10 WS01-NFE-LOCAL-FRTD-P10     PIC  X(003).
              10 FILLER                      PIC  X(001)   VALUE '.'.
              10 WS01-NFE-LOCAL-FRTD-P11     PIC  X(003).
              10 FILLER                      PIC  X(001)   VALUE '.'.
              10 WS01-NFE-LOCAL-FRTD-P12     PIC  X(003).
              10 FILLER                      PIC  X(001)   VALUE '-'.
              10 WS01-NFE-LOCAL-FRTD-P13     PIC  X(003).
              10 FILLER                      PIC  X(001)   VALUE '.'.
              10 WS01-NFE-LOCAL-FRTD-P14     PIC  X(003).
              10 FILLER                      PIC  X(001)   VALUE '.'.
              10 WS01-NFE-LOCAL-FRTD-P15     PIC  X(003).
              10 FILLER                      PIC  X(001)   VALUE '-'.
              10 WS01-NFE-LOCAL-FRTD-P16     PIC  X(001).

           05 WS01-NFE-PROTOCOLO-DT-ULT-ALT.
              10 WS01-NFE-PROTOCOLO          PIC  X(015).
              10 FILLER                      PIC  X(001).
              10 WS01-CTRL-DT-PROTOCOLO      PIC  X(019).

           05 WS01-DESCRICAO                 PIC  X(120).
           05 WSWS01-DESCRICAO-R  REDEFINES  WS01-DESCRICAO.
              10 WS01-DESCRICAO-LNH-01       PIC  X(066).
              10 WS01-DESCRICAO-LNH-02       PIC  X(054).

           05 WS01-DESC-TXT-CMPL.
              10 WS01-NOME                   PIC  X(012).
              10 WS01-TXT-CLPM               PIC  X(063).
              
           05 WS01-IC-PAG-ADIC               PIC  X(001)    VALUE 'N'.
           
           05 WS01-UF-PAIS-DEST.
              10 WS01-UF-DEST                PIC  X(002).
              10 WS01-SEP-UF-PAIS-DEST       PIC  X(003).
              10 WS01-PAIS-DEST              PIC  X(080).

           05 WS01-NUMERO-DANFE-AUX.
              10 WS01-NUMERO-DANFE-A-P1      PIC  X(003).
              10 WS01-NUMERO-DANFE-A-P2      PIC  X(003).
              10 WS01-NUMERO-DANFE-A-P3      PIC  X(003).

           05 WS01-TTL-LNH-DESC-ITM          PIC  9(005).
           05 WS01-TOT-LNH-DESC-CPLT         PIC  9(005).
           05 WS01-T-IMPS                    PIC  X(001).

           05 WS01-ENDERECO-ED               PIC  X(094).
           05 WS01-ENDERECO-ED-R  REDEFINES  WS01-ENDERECO-ED.
              10 WS01-ENDERECO-ED-P1         PIC  X(047).
              10 WS01-ENDERECO-ED-P2         PIC  X(047).

           05 WS01-RAZAO-SOCIAL-ED           PIC  X(056).
           05 WS01-RAZAO-SOCIAL-ED-R  REDEFINES  WS01-RAZAO-SOCIAL-ED.
              10 WS01-RAZAO-SOCIAL-ED-P1     PIC  X(028).
              10 WS01-RAZAO-SOCIAL-ED-P2     PIC  X(028).
           
           05 WS01-CD-T-DSCT-CAMP-AUX        PIC  X(001).

           05 WS01-TXT-CAMPO-AUTOR-01        PIC  X(052)   VALUE
                 'Consulta de autenticidade no portal nacional da NF-e'.

           05 WS01-TXT-CAMPO-AUTOR-02.
              10 WS01-TXT-CAMPO-AUTOR-02-P1  PIC  X(030)   VALUE
                                       'www.nfe.fazenda.gov.br/portal '.
              10 WS01-TXT-CAMPO-AUTOR-02-P2  PIC  X(032)   VALUE
                                     'ou no site da Sefaz Autorizadora'.

           05 WS01-DESCRICAO-COMPLETA        PIC  X(792).
           05 WS01-DESCRICAO-COMPLETA-R REDEFINES
              WS01-DESCRICAO-COMPLETA  OCCURS  12  TIMES.
              10 WS01-LIN-DESC-CPLT          PIC  X(066).

           05 WS01-ID-NF-SEQ                 PIC  9(009).
           05 WS01-ID-NF-SEQ-ANT             PIC  9(009).
           05 WS01-ID-NF-SEQ-IMPS            PIC  9(009).
           05 WS01-POSICAO-NF-X              PIC  9(004).
           05 WS01-POSICAO-NF-Y              PIC  9(004).

           05 WS01-CD-SQN-PJL-AUX            PIC  X(002).
           05 WS01-CD-SQN-PJL-AUX-N  REDEFINES
                   WS01-CD-SQN-PJL-AUX       PIC  9(002).

           05 WS01-CD-SQN-PJL-PTD            PIC  X(002).
           05 WS01-CD-SQN-PJL-PTD-N  REDEFINES
                   WS01-CD-SQN-PJL-PTD       PIC  9(002).

           05 WS01-CD-SQN-PJL-INST           PIC  X(002).
           05 WS01-CD-SQN-PJL-INST-N  REDEFINES
                   WS01-CD-SQN-PJL-INST      PIC  9(002).

           05 WS01-CD-SQN-PJL-NF             PIC  X(002).
           05 WS01-CD-SQN-PJL-NF-N        REDEFINES
                   WS01-CD-SQN-PJL-NF        PIC  9(002).

           05 WS01-CD-SQN-PJL-PKLST          PIC  X(002).
           05 WS01-CD-SQN-PJL-PKLST-N     REDEFINES
                   WS01-CD-SQN-PJL-PKLST     PIC  9(002).

           05 WS01-IND-PJL-PKLST-AUX         PIC  9(002).
           05 WS01-TITULO-PACK-LIST          PIC  X(050).
           05 WS01-POS-PACK-LIST-X           PIC  X(004).

           05 WS01-VL-STF-CTB                PIC  9(016).
           05 WS01-VL-STF-CTB-R           REDEFINES       
                   WS01-VL-STF-CTB           PIC  9(014)V99.

           05 WS01-VL-TOTAL-FCP-ST           PIC  9(011)V99.
           05 WS01-VL-ICMS-FCPST             PIC  9(016).
           05 WS01-VL-ICMS-FCPST-R        REDEFINES       
                   WS01-VL-ICMS-FCPST        PIC  9(014)V99.
           05 WS01-VL-TOTAL-ST               PIC  9(011)V99.
           05 WS01-VL-ICMS-ST                PIC  9(007)V99.

      *----------------------------------------------------------------*
      *       === AREA PARA CHAVEAMENTO DO PROGRAMA ===      ACA 10/00 *
      *----------------------------------------------------------------*
      
       01  WS31-ARE-CHV.
           05 WS31-CHV-ERRO                  PIC  X(001)   VALUE SPACES.
           05 WS31-CHV-NTFD-SQL              PIC  9(004)   VALUE 1403.
           05 WS31-CHV-CANCELADO             PIC  X(001)   VALUE SPACES.
           05 WS31-CHV-SUB-OK                PIC  X(001)   VALUE SPACES.
           05 WS31-CHV-INC-OK                PIC  X(001)   VALUE SPACES.
           05 WS31-CHV-CARREGA-TAB           PIC  X(001)   VALUE SPACES.
           05 WS31-CHV-COMANDO-PJL           PIC  X(001)   VALUE SPACES.
           05 WS31-CHV-CME                   PIC  X(001)   VALUE SPACES.
           05 WS31-CHV-DEA                   PIC  X(001)   VALUE SPACES.
           05 WS31-CHV-GETMAIN               PIC  X(001)   VALUE SPACES.
           05 WS31-CHV-FIM-PCK-LST           PIC  X(001)   VALUE SPACES.
           
      *----------------------------------------------------------------*
      *           === AREA PARA INDICES DO PROGRAMA ===      ACA 10/00 *
      *----------------------------------------------------------------*
      
       01  WS32-ARE-IND.
           05 WS32-IND-PCL                   PIC S9(004)   VALUE ZEROS.
           05 WS32-IND-ORIGEM                PIC S9(004)   VALUE ZEROS.
           05 WS32-IND-DESTINO               PIC S9(004)   VALUE ZEROS.
           05 WS32-IND-BARRA                 PIC S9(004)   VALUE ZEROS.
           05 WS32-IND-BARRA-1               PIC S9(004)   VALUE ZEROS.
           05 WS32-IND-BARRA-PRT             PIC S9(004)   VALUE ZEROS.
           05 WS32-IND-BARRA-PRT-1           PIC S9(004)   VALUE ZEROS.
           05 WS32-IND-UF                    PIC  9(002)   VALUE ZEROS.
           05 WS32-IND-UF-R REDEFINES WS32-IND-UF
                                             PIC  X(002).
           05 WS32-IND-AUX-SUB               PIC S9(004)   VALUE ZEROS.
           05 WS32-IND-AUX-INC               PIC S9(004)   VALUE ZEROS.
           05 WS32-IND-MSG                   PIC S9(004)   VALUE ZEROS.
           05 WS32-IND-IMPR                  PIC S9(006)   VALUE ZEROS.
           05 WS32-IND-VIAS                  PIC S9(006)   VALUE ZEROS.
           05 WS32-IND-COMANDO               PIC S9(006)   VALUE ZEROS.
           05 WS32-IND-VOLUMES               PIC S9(006)   VALUE ZEROS.
           05 WS32-IND-IN                    PIC S9(004)   VALUE ZEROS.
           05 WS32-IND-AT                    PIC S9(004)   VALUE ZEROS.
           05 WS32-IND-IMPS                  PIC S9(004)   VALUE ZEROS.
           05 WS32-IND-NF-MAX                PIC S9(004)   VALUE ZEROS.
           05 WS32-IND-TTVA-EPEC             PIC S9(004)   VALUE ZEROS.

      *----------------------------------------------------------------*
      *       === AREA PARA QUEBRAS DO FATURAMENTO ===       ACA 10/00 *
      *----------------------------------------------------------------*
      
       01  WS33-ARE-TAM.
           05 WS33-UND-TAM-PARM              PIC S9(004)         COMP
                                                  VALUE ZEROS.
           05 WS33-INTERV-DELAY              PIC S9(007)         COMP-3
                                                  VALUE ZEROS.

      *----------------------------------------------------------------*
      *            === AREA PARA SALVAR CAMPOS ===           ACA 10/00 *
      *----------------------------------------------------------------*
      
       01  WS35-ARE-SLV.
           05 WS35-AUX-TS                    PIC  X(040).      

           05 WS35-ARE-ERRO.
              10 WS35-ID-PGM                 PIC  X(008).
              10 WS35-CD-ACES-ERRO           PIC  X(002).
              10 WS35-CD-ERRO-ECI            PIC  X(002).
              10 WS35-CD-ERRO-ACES           PIC  X(002).
              10 WS35-MSG-ERRO.
                 15 WS35-MSG-ERRO-LIT        PIC  X(080).
                 15 WS35-MSG-ERRO-VAR        PIC  X(020).
              
           05 WS35-ID-CORREL-ID              PIC  X(024) VALUE SPACES.
           05 WS35-ID-CORREL-ID-R  REDEFINES   WS35-ID-CORREL-ID.
              10 WS35-ID-CORR-ID-LIT-SC      PIC  X(014).
              10 FILLER                      PIC  X(005).
              10 WS35-ID-CORR-ID-NUM-SC      PIC  9(005).
              10 WS35-ID-CORR-ID-ALF-SC REDEFINES WS35-ID-CORR-ID-NUM-SC     
                                             PIC  X(005).
                                             
           05 WS35-CONTROLE-ENQ              PIC  X(014).

      *----------------------------------------------------------------*
      *    === AREA PARA RECEBIMENTO DE PARAMETROS ===       ACA 10/00 *
      *----------------------------------------------------------------*

       01 WS36-ARE-RECEIVE.
          05 WS36-CD-MERC-DST                    PIC  X(001).
          05 WS36-DTC-SEL-FTRM                   PIC  X(014).
          05 WS36-LGON-FUNC                      PIC  X(008).
          05 WS36-FASE-FTRM                      PIC  X(001).
       01 FILLER  REDEFINES  WS36-ARE-RECEIVE.
          05 WS36-ARE-SF30                       PIC  X(024).

       01 WS36-ARE-SF31.
          05 WS36-CD-MERC-DST-SF31               PIC  X(001).
          05 WS36-DTC-SEL-FTRM-SF31              PIC  X(014).
          05 WS36-LGON-FUNC-SF31                 PIC  X(008).
          05 WS36-FASE-FTRM-SF31                 PIC  X(001).

      *----------------------------------------------------------------*
      *  == AREA PARA COMUNICACAO ENTRE PROG. DE ACESSO ==   ACA 08/00 *
      *----------------------------------------------------------------*

       01  WX01-ARE-H1CB-5026.
           05 WX01-CD-ACES                   PIC  X(002).
           05 WX01-CD-RETR-ECI               PIC  X(002).
           05 WX01-CD-RETR-ACES              PIC  X(002).
           05 WX01-ARE-COMA-01.
              10 WX01-CD-STM                 PIC  X(008).
              10 WX01-DTC-GRC                PIC  X(014).
              10 WX01-ID-PRCP                PIC  X(040).
              10 FILLER  REDEFINES  WX01-ID-PRCP.
                 15 WX01-ID-PRCP-LOTE        PIC  X(028).
                 15 WX01-ID-PRCP-CD-SEQ      PIC  X(004).
                 15 WX01-ID-PRCP-FILL        PIC  X(008).
              10 WX01-ID-AUX-IMPS-1          PIC  X(020).
              10 WX01-ID-AUX-IMPS-2          PIC  X(020).
              10 WX01-ID-AUX-IMPS-3          PIC  X(020).
              10 WX01-ID-AUX-IMPS-4          PIC  X(020).
              10 WX01-ID-AUX-IMPS-5          PIC  X(020).
              10 WX01-ID-REL                 PIC  X(050).
              10 WX01-ID-IMPR                PIC  X(030).
              10 WX01-ID-VIA                 PIC  X(002).
              10 WX01-IC-ATLZ-MNT            PIC  X(001).

       01  WX02-ARE-H1SF-5053.
           05 WX02-CD-ACES                   PIC  X(002).
           05 WX02-CD-RETR-ECI               PIC  X(002).
           05 WX02-CD-RETR-ACES              PIC  X(002).
           05 WX02-ARE-COMA-01.
              10 WX02-FTR-EXP                PIC  X(007).

       01  WX03-ARE-H1SF-5049.
           05 WX03-CD-ACES                   PIC  X(002).
           05 WX03-CD-RETR-ECI               PIC  X(002).
           05 WX03-CD-RETR-ACES              PIC  X(002).
           05 WX03-ARE-COMA-01.
              10 WX03-FTR-EXP                PIC  X(007).

       01  WX04-ARE-H1SF-5008-02.
           05 WX04-CD-ACES                   PIC  X(002).
           05 WX04-CD-RETR-ECI               PIC  X(002).
           05 WX04-CD-RETR-ACES              PIC  X(002).
           05 WX04-ARE-COMA-02.
              10 WX04-IC-T-ACAO              PIC  X(001).
              10 WX04-CD-MERC-DST            PIC  X(001).
              10 WX04-DTC-SEL-FTRM           PIC  X(014).
              10 WX04-LGON-FUNC              PIC  X(008).
              10 WX04-ID-PTC-DSP             PIC  X(007).
              10 WX04-ID-IMPR-FTRM           PIC  X(010).
              10 WX04-LGON-FUNC-RSP          PIC  X(008).

      *----------------------------------------------------------------*
      *        === AREAS PARA ACESSAR SUBROTINAS ===         ACA 10/00 *
      *----------------------------------------------------------------*

       COPY  'ARCB5010'.

       COPY  'ARCB5022'.
       
       COPY  'ARCB5035'.

      *----------------------------------------------------------------*
      *     === AREAS PARA OS ARQUIVOS VSAM ACESSADOS ===    ACA 07/99 *
      *----------------------------------------------------------------*

       COPY  'ST800141'.

       COPY  'ST800151'.
       
       COPY  'ST8001D1'.

       COPY  'RRBMQ008'.

       COPY  'RRBMQ010'.

       COPY  'SF800311'.

       COPY  'SF800321'.

       COPY  'SF800421'.

       COPY  'SE900511'.

       COPY  'SE900521'.
       
       COPY  'SE902511'.
       
       COPY  'SE902521'.
       
       COPY  'SE900411'.

       COPY  'SE900431'.

       COPY  'SE902411'.

       COPY  'SE902431'.
       
       
      *----------------------------------------------------------------*
      *         === AREA DE COMUNICACAO MQSERIES ===         EFJ 04/06 *
      *----------------------------------------------------------------*

       COPY  'MQSERIE1'.

       LINKAGE SECTION.
      *----------------*
      
      *----------------------------------------------------------------*
      *           === COMMAREA PARA COMUNICACAO ===          ACA 11/01 *
      *----------------------------------------------------------------*
      
       01 WS01-ARE-IMPRESSAO.
          05 WS01-TAB-IMPRESSAO  OCCURS 57600 TIMES.
             10 WS01-LIN-IMPR               PIC  X(120).
              

       PROCEDURE DIVISION.
      *-------------------*
      
      *----------------------------------------------------------------*
      *        === ROTINA DE PROCESSAMENTO LOGICO ===        ACA 10/00 *
      *----------------------------------------------------------------*
      
       000-00-ROTINA-PRINCIPAL               SECTION.
      *----------------------------------------------*
      
           EXEC CICS HANDLE CONDITION ERROR  (000-70-ERRO-GERAL-CICS)
                END-EXEC.

           EXEC SQL WHENEVER      SQLERROR   GOTO :000-80-ERRO-GERAL-SQL   
                END-EXEC.
 
           EXEC SQL DECLARE       CCPR       DATABASE
                END-EXEC.
 
           PERFORM 100-00-PROCESSAMENTO-LOGICO.

           GO                                TO 000-95-RETORNA-CICS.
                
       000-70-ERRO-GERAL-CICS.
      
           EXEC CICS WRITEQ TS QUEUE ('H1SF0033')
                               FROM  (WS35-AUX-TS)
                END-EXEC.
                
           MOVE 'H1SF0033'                   TO WS35-ID-PGM.                                                        
           MOVE '01'                         TO WS35-CD-ACES-ERRO.                                                  
           MOVE '02'                         TO WS35-CD-ERRO-ECI.                                                   
           MOVE '00'                         TO WS35-CD-ERRO-ACES.                                                  
           PERFORM 900-00-REGISTRA-ERRO-TRNS.                                                                  
           GO                                TO 000-95-RETORNA-CICS.
      
       000-80-ERRO-GERAL-SQL.
      
           EXEC CICS WRITEQ TS QUEUE ('H1SF0033')
                               FROM  (WS35-AUX-TS)
                END-EXEC.

           EXEC CICS WRITEQ TS QUEUE ('H1SF0033')
                               FROM  (SQLERRMC)
                END-EXEC.

           MOVE 'H1SF0033'                   TO WS35-ID-PGM.                                                        
           MOVE '01'                         TO WS35-CD-ACES-ERRO.                                                  
           MOVE '03'                         TO WS35-CD-ERRO-ECI.                                                   
           MOVE '00'                         TO WS35-CD-ERRO-ACES.                                                  
           PERFORM 900-00-REGISTRA-ERRO-TRNS.                                                                  
                
           GO                                TO 000-95-RETORNA-CICS.
      
       000-95-RETORNA-CICS.

           PERFORM 595-00-EMITE-RETURN-CICS.
           GOBACK.
      
       000-99-PRINCIPAL-EXIT.
           EXIT.
      
      *----------------------------------------------------------------*
      *             === ROTINA DE PREPARACAO ===             ACA 10/00 *
      *                                                                *
      *  EFETUA O PROCESSAMENTO LOGICO.                                *
      *----------------------------------------------------------------*
      
       100-00-PROCESSAMENTO-LOGICO           SECTION.
      *----------------------------------------------*
      
           MOVE '100-00-PROCESSAMENTO-LOGICO'  TO  WS35-AUX-TS.

           PERFORM 570-00-RETRIEVE-PARAMETRO.
      
           PERFORM 120-00-DEFINE-IMPRESSORAS.
           
           PERFORM 560-00-ATUALIZA-MONITOR.

           IF WS31-CHV-CANCELADO  NOT EQUAL  SPACES
                GO                          TO 100-99-PROCESSAM-EXIT.

           PERFORM 610-00-GETMAIN-TRSC.

           PERFORM 535-00-ATUALIZA-PWS.

           PERFORM 510-00-RECUPERA-DATA-HORA.

           PERFORM 572-00-SQL-RECUPERA-CNPJ.
           
           PERFORM 505-00-RECUPERA-EMITENTE.
           
           PERFORM 500-00-LE-PROTOCOLO.

           IF WS32-IND-COMANDO  GREATER  ZEROS
                MOVE WS01-DRE-CN-LNH-REL     TO CB0002-DRE-CN-LNH-REL
                PERFORM  546-00-INSERT-DETALHE.
                
           PERFORM 615-00-FREEMAIN-TRSC.

      *    IF WS36-CD-MERC-DST  EQUAL  'E'  AND
      *       WS36-FASE-FTRM  EQUAL  '1'  AND
      *       (ST0001-CD-REGR-FTRM  EQUAL  'G'  OR
      *        ST0001-CD-REGR-FTRM  EQUAL  'F')
      *         PERFORM 875-00-MONTA-LOG-CAPS.

      *    IF WS36-CD-MERC-DST  EQUAL  'E'  AND
      *       WS36-FASE-FTRM  EQUAL  '1'  AND
      *       SF0002-ITD-CD-MOD-TRSP  NOT EQUAL  '4'  AND
      *       SF0002-ITD-CD-MOD-TRSP  NOT EQUAL  '5'  AND
      *       SF0002-ITD-CD-MOD-TRSP  NOT EQUAL  '6'
      *         MOVE '2'                     TO WS36-FASE-FTRM
      *         PERFORM 625-00-START-SF30
      *    ELSE
      *         IF WS36-CD-MERC-DST  EQUAL  'E'  AND
      *            ST0001-CD-REGR-FTRM  NOT EQUAL  'J'
      *              PERFORM 565-00-ATUALIZA-LBRC-IMPS.

           IF WS36-CD-MERC-DST  EQUAL  'E'  AND
              WS36-FASE-FTRM  EQUAL  '1'  AND
              ST0001-CD-REGR-FTRM  NOT EQUAL  'J'  AND
              ST0001-CD-REGR-FTRM  NOT EQUAL  'N'
                MOVE '2'                     TO WS36-FASE-FTRM
                PERFORM 625-00-START-SF30
           ELSE
      *         IF WS36-CD-MERC-DST  EQUAL  'E'  AND
      *            ST0001-CD-REGR-FTRM  NOT EQUAL  'J'
                IF WS36-CD-MERC-DST  EQUAL  'E'
                     PERFORM 565-00-ATUALIZA-LBRC-IMPS
                END-IF.

           IF WS36-CD-MERC-DST  EQUAL  'D'  AND
              WS36-FASE-FTRM  EQUAL  '1'  AND
              SF0005-SFT-IC-NACZ-ICPN-BT  EQUAL  'S'
                PERFORM 573-00-ENTRADA-NF-IC-RIS
                IF SF0005-SFT-CD-T-REC  NOT EQUAL  'OT'
                     MOVE SF0005-SFT-CD-MERC-DST-ORIG
                                             TO WS36-CD-MERC-DST-SF31
                     MOVE SF0005-SFT-DTC-SEL-FTRM-ORIG
                                             TO WS36-DTC-SEL-FTRM-SF31
                     MOVE SF0005-SFT-LGON-FUNC-ORIG
                                             TO WS36-LGON-FUNC-SF31
                     MOVE '1'                TO WS36-FASE-FTRM-SF31
                     PERFORM 645-00-START-SF31
                END-IF.

           PERFORM 537-00-FINALIZA-ITEM-REC-PEND.

           PERFORM 590-00-EMITE-SYNCPOINT.

       100-99-PROCESSAM-EXIT.
           EXIT.
      
      *----------------------------------------------------------------*
      *             === ROTINA DE PREPARACAO ===             ACA 08/00 *
      *                                                                *
      *  PESQUISA SUBSTITUICAO TRIBUTARIA.                             *
      *----------------------------------------------------------------*
      
       110-00-PESQUISA-SUB-TRIB              SECTION.
      *----------------------------------------------*
      
           MOVE '110-00-PESQUISA-SUB-TRIB'   TO  WS35-AUX-TS.

           MOVE ZEROS                        TO WS32-IND-AUX-SUB.

           MOVE CC0002-NBM-CODIGO            TO WS01-CLSF-FSCL-AUX-12.

       110-10-LOOP-BUSCA-SUB.

           ADD 1                             TO WS32-IND-AUX-SUB.
           
           IF WS32-IND-AUX-SUB  GREATER  1
                IF WS32-IND-AUX-SUB  EQUAL  2
                     MOVE SPACES             TO WS01-CLSF-FSCL-AUX-9-10
                END-IF
                IF WS32-IND-AUX-SUB  EQUAL  3
                     MOVE SPACES             TO WS01-CLSF-FSCL-AUX-7-8
                END-IF
                IF WS32-IND-AUX-SUB  EQUAL  4
                     MOVE SPACES             TO WS01-CLSF-FSCL-AUX-5-6
                END-IF
                IF WS32-IND-AUX-SUB  EQUAL  5
                     MOVE SPACES             TO WS01-CLSF-FSCL-AUX-3-4
                END-IF
                IF WS32-IND-AUX-SUB  EQUAL  6
                     MOVE SPACES             TO WS01-CLSF-FSCL-AUX-1-2
                END-IF.

           MOVE WS01-CLSF-FSCL-AUX-12        TO WQ01-CLSF-FSC.

           PERFORM 520-00-RECUPERA-CLAS-FISCAL.
      
           IF WS31-CHV-SUB-OK  EQUAL  'S'
                GO                           TO 110-99-PESQUISA-EXIT.

           IF WS32-IND-AUX-SUB  LESS  6
                GO                           TO 110-10-LOOP-BUSCA-SUB.

       110-99-PESQUISA-EXIT.
           EXIT.
      
      *----------------------------------------------------------------*
      *             === ROTINA DE PREPARACAO ===             ACA 08/00 *
      *                                                                *
      *  DEFINE IMPRESSORAS.                                           *
      *----------------------------------------------------------------*
      
       120-00-DEFINE-IMPRESSORAS             SECTION.
      *----------------------------------------------*
      
           MOVE '120-00-DEFINE-IMPRESSORAS'  TO WS35-AUX-TS.
           
           EXEC SQL SELECT IA.CD_FBR,
                           IA.CD_T_ATND,
                           IA.CD_REGR_DCT,
                           IA.CD_REGR_FTRM
                    INTO   :ST0001-CD-FBR       :WI01-CD-FBR,
                           :ST0001-CD-T-ATND    :WI01-CD-T-ATND,
                           :ST0001-CD-REGR-DCT  :WI01-CD-REGR-DCT,
                           :ST0001-CD-REGR-FTRM :WI01-CD-REGR-FTRM
                    FROM   H1ST.TIPO_RECOLHIMENTO IA
                    WHERE  IA.CD_T_REC = 
                                  (SELECT IB.ITD_CD_T_REC 
                                     FROM H1SF.ITD_ITMFATURADO IB
                                    WHERE IB.ITD_CD_MERC_DST  = 
                                              :WQ02-CD-MERC-DST
                                      AND IB.ITD_DTC_SEL_FTRM = 
                                              :WQ02-DTC-SEL-FTRM
                                      AND IB.ITD_LGON_FUNC    = 
                                              :WQ02-LGON-FUNC
                                      AND ROWNUM              = 1)
                      AND  ROWNUM = 1
                END-EXEC.
                
      *    IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL  OR
      *       WI01-CD-T-ATND    LESS  ZEROS  OR
      *       WI01-CD-REGR-DCT  LESS  ZEROS
      *         MOVE '*** ERRO - DEFINICAO DE IMPRESSORA  ===>'
      *                                      TO WS35-MSG-ERRO-LIT
      *         MOVE WQ02-DTC-SEL-FTRM       TO WS35-MSG-ERRO-VAR
      *         MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
      *         MOVE 'H1SF0033'              TO WS35-ID-PGM
      *         PERFORM 900-00-REGISTRA-ERRO-TRNS.
           
           EXEC SQL SELECT SFT_CD_T_REC,
                           SFT_ID_IMPR_FTRM,
                           SFT_IC_FTRM_TRGD,
                           NVL(SFT_IC_NACZ_ICPN_BT,'N'),
                           SFT_CD_MERC_DST_ORIG,
                           SFT_DTC_SEL_FTRM_ORIG,
                           SFT_LGON_FUNC_ORIG
                    INTO   :SF0005-SFT-CD-T-REC,
                           :SF0005-SFT-ID-IMPR-FTRM
                                          :WI01-SFT-ID-IMPR-FTRM,
                           :SF0005-SFT-IC-FTRM-TRGD
                                          :WI01-SFT-IC-FTRM-TRGD,
                           :SF0005-SFT-IC-NACZ-ICPN-BT
                                          :WI01-SFT-IC-NACZ-ICPN-BT,
                           :SF0005-SFT-CD-MERC-DST-ORIG
                                          :WI01-SFT-CD-MERC-DST-ORIG,
                           :SF0005-SFT-DTC-SEL-FTRM-ORIG
                                          :WI01-SFT-DTC-SEL-FTRM-ORIG,
                           :SF0005-SFT-LGON-FUNC-ORIG
                                          :WI01-SFT-LGON-FUNC-ORIG
                    FROM   H1SF.SFT_SELECAO_FTRM 
                    WHERE  SFT_CD_MERC_DST  = :WQ02-CD-MERC-DST
                    AND    SFT_DTC_SEL_FTRM = :WQ02-DTC-SEL-FTRM
                    AND    SFT_LGON_FUNC    = :WQ02-LGON-FUNC
                    AND    ROWNUM           = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL  OR
              WI01-SFT-ID-IMPR-FTRM  LESS  ZEROS
                MOVE '*** ERRO - DEFINICAO DE IMPRESSORA  ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WQ02-DTC-SEL-FTRM       TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.               

       120-10-SELECIONA-IMPR.

      *    EXEC SQL SELECT NM_IMPR_AIX
      *             INTO   :CB0003-NM-IMPR-AIX
      *             FROM   H1CB.IMPRESSORA
      *             WHERE  CD_T_OPRC   =  :ST0001-CD-T-ATND
      *               AND  CD_RGR_DCT  =  :ST0001-CD-REGR-DCT
      *               AND  ROWNUM = 1
      *         END-EXEC.
      
           EXEC SQL SELECT NM_IMPR_AIX
                    INTO   :CB0003-NM-IMPR-AIX
                    FROM   H1CB.IMPRESSORA
                    WHERE  ID_IMPR     = :SF0005-SFT-ID-IMPR-FTRM
                      AND  ROWNUM = 1
                END-EXEC.      

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - IMPRESSORA INEXISTENTE  ===>'
                                             TO WS35-MSG-ERRO-LIT
      *         MOVE ST0001-CD-T-ATND        TO WS35-MSG-ERRO-VAR
                MOVE SF0005-SFT-ID-IMPR-FTRM TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.               

           MOVE CB0003-NM-IMPR-AIX           TO WS01-IMPRESSORA-LASER.

       120-99-DEFINE-EXIT.
           EXIT.
       
      *----------------------------------------------------------------*
      *             === ROTINA DE PREPARACAO ===             ACA 08/00 *
      *                                                                *
      *  DEFINE ORIENTACAO PJL.                                        *
      *----------------------------------------------------------------*
      
       130-00-DEFINE-PJL-OUTBIN-S            SECTION.
      *----------------------------------------------*
      
           MOVE '130-00-DEFINE-PJL-OUTBIN-S' TO WS35-AUX-TS.

           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.

           MOVE 2                            TO WS01-ID-VIA-AUX.

       130-10-DEFINE-PJL-OUTBIN1.

           MOVE 'E%-12345X@PJL SET '       TO WS01-PJL-SET-AUX. 
           MOVE '   OUTBIN=OPTIONALOUTBIN1'  TO WS01-PJL-CMD-AUX.
           MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.
           MOVE '98'                         TO CB0001-RRE-CD-SQN-PJL.
           MOVE '98'                         TO CB0002-DRE-CD-SQN-PJL.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       130-99-DEFINE-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE PREPARACAO ===             EFJ 04/20 *
      *                                                                *
      *  DEFINE ORIENTACAO PJL.                                        *
      *----------------------------------------------------------------*
      
       135-00-DEFINE-PJL-OUTBIN-S            SECTION.
      *----------------------------------------------*
      
           MOVE '135-00-DEFINE-PJL-OUTBIN-S' TO WS35-AUX-TS.

           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.

           MOVE 2                            TO WS01-ID-VIA-AUX.

       135-10-DEFINE-PJL-OUTBIN2.

           MOVE 'E%-12345X@PJL SET '       TO WS01-PJL-SET-AUX. 
           MOVE '            FINISH=STAPLE'  TO WS01-PJL-CMD-AUX.
           MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.
           MOVE '95'                         TO CB0001-RRE-CD-SQN-PJL.
           MOVE '95'                         TO CB0002-DRE-CD-SQN-PJL.
           MOVE 2                            TO WS01-ID-VIA-AUX.
           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX. 
           MOVE '         STAPLEOPTION=ONE'  TO WS01-PJL-CMD-AUX.
           MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.
           MOVE '95'                         TO CB0001-RRE-CD-SQN-PJL.
           MOVE '95'                         TO CB0002-DRE-CD-SQN-PJL.
           MOVE 2                            TO WS01-ID-VIA-AUX.
           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX. 
           MOVE '    ORIENTATION=LANDSCAPE'  TO WS01-PJL-CMD-AUX.
           MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.
           MOVE '95'                         TO CB0001-RRE-CD-SQN-PJL.
           MOVE '95'                         TO CB0002-DRE-CD-SQN-PJL.
           MOVE 2                            TO WS01-ID-VIA-AUX.
           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX. 
           MOVE '   OUTBIN=OPTIONALOUTBIN2'  TO WS01-PJL-CMD-AUX.
           MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.
           MOVE '95'                         TO CB0001-RRE-CD-SQN-PJL.
           MOVE '95'                         TO CB0002-DRE-CD-SQN-PJL.
           MOVE 2                            TO WS01-ID-VIA-AUX.
           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       135-99-DEFINE-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE PREPARACAO ===             ACA 08/00 *
      *                                                                *
      *  DEFINE ORIENTACAO PJL.                                        *
      *----------------------------------------------------------------*
      
       140-00-DEFINE-PJL-OUTBIN-P            SECTION.
      *----------------------------------------------*
      
           MOVE '140-00-DEFINE-PJL-OUTBIN-P' TO WS35-AUX-TS.

           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.

           IF ST0001-CD-REGR-FTRM  NOT EQUAL  'M'  AND
              ST0001-CD-REGR-FTRM  NOT EQUAL  'K'  AND
              CB0004-CD-T-PRD  NOT EQUAL  'C'  AND
              WS36-CD-MERC-DST  NOT EQUAL  'E'
                MOVE 'PROTOCOL'              TO 
                                             CB0002-DRE-ID-PRCP-PTD-LIT
           ELSE
                MOVE SPACES                  TO 
                                             CB0002-DRE-ID-PRCP-PTD-LIT.

           PERFORM 170-00-DEFINE-VIAS-ORDENACAO.
                                             
       140-10-DEF-PJL-OUTBIN2.

           MOVE WS01-CD-SQN-PJL-PTD          TO WS01-CD-SQN-PJL-AUX.

           IF WS36-CD-MERC-DST  EQUAL  'E'
                IF WS36-FASE-FTRM  EQUAL  '2'  OR
                   SF0002-ITD-CD-MOD-TRSP  EQUAL  '1'  OR
                   SF0002-ITD-CD-MOD-TRSP  EQUAL  '2'  OR
                   SF0002-ITD-CD-MOD-TRSP  EQUAL  '3'  OR
                   SF0002-ITD-CD-MOD-TRSP  EQUAL  '4'  OR
                   SF0002-ITD-CD-MOD-TRSP  EQUAL  '5'
                     MOVE CB0002-DRE-ID-PRCP TO
                                             WQ01-DOF-IMPOR-PROTOCOLO
                     MOVE SPACES             TO
                                             CB0002-DRE-ID-PRCP-PTD-LIT
                     GO                      TO 140-99-DEFINE-EXIT
                END-IF
                IF SF0002-ITD-CD-MOD-TRSP  EQUAL  '6'
                     MOVE WS01-CD-SQN-PJL-NF TO WS01-CD-SQN-PJL-AUX
                END-IF.

           MOVE 'E%-12345X@PJL SET '       TO WS01-PJL-SET-AUX. 
           MOVE '            FINISH=STAPLE'  TO WS01-PJL-CMD-AUX.
           MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.
           MOVE '00'                         TO CB0001-RRE-CD-SQN-PJL.
           MOVE '00'                         TO CB0002-DRE-CD-SQN-PJL.
           MOVE 1                            TO WS01-ID-VIA-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX. 
      *    MOVE '   STAPLEOPTION=ONEANGLED' 
           MOVE '         STAPLEOPTION=ONE'  TO WS01-PJL-CMD-AUX.
           MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.
           MOVE '00'                         TO CB0001-RRE-CD-SQN-PJL.
           MOVE '00'                         TO CB0002-DRE-CD-SQN-PJL.
           MOVE 1                            TO WS01-ID-VIA-AUX.
           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       140-20-DEF-PJL-OUTBIN2.

           MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX. 
           MOVE '    ORIENTATION=LANDSCAPE'  TO WS01-PJL-CMD-AUX.
           MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-CD-SQN-PJL-AUX          TO CB0001-RRE-CD-SQN-PJL.
           MOVE WS01-CD-SQN-PJL-AUX          TO CB0002-DRE-CD-SQN-PJL.
           MOVE 1                            TO WS01-ID-VIA-AUX.
           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX. 
           MOVE '   OUTBIN=OPTIONALOUTBIN2'  TO WS01-PJL-CMD-AUX.
           MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-CD-SQN-PJL-AUX          TO CB0001-RRE-CD-SQN-PJL.
           MOVE WS01-CD-SQN-PJL-AUX          TO CB0002-DRE-CD-SQN-PJL.
           MOVE 1                            TO WS01-ID-VIA-AUX.
           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE CB0002-DRE-ID-PRCP           TO
                                             WQ01-DOF-IMPOR-PROTOCOLO.

           MOVE SPACES                       TO 
                                             CB0002-DRE-ID-PRCP-PTD-LIT.      

       140-99-DEFINE-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE PREPARACAO ===             EFJ 06/06 *
      *                                                                *
      *  DEFINE ORIENTACAO PJL.                                        *
      *----------------------------------------------------------------*
      
       145-00-DEFINE-PJL-OUTBIN-P            SECTION.
      *----------------------------------------------*
      
           MOVE '145-00-DEFINE-PJL-OUTBIN-P' TO WS35-AUX-TS.

           MOVE 'PACKLIST'                   TO 
                                             CB0002-DRE-ID-PRCP-PTD-LIT.

           PERFORM 170-00-DEFINE-VIAS-ORDENACAO.

       145-10-DEFINE-PJL-OUTBIN2-V1.

           IF WS01-QTDE-VIA-PCK-LIST  NOT GREATER  ZEROS
                GO                           TO 145-90-FINALIZA-PARMS.

           IF WS36-CD-MERC-DST  EQUAL  'E'  AND
              SF0002-ITD-CD-MOD-TRSP  EQUAL  '6'
                MOVE 99                      TO WS01-ID-VIA-AUX
                GO                           TO 145-99-DEFINE-EXIT
           ELSE
                MOVE 1                       TO WS01-ID-VIA-AUX.

           MOVE 'E%-12345X@PJL SET '       TO WS01-PJL-SET-AUX. 
           MOVE '            FINISH=STAPLE'  TO WS01-PJL-CMD-AUX.
           MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0001-RRE-CD-SQN-PJL.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX. 
      *    MOVE '   STAPLEOPTION=ONEANGLED' 
           MOVE '         STAPLEOPTION=ONE'  TO WS01-PJL-CMD-AUX.
           MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0001-RRE-CD-SQN-PJL.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX. 
           MOVE '    ORIENTATION=LANDSCAPE'  TO WS01-PJL-CMD-AUX.
           MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0001-RRE-CD-SQN-PJL.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX. 
           MOVE '   OUTBIN=OPTIONALOUTBIN2'  TO WS01-PJL-CMD-AUX.
           MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0001-RRE-CD-SQN-PJL.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
       145-20-DEFINE-PJL-OUTBIN2-V2.

           IF WS01-QTDE-VIA-PCK-LIST  NOT GREATER  1  OR
              (WS36-CD-MERC-DST  EQUAL  'E'  AND
               (SF0002-ITD-CD-MOD-TRSP  EQUAL  '4'  OR
                SF0002-ITD-CD-MOD-TRSP  EQUAL  '5'))
                GO                           TO 145-90-FINALIZA-PARMS.

           IF WS36-CD-MERC-DST  EQUAL  'E'  AND
              (SF0002-ITD-CD-MOD-TRSP  EQUAL  '1'  OR
               SF0002-ITD-CD-MOD-TRSP  EQUAL  '2'  OR
               SF0002-ITD-CD-MOD-TRSP  EQUAL  '3')
                MOVE 20                      TO WS01-IND-PJL-PKLST-AUX
           ELSE
                MOVE 2                       TO WS01-IND-PJL-PKLST-AUX.

           ADD WS01-IND-PJL-PKLST-AUX        TO WS01-CD-SQN-PJL-PKLST-N.

           MOVE 'E%-12345X@PJL SET '       TO WS01-PJL-SET-AUX. 
           MOVE '            FINISH=STAPLE'  TO WS01-PJL-CMD-AUX.
           MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0001-RRE-CD-SQN-PJL.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
           MOVE 2                            TO WS01-ID-VIA-AUX.
           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX. 
      *    MOVE '   STAPLEOPTION=ONEANGLED' 
           MOVE '         STAPLEOPTION=ONE'  TO WS01-PJL-CMD-AUX.
           MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0001-RRE-CD-SQN-PJL.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
           MOVE 2                            TO WS01-ID-VIA-AUX.
           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX. 
           MOVE '    ORIENTATION=LANDSCAPE'  TO WS01-PJL-CMD-AUX.
           MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0001-RRE-CD-SQN-PJL.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
           MOVE 2                            TO WS01-ID-VIA-AUX.
           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX. 
           MOVE '   OUTBIN=OPTIONALOUTBIN2'  TO WS01-PJL-CMD-AUX.
           MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0001-RRE-CD-SQN-PJL.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
           MOVE 2                            TO WS01-ID-VIA-AUX.
           MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.
           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.
           PERFORM 545-00-GRAVA-DETALHE-REL.


           SUBTRACT WS01-IND-PJL-PKLST-AUX   FROM
                                                WS01-CD-SQN-PJL-PKLST-N.

      *145-30-DEFINE-PJL-OUTBIN2-V3.                                    
      *                                                                 
      *    IF WS01-QTDE-VIA-PCK-LIST  NOT GREATER  2                    
      *         GO                           TO 145-90-FINALIZA-PARMS.  
      *                                                                 
      *    ADD 4                             TO WS01-CD-SQN-PJL-PKLST-N.
      *                                                                 
      *    MOVE 'E%-12345X@PJL SET '       TO WS01-PJL-SET-AUX.       
      *    MOVE '            FINISH=STAPLE'  TO WS01-PJL-CMD-AUX.       
      *    MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.  
      *    MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.  
      *    MOVE WS01-CD-SQN-PJL-PKLST        TO CB0001-RRE-CD-SQN-PJL.  
      *    MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
      *    MOVE 3                            TO WS01-ID-VIA-AUX.
      *    MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.   
      *    MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.   
      *    PERFORM 545-00-GRAVA-DETALHE-REL.                            
      *                                                                 
      *    MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX.       
      *    MOVE '   STAPLEOPTION=ONEANGLED'                             
      *    MOVE '         STAPLEOPTION=ONE'  TO WS01-PJL-CMD-AUX.       
      *    MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.  
      *    MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.  
      *    MOVE WS01-CD-SQN-PJL-PKLST        TO CB0001-RRE-CD-SQN-PJL.  
      *    MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
      *    MOVE 3                            TO WS01-ID-VIA-AUX.
      *    MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.   
      *    MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.   
      *    PERFORM 545-00-GRAVA-DETALHE-REL.                            
      *                                                                 
      *    MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX.       
      *    MOVE '    ORIENTATION=LANDSCAPE'  TO WS01-PJL-CMD-AUX.       
      *    MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.  
      *    MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.  
      *    MOVE WS01-CD-SQN-PJL-PKLST        TO CB0001-RRE-CD-SQN-PJL.  
      *    MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
      *    MOVE 3                            TO WS01-ID-VIA-AUX.
      *    MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.   
      *    MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.   
      *    PERFORM 545-00-GRAVA-DETALHE-REL.                            
      *                                                                 
      *    MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX.       
      *    MOVE '   OUTBIN=OPTIONALOUTBIN2'  TO WS01-PJL-CMD-AUX.       
      *    MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.  
      *    MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.  
      *    MOVE WS01-CD-SQN-PJL-PKLST        TO CB0001-RRE-CD-SQN-PJL.  
      *    MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
      *    MOVE 3                            TO WS01-ID-VIA-AUX.
      *    MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.   
      *    MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.   
      *    PERFORM 545-00-GRAVA-DETALHE-REL.                            
      *                                                                 
      *    SUBTRACT 4                        FROM                       
      *                                         WS01-CD-SQN-PJL-PKLST-N.
      *145-40-DEFINE-PJL-OUTBIN2-V4.                                    
      *                                                                 
      *    IF WS01-QTDE-VIA-PCK-LIST  NOT GREATER  3                    
      *         GO                           TO 145-90-FINALIZA-PARMS.  
      *                                                                 
      *    ADD 6                             TO WS01-CD-SQN-PJL-PKLST-N.
      *                                                                 
      *    MOVE 'E%-12345X@PJL SET '       TO WS01-PJL-SET-AUX.       
      *    MOVE '            FINISH=STAPLE'  TO WS01-PJL-CMD-AUX.       
      *    MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.  
      *    MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.  
      *    MOVE WS01-CD-SQN-PJL-PKLST        TO CB0001-RRE-CD-SQN-PJL.  
      *    MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
      *    MOVE 4                            TO WS01-ID-VIA-AUX.
      *    MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.   
      *    MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.   
      *    PERFORM 545-00-GRAVA-DETALHE-REL.                            
      *                                                                 
      *    MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX.       
      *    MOVE '   STAPLEOPTION=ONEANGLED'                             
      *    MOVE '         STAPLEOPTION=ONE'  TO WS01-PJL-CMD-AUX.       
      *    MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.  
      *    MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.  
      *    MOVE WS01-CD-SQN-PJL-PKLST        TO CB0001-RRE-CD-SQN-PJL.  
      *    MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
      *    MOVE 4                            TO WS01-ID-VIA-AUX.
      *    MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.   
      *    MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.   
      *    PERFORM 545-00-GRAVA-DETALHE-REL.                            
      *                                                                 
      *    MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX.       
      *    MOVE '    ORIENTATION=LANDSCAPE'  TO WS01-PJL-CMD-AUX.       
      *    MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.  
      *    MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.  
      *    MOVE WS01-CD-SQN-PJL-PKLST        TO CB0001-RRE-CD-SQN-PJL.  
      *    MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
      *    MOVE 4                            TO WS01-ID-VIA-AUX.
      *    MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.   
      *    MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.   
      *    PERFORM 545-00-GRAVA-DETALHE-REL.                            
      *                                                                 
      *    MOVE '@PJL SET            '       TO WS01-PJL-SET-AUX.       
      *    MOVE '   OUTBIN=OPTIONALOUTBIN2'  TO WS01-PJL-CMD-AUX.       
      *    MOVE SPACES                       TO CB0002-DRE-CN-LNH-REL.  
      *    MOVE WS01-PJL-AUX                 TO CB0002-DRE-CN-LNH-REL.  
      *    MOVE WS01-CD-SQN-PJL-PKLST        TO CB0001-RRE-CD-SQN-PJL.  
      *    MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
      *    MOVE 4                            TO WS01-ID-VIA-AUX.
      *    MOVE 'S'                          TO WS31-CHV-COMANDO-PJL.   
      *    MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.   
      *    PERFORM 545-00-GRAVA-DETALHE-REL.                            
      *                                                                 
      *    SUBTRACT 6                        FROM                       
      *                                         WS01-CD-SQN-PJL-PKLST-N.

       145-90-FINALIZA-PARMS.

           MOVE SPACES                       TO 
                                             CB0002-DRE-ID-PRCP-PTD-LIT.      

       145-99-DEFINE-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE PREPARACAO ===             ACA 08/00 *
      *                                                                *
      *  PESQUISA INCENTIVO FISCAL.                                    *
      *----------------------------------------------------------------*
      
       150-00-PESQUISA-INCENTIVO             SECTION.
      *----------------------------------------------*
      
           MOVE '150-00-PESQUISA-INCENTIVO'  TO  WS35-AUX-TS.

      *    MOVE ZEROS                        TO WS32-IND-AUX-INC.
      *
      *    MOVE CC0002-NBM-CODIGO            TO WS01-CLSF-FSCL-AUX-12.
      *
      *150-10-LOOP-BUSCA-INC.
      *
      *    ADD 1                             TO WS32-IND-AUX-INC.
      *    
      *    IF WS32-IND-AUX-INC  GREATER  1
      *         IF WS32-IND-AUX-INC  EQUAL  2
      *              MOVE SPACES             TO WS01-CLSF-FSCL-AUX-9-10
      *         END-IF
      *         IF WS32-IND-AUX-INC  EQUAL  3
      *              MOVE SPACES             TO WS01-CLSF-FSCL-AUX-7-8
      *         END-IF
      *         IF WS32-IND-AUX-INC  EQUAL  4
      *              MOVE SPACES             TO WS01-CLSF-FSCL-AUX-5-6
      *         END-IF
      *         IF WS32-IND-AUX-INC  EQUAL  5
      *              MOVE SPACES             TO WS01-CLSF-FSCL-AUX-3-4
      *         END-IF
      *         IF WS32-IND-AUX-INC  EQUAL  6
      *              MOVE SPACES             TO WS01-CLSF-FSCL-AUX-1-2
      *         END-IF.
      *
      *    MOVE WS01-CLSF-FSCL-AUX-12        TO WQ01-CLSF-FSC.
      *
           PERFORM 525-00-RECUPERA-CLAS-INCENTIVO.
      *
      *    IF WS31-CHV-INC-OK  EQUAL  'S'
      *         GO                           TO 150-99-PESQUISA-EXIT.
      *
      *    IF WS32-IND-AUX-INC  LESS  6
      *         GO                           TO 150-10-LOOP-BUSCA-INC.

       150-99-PESQUISA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *              === ROTINA DE PREPARACAO ===            PFN 03/20 *
      *                                                                *
      *  VERIFICA SE A PECA EH REMAN OU NAO.                           *
      *----------------------------------------------------------------*
       
       160-00-VERIFICA-SE-PECA-REMAN         SECTION.
      *----------------------------------------------*
      
           MOVE '160-00-VERIFICA-SE-PECA-REMAN'
                                             TO  WS35-AUX-TS.

           PERFORM 581-00-EMITE-LINK-H1CB5035.
           IF ACB5035-CD-RTOR-ERRO  EQUAL  ZEROS
                GO                           TO 160-99-VER-REMAN-EXIT.
           
           MOVE '*** ERRO - SUBROTINA H1CB5035  ===>'
                                             TO WS35-MSG-ERRO-LIT.
           MOVE ACB5035-CD-RTOR-ERRO         TO WS35-MSG-ERRO-VAR.
           MOVE WS35-MSG-ERRO                TO ACB5010-MSG-ERRO.
           MOVE 'H1SF0033'                   TO WS35-ID-PGM.
           PERFORM 900-00-REGISTRA-ERRO-TRNS.               

       160-99-VER-REMAN-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE PREPARACAO ===             EFJ 05/19 *
      *                                                                *
      *  DEFINE VIAS E ORDENACAO DOS RELATORIOS.                       *
      *----------------------------------------------------------------*
      
       170-00-DEFINE-VIAS-ORDENACAO          SECTION.
      *----------------------------------------------*

           MOVE '170-00-DEFINE-VIAS-ORDENACAO'
                                             TO  WS35-AUX-TS.

           IF CB0004-CD-T-PRD  EQUAL  'F'
                MOVE 1                       TO WS01-QTDE-VIA-PTD
           ELSE
                MOVE 3                       TO WS01-QTDE-VIA-PTD.

           IF WS36-CD-MERC-DST  EQUAL  'E'
                MOVE 2                       TO WS01-QTDE-VIA-PCK-LIST
                MOVE '10'                    TO WS01-CD-SQN-PJL-PTD
                MOVE '30'                    TO WS01-CD-SQN-PJL-NF
                MOVE '50'                    TO WS01-CD-SQN-PJL-PKLST
                IF SF0002-ITD-CD-MOD-TRSP  EQUAL  '4'  OR
                   SF0002-ITD-CD-MOD-TRSP  EQUAL  '5'
                     MOVE 1                  TO WS01-QTDE-VIA-PCK-LIST
                     MOVE '20'               TO WS01-CD-SQN-PJL-PTD
                     MOVE '30'               TO WS01-CD-SQN-PJL-NF
                     MOVE '10'               TO WS01-CD-SQN-PJL-PKLST
                END-IF
                IF SF0002-ITD-CD-MOD-TRSP  EQUAL  '6'
                     MOVE 1                  TO WS01-QTDE-VIA-PCK-LIST
                     MOVE '30'               TO WS01-CD-SQN-PJL-PTD
                     MOVE '20'               TO WS01-CD-SQN-PJL-NF
                     MOVE '10'               TO WS01-CD-SQN-PJL-PKLST
                END-IF
                IF SF0002-ITD-CD-MOD-TRSP  EQUAL  '1'  OR
                   SF0002-ITD-CD-MOD-TRSP  EQUAL  '2'  OR
                   SF0002-ITD-CD-MOD-TRSP  EQUAL  '3'
                     MOVE '40'               TO WS01-CD-SQN-PJL-PTD
                     MOVE '20'               TO WS01-CD-SQN-PJL-NF
                     MOVE '10'               TO WS01-CD-SQN-PJL-PKLST
                END-IF
           ELSE
                MOVE ZEROS                   TO WS01-QTDE-VIA-PCK-LIST
                MOVE '10'                    TO WS01-CD-SQN-PJL-PTD
                MOVE '30'                    TO WS01-CD-SQN-PJL-NF
                MOVE '50'                    TO WS01-CD-SQN-PJL-PKLST.

           MOVE '05'                         TO WS01-CD-SQN-PJL-INST.
                
       170-99-DEFINE-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE PREPARACAO ===             EFJ 06/19 *
      *                                                                *
      *  DEFINE NUMERO DA VIA DE IMPRESSAO.                            *
      *----------------------------------------------------------------*
      
       180-00-DEFINE-VIA-IMPRESS             SECTION.
      *----------------------------------------------*

           MOVE '180-00-DEFINE-VIA-IMPRESS'  TO  WS35-AUX-TS.

           MOVE 2                            TO WS01-ID-VIA-AUX.

           IF WS36-CD-MERC-DST  EQUAL  'E'
                IF CB0002-DRE-CD-SQN-PJL  EQUAL  '00'
                     MOVE 1                  TO WS01-ID-VIA-AUX
                END-IF
                IF CB0002-DRE-CD-SQN-PJL  EQUAL '00' OR '10' OR '20'
                                             OR '30' OR '50' OR  '51'
                     MOVE 1                  TO WS01-ID-VIA-AUX
                END-IF
                IF CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'INSTRUCA'
                     MOVE 1                  TO WS01-ID-VIA-AUX
                     GO                      TO 180-99-DEFINE-EXIT
                END-IF
                IF (SF0002-ITD-CD-MOD-TRSP  EQUAL  '4'  OR  '5')  AND
                   (CB0002-DRE-CD-SQN-PJL  EQUAL  '10' OR '11' OR '20'
                                              OR  '30')
                     MOVE 1                  TO WS01-ID-VIA-AUX
                     GO                      TO 180-99-DEFINE-EXIT
                END-IF
                IF SF0002-ITD-CD-MOD-TRSP  EQUAL  '6'  AND
                   (CB0002-DRE-CD-SQN-PJL  EQUAL  '20' OR '30')
                     MOVE 1                  TO WS01-ID-VIA-AUX
                     GO                      TO 180-99-DEFINE-EXIT
                END-IF
                IF SF0002-ITD-CD-MOD-TRSP  EQUAL  '6'  AND
                   (CB0002-DRE-CD-SQN-PJL  EQUAL  '10' OR  '11')
                     MOVE 99                 TO WS01-ID-VIA-AUX
                     GO                      TO 180-99-DEFINE-EXIT
                END-IF
                IF (SF0002-ITD-CD-MOD-TRSP  EQUAL  '1'  OR  '2'
                                                        OR  '3')  AND
                   (CB0002-DRE-CD-SQN-PJL  EQUAL  '10' OR '11' OR '20'
                                              OR  '40')
                     MOVE 1                  TO WS01-ID-VIA-AUX
                     GO                      TO 180-99-DEFINE-EXIT
                END-IF
           ELSE
                IF (CB0002-DRE-CD-SQN-PJL  EQUAL '00' OR '10' OR '30'
                                              OR '50' OR  '51')  OR
                   CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'INSTRUCA'
                     MOVE 1                  TO WS01-ID-VIA-AUX
                     GO                      TO 180-99-DEFINE-EXIT
                END-IF.

      *    IF WS36-CD-MERC-DST  EQUAL  'E'
      *         IF (CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  SPACES  AND
      *             CB0002-DRE-CD-SQN-PJL  EQUAL  '30')  OR
      *            (CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'PROTOCOL'  AND
      *             CB0002-DRE-CD-SQN-PJL  EQUAL  '10')  OR
      *            (CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'PACKLIST'  AND
      *             (CB0002-DRE-CD-SQN-PJL  EQUAL  '50'  OR  '51'))  OR
      *            CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'INSTRUCA'
      *              MOVE 1                  TO WS01-ID-VIA-AUX
      *         END-IF
      *         IF (SF0002-ITD-CD-MOD-TRSP  EQUAL  '4'  OR  '5')  AND
      *             ((CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  SPACES  AND
      *               CB0002-DRE-CD-SQN-PJL  EQUAL  '30')  OR
      *              (CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'PROTOCOL'  AND
      *               CB0002-DRE-CD-SQN-PJL  EQUAL  '20')  OR
      *              (CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'PACKLIST'  AND
      *               (CB0002-DRE-CD-SQN-PJL  EQUAL  '10'  OR  '11')) OR
      *              CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'INSTRUCA')
      *              MOVE 1                  TO WS01-ID-VIA-AUX
      *              GO                      TO 180-99-DEFINE-EXIT
      *         END-IF
      *         IF SF0002-ITD-CD-MOD-TRSP  EQUAL  '6'  AND
      *             ((CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  SPACES  AND
      *               CB0002-DRE-CD-SQN-PJL  EQUAL  '10')  OR
      *              (CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'PROTOCOL'  AND
      *               CB0002-DRE-CD-SQN-PJL  EQUAL  '20')  OR
      *              (CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'PACKLIST'  AND
      *               (CB0002-DRE-CD-SQN-PJL  EQUAL  '50'  OR  '51')) OR
      *              CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'INSTRUCA')
      *              MOVE 1                  TO WS01-ID-VIA-AUX
      *              GO                      TO 180-99-DEFINE-EXIT
      *         END-IF                     
      *         IF (SF0002-ITD-CD-MOD-TRSP  EQUAL  '1'  OR  '2'
      *                                                 OR  '3')  AND
      *             ((CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  SPACES  AND
      *               CB0002-DRE-CD-SQN-PJL  EQUAL  '20')  OR
      *              (CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'PROTOCOL'  AND
      *               CB0002-DRE-CD-SQN-PJL  EQUAL  '40')  OR
      *              (CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'PACKLIST'  AND
      *               (CB0002-DRE-CD-SQN-PJL  EQUAL  '10'  OR  '11')) OR
      *              CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'INSTRUCA')
      *              MOVE 1                  TO WS01-ID-VIA-AUX
      *              GO                      TO 180-99-DEFINE-EXIT
      *         END-IF
      *    ELSE
      *         IF (CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  SPACES  AND
      *             CB0002-DRE-CD-SQN-PJL  EQUAL  '30')  OR
      *            (CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'PROTOCOL'  AND
      *             CB0002-DRE-CD-SQN-PJL  EQUAL  '10')  OR
      *            (CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'PACKLIST'  AND
      *             (CB0002-DRE-CD-SQN-PJL  EQUAL  '50'  OR  '51'))  OR
      *            CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'INSTRUCA'
      *              MOVE 1                  TO WS01-ID-VIA-AUX
      *              GO                      TO 180-99-DEFINE-EXIT
      *         END-IF.
                
       180-99-DEFINE-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 10/00 *
      *                                                                *
      *  EFETUA SQL PARA RECUPERAR PROTOCOLOS.                         *
      *----------------------------------------------------------------*
      
       500-00-LE-PROTOCOLO                   SECTION.
      *----------------------------------------------*      

           MOVE '500-00-LE-PROTOCOLO'        TO WS35-AUX-TS.
                
           PERFORM 700-00-TRATA-PROTOCOLO.
      
       500-99-LE-SELECAO-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               EFJ 03/09 *
      *                                                                *
      *  EFETUA SQL PARA RECUPERAR DADOS DO EMITENTE.                  *
      *----------------------------------------------------------------*
      
       505-00-RECUPERA-EMITENTE              SECTION.
      *----------------------------------------------*      

           MOVE '505-00-RECUPERA-EMITENTE'   TO  WS35-AUX-TS.
           
           MOVE CB0004-ID-CNPJ              TO WQ01-EMITENTE-PFJ-CODIGO.
           MOVE '1'                         TO WQ01-EMITENTE-LOC-CODIGO.
                
           EXEC SQL AT CCPR
                    SELECT A.MNEMONICO,
                           INITCAP(A.MNEMONICO),
                           B.LOGRADOURO ||
                           DECODE(B.NUMERO, '', '', ', ' || B.NUMERO),
                           B.LOGRADOURO ||
                           DECODE(B.NUMERO, '', '', ', ' || B.NUMERO),
                           B.LOGRADOURO ||
                           DECODE(B.NUMERO, '', '', ', ' || B.NUMERO),
                           B.BAIRRO,
                           B.BAIRRO || ', ' ||
                           B.CEP,
                           DECODE(B.BAIRRO, '', '', B.BAIRRO || ', ') ||
                           B.MUNICIPIO || ', ' ||
                           C.UF_CODIGO,
                           DECODE(B.BAIRRO, '', '', B.BAIRRO || ', ') ||
                           B.MUNICIPIO || ', ' ||
                           C.UF_CODIGO,
                           B.CEP,
                           B.MUNICIPIO || ', ' ||
                           C.UF_CODIGO,
                           C.UF_CODIGO,
                           'CGC: ' || D.CPF_CGC,
                           'Insc. Estadual: ' || B.INSCR_ESTADUAL,
                           D.CPF_CGC,
                           B.INSCR_ESTADUAL,
                           'CGC: ' || D.CPF_CGC || ' / ' ||
                           'Insc. Estadual: ' || B.INSCR_ESTADUAL,
                           B.COMPLEMENTO
                    INTO   :CC0008-RAZAO-SOCIAL-E,
                           :CC0008-RAZAO-SOCIAL-EPM,
                           :CC0008-ENDERECO-ED,
                           :CC0008-ENDERECO-EP,
                           :CC0008-ENDERECO-EI,
                           :CC0008-BAIRRO-EP,
                           :CC0008-BAIRRO-CEP-ED,
                           :CC0008-BAIRRO-MUN-NOME-UF-EP,
                           :CC0008-BAIRRO-MUN-NOME-UF-EI,
                           :CC0008-CEP-E,
                           :CC0008-MUN-NOME-UF-E,
                           :CC0008-UF-E,
                           :CC0008-CPF-CGC-E        :WI01-CPF-CGC,
                           :CC0008-INSCR-ESTADUAL-E
                                                   :WI01-INSCR-ESTADUAL,
                           :CC0008-CPF-CGC         :WI01-CPF-CGC,
                           :CC0008-INSCR-ESTADUAL  :WI01-INSCR-ESTADUAL,
                           :CC0008-CPF-CGC-INSCR-EST-EI
                                             :WI01-CPF-CGC-INSCR-EST-EI,
                           :CC0008-COMPLEMENTO :WI01-COMPLEMENTO
                    FROM   B8CC.COR_PESSOA A,
                           B8CC.COR_LOCALIDADE_VIGENCIA B,
                           B8CC.COR_MUNICIPIO C,
                           B8CC.COR_PESSOA_VIGENCIA D
                    WHERE  A.PFJ_CODIGO = B.PFJ_CODIGO
                    AND    B.MUN_CODIGO = C.MUN_CODIGO
                    AND    A.PFJ_CODIGO = D.PFJ_CODIGO
                    AND    B.DT_INICIO <= SYSDATE
                    AND    (B.DT_FIM   >= SYSDATE
                    OR      B.DT_FIM   IS NULL)
                    AND    D.DT_INICIO <= SYSDATE
                    AND    (D.DT_FIM   >= SYSDATE
                    OR      D.DT_FIM   IS NULL)
                    AND    A.PFJ_CODIGO = :WQ01-EMITENTE-PFJ-CODIGO
                    AND    B.LOC_CODIGO = :WQ01-EMITENTE-LOC-CODIGO
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - EMITENTE NAO ENCONTRADO  ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WQ01-EMITENTE-PFJ-CODIGO
                                             TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.               

       505-99-RECUPERA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 10/00 *
      *                                                                *
      *  EFETUA SQL PARA RECUPERAR DATA E HORA.                        *
      *----------------------------------------------------------------*
      
       510-00-RECUPERA-DATA-HORA             SECTION.
      *----------------------------------------------*      

           MOVE '510-00-RECUPERA-DATA-HORA'  TO  WS35-AUX-TS.
                
           EXEC SQL SELECT TO_CHAR(SYSDATE,'YYYYMMDDHH24MISS')
                    INTO   :CB0001-RRE-DTC-GRC
                    FROM   DUAL
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - TABELA DUAL SEM REGISTRO  ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE SPACES                  TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.               

       510-99-RECUPERA-EXIT.
           EXIT.
      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 08/00 *
      *                                                                *
      *  EFETUA SQL PARA RECUPERAR CLASSIFICACAO FISCAL.               *
      *----------------------------------------------------------------*
      
       520-00-RECUPERA-CLAS-FISCAL           SECTION.
      *----------------------------------------------*      

           MOVE '520-00-RECUPERA-CLAS-FISCAL'  TO  WS35-AUX-TS.

           EXEC SQL SELECT 1
                    FROM   H1SF.FIS_CLSFISCAL
                    WHERE  FIS_CLSF_FSC = :WQ01-CLSF-FSC     AND
                           FIS_CD_UF    = :CC0004-UF-CODIGO  AND
                           FIS_RATE_RDC_BS    IS NULL        AND
                           FIS_RATE_RDC_PERC  IS NULL        AND
                           ROWNUM = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE 'N'                     TO WS31-CHV-SUB-OK
           ELSE
                MOVE 'S'                     TO WS31-CHV-SUB-OK.

       520-99-RECUPERA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 08/00 *
      *                                                                *
      *  EFETUA SQL PARA RECUPERAR CLASS. FISCAL COM INCENTIVO.        *
      *----------------------------------------------------------------*
      
       525-00-RECUPERA-CLAS-INCENTIVO        SECTION.
      *----------------------------------------------*      

           MOVE '525-00-RECUPERA-CLAS-INCENTIVO'  TO  WS35-AUX-TS.

      *    EXEC SQL SELECT 1
      *             FROM   H1SF.FIS_CLSFISCAL
      *             WHERE  FIS_CLSF_FSC = :WQ01-CLSF-FSC     AND
      *                    FIS_CD_UF    = :CC0004-UF-CODIGO  AND
      *                    (FIS_RATE_RDC_BS    IS NOT NULL   OR
      *                     FIS_RATE_RDC_PERC  IS NOT NULL)  AND
      *                    ROWNUM = 1
      *         END-EXEC.
      *
      *    IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
      *         MOVE 'N'                     TO WS31-CHV-INC-OK
      *    ELSE
      *         MOVE 'S'                     TO WS31-CHV-INC-OK.

           MOVE 'N'                          TO WS31-CHV-INC-OK.

           EXEC SQL AT CCPR DECLARE CSR_SEL_525  CURSOR FOR
                    SELECT 1,
                           A.CMERC_CODIGO
                    FROM   B8CC.COR_CLASSE_MERCADORIA A,
                           B8CC.COR_CLASSIFICACAO_MERCADORIA B,
                           B8CC.COR_MERCADORIA C
                    WHERE  A.CMERC_CODIGO = B.CMERC_CODIGO(+)
                    AND    B.MERC_CODIGO = C.MERC_CODIGO(+)
                    AND    B.DT_INICIO <= SYSDATE
                    AND    (B.DT_FIM >= SYSDATE
                    OR      B.DT_FIM IS NULL)
                    AND    C.MERC_CODIGO = :CC0002-MERC-CODIGO-LIMPO
                    UNION ALL(
                    SELECT 2,
                           A.CMERC_CODIGO
                    FROM   B8CC.COR_CLASSE_MERCADORIA A,
                           B8CC.COR_CLASSIFICACAO_NBM B,
                           B8CC.COR_NBM C
                    WHERE  A.CMERC_CODIGO = B.CMERC_CODIGO(+)
                    AND    B.NBM_CODIGO = C.NBM_CODIGO(+)
                    AND    B.DT_INICIO <= SYSDATE
                    AND    (B.DT_FIM >= SYSDATE
                    OR      B.DT_FIM IS NULL)
                    AND    C.NBM_CODIGO = :CC0002-NBM-CODIGO)
                    ORDER  BY 1, 2 DESC
                END-EXEC.

           EXEC SQL OPEN   CSR_SEL_525 
                END-EXEC. 
                
       525-10-LOOP-SELECAO.
       
           EXEC SQL FETCH  CSR_SEL_525
                    INTO   :WQO1-ORDEM,
                           :CC0009-CMERC-CODIGO
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                           TO 525-30-FECHA-CURSOR.

       525-20-SELECIONA-CLASSE.

           EXEC SQL SELECT CLS_IC_RDC_BS,
                           CLS_IC_RDC_PERC,
                           CLS_IC_CLS_ATV
                    INTO   :SF0010-CLS-IC-RDC-BS
                                                :WI01-CLS-IC-RDC-BS,
                           :SF0010-CLS-IC-RDC-PERC
                                                :WI01-CLS-IC-RDC-PERC,
                           :SF0010-CLS-IC-CLS-ATV
                                                :WI01-CLS-IC-CLS-ATV
                    FROM   H1SF.CLS_CLASSE_FISCAL
                    WHERE  CLS_ID_CLS_FSC = :CC0009-CMERC-CODIGO
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL  OR
              WI01-CLS-IC-RDC-BS  NOT GREATER  -1  OR
              WI01-CLS-IC-RDC-PERC  NOT GREATER  -1  OR
              WI01-CLS-IC-CLS-ATV  NOT GREATER  -1
                MOVE '*** ERRO - CLASSE FISCAL NAO CAD./INCOMP. ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE CC0009-CMERC-CODIGO     TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.
                
           IF SF0010-CLS-IC-CLS-ATV  EQUAL  'N'
                GO                           TO 525-10-LOOP-SELECAO.

           IF (SF0010-CLS-IC-RDC-BS  EQUAL  'S'  OR
               SF0010-CLS-IC-RDC-PERC  EQUAL  'S')  AND
              (CC0009-CMERC-CODIGO  NOT EQUAL  '01'  OR
               (CC0009-CMERC-CODIGO  EQUAL  '01'  AND
                CC0004-UF-CODIGO  EQUAL  'SP'))
                MOVE 'S'                     TO WS31-CHV-INC-OK
                GO                           TO 525-30-FECHA-CURSOR.

           GO                                TO 525-10-LOOP-SELECAO.

       525-30-FECHA-CURSOR.
       
           EXEC SQL CLOSE  CSR_SEL_525
                END-EXEC.

       525-99-RECUPERA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 08/00 *
      *                                                                *
      *  EFETUA SQL PARA ADQUIRIR PARAMETROS.                          *
      *----------------------------------------------------------------*

       530-00-RECUPERA-PARAMETRO             SECTION.
      *----------------------------------------------*

           MOVE '530-00-RECUPERA-PARAMETRO'  TO WS35-AUX-TS.  

           EXEC SQL SELECT CN_PARM
                    INTO   :SR0002-CN-PARM       :WI01-CN-PARM
                    FROM   H1SR.PARAMETROS_CDP
                    WHERE  ID_PARM = :SR0002-ID-PARM
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - PARAMETRO NAO ENCONTRADO  ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE SR0002-ID-PARM          TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.               
                                                
       530-99-SQL-SELECT-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 10/03 *
      *                                                                *
      *  EFETUA SQL PARA ADQUIRIR ITEM DE RECEBIMENTO.                 *
      *----------------------------------------------------------------*

       532-00-RECUPERA-ITEM-RCBM             SECTION.
      *----------------------------------------------*

           MOVE '532-00-RECUPERA-ITEM-RCBM'  TO WS35-AUX-TS.   

           EXEC SQL SELECT CD_FBR,
                           ID_FRN,
                           LTRIM(TO_CHAR(ID_NF,'000000')),
                           TO_CHAR(DTC_NF,'YYYYMMDD'),
                           SRIE_NF
                    INTO   :SR0003-CD-FBR,
                           :SR0003-ID-FRN,
                           :SR0003-ID-NF-CTB    :WI01-ID-NF,
                           :SR0003-DTC-NF-CTB   :WI01-DTC-NF,
                           :SR0003-SRIE-NF-CTB  :WI01-SRIE-NF
                    FROM   H1SE.V_ITEM_RECEBIMENTO
                    WHERE  ID_ETIQ_RCBM = :ST0005-ID-ETIQ-RCBM
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - ITEM RECEBIMENTO INEXISTENTE  ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE ST0005-ID-ETIQ-RCBM     TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.               

       532-10-LE-DANFE-EMIF.

           EXEC SQL AT CCPR
                    SELECT B.IDF_NUM,
                           B.NOP_CODIGO
                    INTO   :CC0002-IDF-NUM-CTB,
                           :WQ01-NOP-CODIGO-AUX   :WI01-NOP-CODIGO-AUX
                    FROM   B8CC.COR_DOF A,
                           B8CC.COR_IDF B
                    WHERE  A.EMITENTE_PFJ_CODIGO = :SR0003-ID-FRN
                      AND  A.NUMERO = :SR0003-ID-NF-CTB
                      AND  A.DH_EMISSAO = 
                                  TO_DATE(:SR0003-DTC-NF-CTB,'YYYYMMDD')
                      AND  A.SERIE_SUBSERIE = :SR0003-SRIE-NF-CTB
                      AND  A.DOF_SEQUENCE = B.DOF_SEQUENCE
                      AND  B.MERC_CODIGO = :SF0002-ITD-ID-PECA-LOG
                      AND  ROWNUM = 1
                END-EXEC.

           IF SQLCODE  NOT EQUAL  WS31-CHV-NTFD-SQL
                GO                           TO 532-30-RECUP-CONTA-CT.

       532-20-LE-DANFE-EMIF-SEM-SERIE.

           EXEC SQL AT CCPR
                    SELECT B.IDF_NUM,
                           B.NOP_CODIGO
                    INTO   :CC0002-IDF-NUM-CTB,
                           :WQ01-NOP-CODIGO-AUX   :WI01-NOP-CODIGO-AUX
                    FROM   B8CC.COR_DOF A,
                           B8CC.COR_IDF B
                    WHERE  A.EMITENTE_PFJ_CODIGO = :SR0003-ID-FRN
                      AND  A.NUMERO = :SR0003-ID-NF-CTB
                      AND  A.DH_EMISSAO = 
                                  TO_DATE(:SR0003-DTC-NF-CTB,'YYYYMMDD')
                      AND  A.DOF_SEQUENCE = B.DOF_SEQUENCE
                      AND  B.MERC_CODIGO = :SF0002-ITD-ID-PECA-LOG
                      AND  ROWNUM = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - DANFE NAO ENCONTRADO  ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE SR0003-ID-NF-CTB        TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS. 

       532-30-RECUP-CONTA-CT.
                
           PERFORM 533-00-RECUPERA-CONTA-CT.

       532-99-SQL-SELECT-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 10/03 *
      *                                                                *
      *  EFETUA SQL PARA ADQUIRIR CONTA DO CT.                         *
      *----------------------------------------------------------------*

       533-00-RECUPERA-CONTA-CT              SECTION.
      *----------------------------------------------*

           MOVE '533-00-RECUPERA-CONTA-CT'   TO WS35-AUX-TS.

           EXEC SQL SELECT CD_NOP,
                           CD_AUX_ICM,
                           CD_AUX_IPI,
                           CT_RR_CR,
                           CT_RR_DEB
                    INTO   :CT0001-CD-NOP,
                           :CT0001-CD-AUX-ICM      :WI01-CD-AUX-ICM,
                           :CT0001-CD-AUX-IPI      :WI01-CD-AUX-IPI,
                           :CT0001-CT-RR-CR        :WI01-CT-RR-CR,
                           :CT0001-CT-RR-DEB       :WI01-CT-RR-DEB
                    FROM   H1SF.SN_CONTAS_CTB
                    WHERE  CD_NOP = :WQ01-NOP-CODIGO-AUX
                    AND    DTC_INL <= TO_DATE(:SR0003-DTC-NF-CTB,
                                                            'YYYYMMDD')
                    AND    (DTC_FNL >= TO_DATE(:SR0003-DTC-NF-CTB,
                                                            'YYYYMMDD')
                    OR      DTC_FNL IS NULL)
                    AND    ROWNUM = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - CONTA CT INEXISTENTE  ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE SPACES                  TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.               
                                                
       533-99-SQL-SELECT-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 08/00 *
      *                                                                *
      *  EFETUA SQL PARA ATUALIZAR O PWS.                              *
      *----------------------------------------------------------------*

       535-00-ATUALIZA-PWS                   SECTION.
      *----------------------------------------------*

           MOVE '535-00-ATUALIZA-PWS'  TO WS35-AUX-TS.

           IF SF0005-SFT-IC-NACZ-ICPN-BT  EQUAL  'S'  AND
              SF0005-SFT-CD-T-REC  NOT EQUAL  'OT'
                GO                          TO 535-99-SQL-ATUALIZA-EXIT.

           EXEC SQL DECLARE CSR_SEL_535A  CURSOR FOR       
                    SELECT ITD_ID_CLI,
                           ITD_ID_VOL,
                           ITD_ID_ETIQ_REC,
                           SUM(ITD_Q_PECA_FTRD)
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST    = :WQ02-CD-MERC-DST
                      AND  ITD_DTC_SEL_FTRM   = :WQ02-DTC-SEL-FTRM
                      AND  ITD_LGON_FUNC      = :WQ02-LGON-FUNC
                      AND  ((:WQ02-FASE-FTRM  = '1'
                      AND    ITD_ID_NF_REF   IS NULL)
                      OR    (:WQ02-FASE-FTRM  = '2'
                      AND    ITD_ID_NF_REF   IS NOT NULL))
                    GROUP  BY ITD_ID_CLI,
                              ITD_ID_VOL,
                              ITD_ID_ETIQ_REC
                END-EXEC.

           EXEC SQL OPEN   CSR_SEL_535A 
                END-EXEC. 
                
       535-10-LOOP-ITEM-VOL.

           EXEC SQL FETCH  CSR_SEL_535A
                    INTO   :SF0002-ITD-ID-CLI-PWS,
                           :SF0002-ITD-ID-VOL-PWS,
                           :SF0002-ITD-ID-ETIQ-REC-PWS,
                           :SF0002-ITD-Q-PECA-FTRD-PWS
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                           TO 535-20-CLOSE-ITEM-VOL.

           EXEC SQL UPDATE H1ST.ITEM_RECOLHIMENTO
                    SET    DTC_FNL_ITEM = SYSDATE
                    WHERE  ID_ETIQ_REC = :SF0002-ITD-ID-ETIQ-REC-PWS
                    AND    Q_PECA_REC = :SF0002-ITD-Q-PECA-FTRD-PWS
                END-EXEC.

           IF SQLCODE  NOT EQUAL  WS31-CHV-NTFD-SQL
                GO                           TO 535-10-LOOP-ITEM-VOL.

           EXEC SQL SELECT SUM(ITD_Q_PECA_FTRD)
                    INTO   :SF0002-ITD-Q-PECA-FTRD-PWS
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST = :WQ02-CD-MERC-DST
                    AND    ITD_DTC_SEL_FTRM = :WQ02-DTC-SEL-FTRM
                    AND    ITD_LGON_FUNC = :WQ02-LGON-FUNC
                    AND    ITD_ID_ETIQ_REC = :SF0002-ITD-ID-ETIQ-REC-PWS
                    AND    ((:WQ02-FASE-FTRM = '1'
                    AND      ITD_ID_NF_REF IS NULL)
                    OR      (:WQ02-FASE-FTRM = '2'
                    AND      ITD_ID_NF_REF IS NOT NULL))
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                           TO 535-10-LOOP-ITEM-VOL.

           EXEC SQL UPDATE H1ST.ITEM_RECOLHIMENTO
                    SET    DTC_FNL_ITEM = SYSDATE
                    WHERE  ID_ETIQ_REC = :SF0002-ITD-ID-ETIQ-REC-PWS
                    AND    Q_PECA_REC = :SF0002-ITD-Q-PECA-FTRD-PWS
                END-EXEC.

           GO                                TO 535-10-LOOP-ITEM-VOL.

       535-20-CLOSE-ITEM-VOL.

           EXEC SQL CLOSE  CSR_SEL_535A 
                END-EXEC. 

       535-30-SELECIONA-VOLUME.

           EXEC SQL DECLARE CSR_SEL_535B  CURSOR FOR       
                    SELECT DISTINCT
                           ITD_ID_MTZ,
                           ITD_ID_CLI,
                           ITD_ID_VOL,
                           ITD_ID_NF,
                           ITD_CD_MOD_TRSP
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST    = :WQ02-CD-MERC-DST
                      AND  ITD_DTC_SEL_FTRM   = :WQ02-DTC-SEL-FTRM
                      AND  ITD_LGON_FUNC      = :WQ02-LGON-FUNC
                      AND  ((:WQ02-FASE-FTRM  = '1'
                      AND    ITD_ID_NF_REF   IS NULL)
                      OR    (:WQ02-FASE-FTRM  = '2'
                      AND    ITD_ID_NF_REF   IS NOT NULL))
                END-EXEC.

           EXEC SQL OPEN   CSR_SEL_535B 
                END-EXEC. 
                
       535-40-LOOP-VOLUME.

           EXEC SQL FETCH  CSR_SEL_535B
                    INTO   :SF0002-ITD-ID-MTZ,
                           :SF0002-ITD-ID-CLI-PWS,
                           :SF0002-ITD-ID-VOL-PWS,
                           :SF0002-ITD-ID-NF-PWS,
                           :SF0002-ITD-CD-MOD-TRSP
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                           TO 535-50-CLOSE-VOLUME.

           IF WS36-CD-MERC-DST  EQUAL  'D'
                EXEC SQL UPDATE H1ST.VOLUME_RECOLHIMENTO
                         SET    ID_DCT_FSCL = :SF0002-ITD-ID-NF-PWS
                         WHERE  ID_VOL = :SF0002-ITD-ID-VOL-PWS
                     END-EXEC.

      *    IF WS36-CD-MERC-DST  EQUAL  'E'  AND
      *       ((WS36-FASE-FTRM    EQUAL  '1'  AND
      *         (SF0002-ITD-CD-MOD-TRSP  EQUAL  '4'  OR
      *          SF0002-ITD-CD-MOD-TRSP  EQUAL  '5'  OR
      *          SF0002-ITD-CD-MOD-TRSP  EQUAL  '6'))  OR
      *        (WS36-FASE-FTRM  EQUAL  '2'  AND
      *         SF0002-ITD-CD-MOD-TRSP  NOT EQUAL  '4'  AND
      *         SF0002-ITD-CD-MOD-TRSP  NOT EQUAL  '5'  AND
      *         SF0002-ITD-CD-MOD-TRSP  NOT EQUAL  '6'))

           IF (WS36-CD-MERC-DST  EQUAL  'D'  AND
               ((WS36-FASE-FTRM  EQUAL  '1'  AND
                 SF0005-SFT-IC-FTRM-TRGD  NOT EQUAL  'S')  OR
                WS36-FASE-FTRM  EQUAL  '2'))  OR
              (WS36-CD-MERC-DST  EQUAL  'E'  AND
               ((WS36-FASE-FTRM  EQUAL  '1'  AND
                 (ST0001-CD-REGR-FTRM  EQUAL  'J'  OR
                  ST0001-CD-REGR-FTRM  EQUAL  'N'))  OR
                WS36-FASE-FTRM  EQUAL  '2'))
                EXEC SQL UPDATE H1ST.VOLUME_RECOLHIMENTO A
                         SET    A.IC_VOL_FTRD = 'S'
                         WHERE  A.ID_VOL = :SF0002-ITD-ID-VOL-PWS
                         AND    NOT EXISTS
                                (SELECT 1
                                 FROM   H1ST.ITEM_VOLUME_RECOLHIMENTO B,
                                        H1ST.ITEM_RECOLHIMENTO C
                                 WHERE  B.ID_ETIQ_REC = C.ID_ETIQ_REC
                                 AND    B.ID_VOL = A.ID_VOL
                                 AND    C.DTC_FNL_ITEM IS NULL
                                 AND    ROWNUM = 1)
                     END-EXEC.
      *-------------------------------------------------*

           GO                                TO 535-40-LOOP-VOLUME.

       535-50-CLOSE-VOLUME.

           EXEC SQL CLOSE  CSR_SEL_535B 
                END-EXEC. 
                
       535-99-SQL-ATUALIZA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               EFJ 05/25 *
      *                                                                *
      *  EFETUA SQL PARA FINALIZAR FINALIZACAO DE ITEM PENDENTE.       *
      *----------------------------------------------------------------*

       537-00-FINALIZA-ITEM-REC-PEND         SECTION.
      *----------------------------------------------*

           MOVE '537-00-FINALIZA-ITEM-REC-PEND'
                                             TO WS35-AUX-TS.

           EXEC SQL SELECT 1
                    FROM   H1ST.ITEM_RECOLHIMENTO A
                    WHERE  A.DTC_FNL_REC IS NOT NULL
                    AND    A.DTC_FNL_ITEM IS NULL
                    AND    EXISTS
                               (SELECT 1
                                FROM   H1SE.V_ITD_ITMFATURADO B,
                                       H1SE.V_MNT_MONITOR_FTRM C
                                WHERE  B.ITD_CD_MERC_DST =
                                                     C.MNT_CD_MERC_DST
                                AND    B.ITD_DTC_SEL_FTRM =
                                                     C.MNT_DTC_SEL_FTRM
                                AND    B.ITD_LGON_FUNC =
                                                     C.MNT_LGON_FUNC
                                AND    B.ITD_CD_T_REC =
                                                     C.MNT_CD_T_REC
                                AND    B.ITD_ID_ETIQ_REC =
                                                     A.ID_ETIQ_REC
                                AND    C.MNT_DTC_FNL_FTRM IS NOT NULL
                                AND    ROWNUM = 1)
                    AND     ROWNUM = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                          TO 537-99-SQL-FINALIZA-EXIT.

           EXEC SQL UPDATE H1ST.ITEM_RECOLHIMENTO A
                    SET    A.DTC_FNL_ITEM =
                               (SELECT C.MNT_DTC_FNL_FTRM
                                FROM   H1SE.V_ITD_ITMFATURADO B,
                                       H1SE.V_MNT_MONITOR_FTRM C
                                WHERE  B.ITD_CD_MERC_DST =
                                                     C.MNT_CD_MERC_DST
                                AND    B.ITD_DTC_SEL_FTRM =
                                                     C.MNT_DTC_SEL_FTRM
                                AND    B.ITD_LGON_FUNC =
                                                     C.MNT_LGON_FUNC
                                AND    B.ITD_CD_T_REC =
                                                     C.MNT_CD_T_REC
                                AND    B.ITD_ID_ETIQ_REC =
                                                     A.ID_ETIQ_REC
                                AND    C.MNT_DTC_FNL_FTRM IS NOT NULL
                                AND    ROWNUM = 1)
                    WHERE  A.DTC_FNL_REC IS NOT NULL
                    AND    A.DTC_FNL_ITEM IS NULL
                    AND    EXISTS
                               (SELECT 1
                                FROM   H1SE.V_ITD_ITMFATURADO B,
                                       H1SE.V_MNT_MONITOR_FTRM C
                                WHERE  B.ITD_CD_MERC_DST =
                                                     C.MNT_CD_MERC_DST
                                AND    B.ITD_DTC_SEL_FTRM =
                                                     C.MNT_DTC_SEL_FTRM
                                AND    B.ITD_LGON_FUNC =
                                                     C.MNT_LGON_FUNC
                                AND    B.ITD_CD_T_REC =
                                                     C.MNT_CD_T_REC
                                AND    B.ITD_ID_ETIQ_REC =
                                                     A.ID_ETIQ_REC
                                AND    C.MNT_DTC_FNL_FTRM IS NOT NULL
                                AND    ROWNUM = 1)
                END-EXEC.

       537-99-SQL-FINALIZA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 10/00 *
      *                                                                *
      *  EFETUA SQL PARA ATUALIZAR PROTOCOLOS.                         *
      *----------------------------------------------------------------*

       540-00-ATUALIZA-PROTOCOLO             SECTION.
      *----------------------------------------------*

           MOVE '540-00-ATUALIZA-PROTOCOLO'  TO  WS35-AUX-TS.
                
           MOVE WS01-PRECO-TOTAL-M-TOT       TO WS01-PTD-V-TTL-MRCD-R.
           MOVE WS01-PTD-V-TTL-MRCD          TO WQ01-PTD-V-TTL-MRCD.

           MOVE WS01-PESO-BRUTO-KG-TOT       TO WS01-PTD-PESO-TTL-BRT-R.
           MOVE WS01-PTD-PESO-TTL-BRT        TO WQ01-PTD-PESO-TTL-BRT.

           MOVE WS01-PESO-LIQUIDO-KG-TOT     TO WS01-PTD-PESO-TTL-LQD-R.
           MOVE WS01-PTD-PESO-TTL-LQD        TO WQ01-PTD-PESO-TTL-LQD.

           EXEC SQL UPDATE H1SF.PTD_PROTODSP
                    SET    PTD_IC_DSP_IMPS  = 'S',
                           PTD_PESO_TTL_LQD = :WQ01-PTD-PESO-TTL-LQD,
                           PTD_PESO_TTL_BRT = :WQ01-PTD-PESO-TTL-BRT,
                           PTD_V_TTL_MRCD   = :WQ01-PTD-V-TTL-MRCD
                    WHERE  PTD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                END-EXEC.

       540-99-ATUALIZA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 05/03 *
      *                                                                *
      *  EFETUA SQL PARA GRAVAR LANCAMENTOS CONTABEIS.                 *
      *----------------------------------------------------------------*

       542-00-GRAVA-LANCAMENTOS-CT           SECTION.
      *----------------------------------------------*

           MOVE '542-00-GRAVA-LANCAMENTOS-CT' TO  WS35-AUX-TS.
                
           EXEC SQL INSERT
                    INTO   H1SF.CTB_LANCAMENTOS
                           (CTB_CD_MERC_DST,
                            CTB_CD_T_REC,
                            CTB_CD_T_MTZ,
                            CTB_ID_MTZ,
                            CTB_ID_CLI,
                            CTB_ID_NF,
                            CTB_DTC_NF,
                            CTB_CD_CFOP,
                            CTB_CD_T_CT,
                            CTB_DS_CT,
                            CTB_ID_CT,
                            CTB_V_LCTO_CTB,
                            CTB_ID_LD)
                    VALUES (:SF0001-PTD-CD-MERC-DST,
                            :SF0001-PTD-CD-T-REC,
                            :SF0001-PTD-CD-T-MTZ,
                            :SF0001-PTD-ID-MTZ,
                            :SF0001-PTD-ID-CLI,
                            :SF0007-CTB-ID-NF,
                            TO_DATE(:SF0007-CTB-DTC-NF,
                                   'YYYYMMDDHH24MISS'),
                            :CC0001-CFOP-CODIGO,
                            :SF0007-CTB-CD-T-CT,
                            :SF0007-CTB-DS-CT,
                            :SF0007-CTB-ID-CT,
                            :SF0007-CTB-V-LCTO-CTB,
                            259)
                END-EXEC.

       542-99-GRAVA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 10/00 *
      *                                                                *
      *  EFETUA SQL PARA GRAVACAO DE ITEM DA DANFE.                    *
      *----------------------------------------------------------------*

       545-00-GRAVA-DETALHE-REL              SECTION.
      *----------------------------------------------*

           MOVE '545-00-GRAVA-DETALHE-REL'   TO  WS35-AUX-TS.

       545-10-CARREGA-VIAS.

           IF WS31-CHV-CARREGA-TAB  EQUAL  'N'
                GO                           TO 545-20-VERIFICA-PJL.

           ADD 1                             TO WS32-IND-IMPR.

           IF WS32-IND-IMPR  EQUAL  57600
                MOVE '*** ERRO - ESTOURO TABELA AUXILIAR - VIAS   ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM                                                        
                PERFORM 900-00-REGISTRA-ERRO-TRNS.                                                                  

           MOVE WS01-LINHA-IMPR-AUX          TO WS01-LIN-IMPR
                                                (WS32-IND-IMPR).

       545-20-VERIFICA-PJL.

           IF WS31-CHV-COMANDO-PJL  EQUAL  'S'
                PERFORM  546-00-INSERT-DETALHE
                GO                           TO 545-99-SQL-GRAVA-EXIT.

       545-25-MONTA-LINHA-IMPR.

           IF CB0002-DRE-CD-SQN-PJL  NOT EQUAL
                                             WS01-DRE-CD-SQN-PJL-ANT  OR
              CB0002-DRE-ID-PRCP  NOT EQUAL  WS01-DRE-ID-PRCP-ANT
                IF WS01-DRE-CD-SQN-PJL-ANT  NOT EQUAL  SPACES  AND
                   WS01-DRE-ID-PRCP-ANT  NOT EQUAL  SPACES
                     MOVE WS01-DRE-CN-LNH-REL 
                                             TO CB0002-DRE-CN-LNH-REL
                     MOVE CB0002-DRE-CD-SQN-PJL
                                             TO WS01-DRE-CD-SQN-PJL-AUX
                     MOVE CB0002-DRE-ID-PRCP TO WS01-DRE-ID-PRCP-AUX
                     MOVE CB0002-DRE-ID-PRCP-PTD-LIT
                                             TO WS01-ID-PRCP-PTD-AUX
                     MOVE WS01-DRE-CD-SQN-PJL-ANT
                                             TO CB0002-DRE-CD-SQN-PJL
                     MOVE WS01-DRE-ID-PRCP-ANT
                                             TO CB0002-DRE-ID-PRCP
                     MOVE WS01-ID-PRCP-PTD-ANT
                                           TO CB0002-DRE-ID-PRCP-PTD-LIT
                     PERFORM  546-00-INSERT-DETALHE
                     MOVE WS01-DRE-CD-SQN-PJL-AUX
                                             TO CB0002-DRE-CD-SQN-PJL
                     MOVE WS01-DRE-ID-PRCP-AUX
                                             TO CB0002-DRE-ID-PRCP
                     MOVE WS01-ID-PRCP-PTD-AUX
                                           TO CB0002-DRE-ID-PRCP-PTD-LIT
                END-IF
                MOVE ZEROS                   TO WS32-IND-COMANDO
                MOVE SPACES                  TO WS01-DRE-CN-LNH-REL
                MOVE CB0002-DRE-ID-PRCP-PTD-LIT
                                             TO WS01-ID-PRCP-PTD-ANT
                MOVE CB0002-DRE-CD-SQN-PJL   TO WS01-DRE-CD-SQN-PJL-ANT
                MOVE CB0002-DRE-ID-PRCP      TO WS01-DRE-ID-PRCP-ANT.
           
           ADD 1                             TO WS32-IND-COMANDO.
           
           MOVE WS01-LINHA-IMPR-AUX          TO WS01-DRE-CN-LNH-REL-TAB
                                                (WS32-IND-COMANDO).

           IF WS32-IND-COMANDO  NOT LESS  4
                MOVE WS01-DRE-CN-LNH-REL     TO CB0002-DRE-CN-LNH-REL
                PERFORM  546-00-INSERT-DETALHE
                MOVE ZEROS                   TO WS32-IND-COMANDO
                MOVE SPACES                  TO WS01-DRE-CN-LNH-REL.

       545-99-SQL-GRAVA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 10/00 *
      *                                                                *
      *  EFETUA SQL PARA GRAVACAO DE ITEM DA DANFE.                    *
      *----------------------------------------------------------------*

       546-00-INSERT-DETALHE                 SECTION.
      *----------------------------------------------*

           MOVE '546-00-INSERT-DETALHE'      TO  WS35-AUX-TS.

           IF CB0002-DRE-CN-LNH-REL  EQUAL  SPACES  OR
              ((ST0001-CD-REGR-FTRM  EQUAL  'M'  OR
                ST0001-CD-REGR-FTRM  EQUAL  'K'  OR
                CB0004-CD-T-PRD  EQUAL  'C')  AND
               CB0002-DRE-ID-PRCP-PTD-LIT  EQUAL  'PROTOCOL')  OR
              (ST0001-CD-REGR-FTRM  EQUAL  'N'  AND
               (CB0002-DRE-CD-SQN-PJL  EQUAL  WS01-CD-SQN-PJL-NF  OR
                CB0002-DRE-CD-SQN-PJL  EQUAL  '97'  OR
                CB0002-DRE-CD-SQN-PJL  EQUAL  '99'))
                GO                           TO 546-10-RESET-CHV.

           ADD 1                             TO WS01-CD-SQN-LNH.
           ADD 1                             TO WS01-CD-SQN-LNH-AUX.
           MOVE WS01-CD-SQN-LNH              TO CB0002-DRE-CD-SQN-LNH.

           PERFORM 180-00-DEFINE-VIA-IMPRESS.
           MOVE WS01-ID-VIA-AUX              TO CB0002-DRE-ID-VIA.

           INSPECT CB0002-DRE-ID-VIA         CONVERTING SPACES TO ZEROS.

           EXEC SQL INSERT INTO H1CB.DRE_DETREL
                           (DRE_CD_STM,
                            DRE_DTC_GRC,
                            DRE_ID_PRCP,
                            DRE_CD_SQN_DCT,
                            DRE_CD_SQN_PJL,
                            DRE_CD_SQN_LNH,
                            DRE_CN_LNH_REL,
                            DRE_ID_VIA)
                    VALUES (:CB0002-DRE-CD-STM,
                            TO_DATE(:CB0002-DRE-DTC-GRC,
                                    'YYYYMMDDHH24MISS'),
                            :CB0002-DRE-ID-PRCP,
                            :CB0002-DRE-CD-SQN-DCT,
                            :CB0002-DRE-CD-SQN-PJL,
                            :CB0002-DRE-CD-SQN-LNH,
                            :CB0002-DRE-CN-LNH-REL,
                            :CB0002-DRE-ID-VIA)
                END-EXEC.

       546-10-RESET-CHV.

           MOVE 'N'                          TO WS31-CHV-COMANDO-PJL.

       546-99-SQL-INSERT-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 10/00 *
      *                                                                *
      *  EFETUA SQL PARA GRAVACAO DE TOTAL DA DANFE.                   *
      *----------------------------------------------------------------*

       550-00-GRAVA-RESUMO-REL               SECTION.
      *----------------------------------------------*

           MOVE '550-00-GRAVA-RESUMO-REL'    TO  WS35-AUX-TS.
           
           IF ((ST0001-CD-REGR-FTRM  EQUAL  'M'  OR
                ST0001-CD-REGR-FTRM  EQUAL  'K'  OR
                CB0004-CD-T-PRD  EQUAL  'C')  AND
               CB0001-RRE-ID-PRCP-PTD-LIT  EQUAL  'PROTOCOL')  OR
              (ST0001-CD-REGR-FTRM  EQUAL  'N'  AND
               CB0001-RRE-ID-REL  EQUAL  'DANFE DE PECAS')
                GO                           TO 550-10-RESET-CHV.

           IF WS31-CHV-COMANDO-PJL  EQUAL  'N'
                IF CB0001-RRE-ID-PRCP-PTD-LIT  EQUAL  'PROTOCOL'
                     MOVE '01'               TO CB0001-RRE-CD-SQN-PJL
                ELSE
                IF CB0001-RRE-ID-PRCP-PTD-LIT  EQUAL  'INSTRUCA'
                     MOVE '02'               TO CB0001-RRE-CD-SQN-PJL
                ELSE
                IF CB0001-RRE-ID-PRCP-PTD-LIT  EQUAL  'PACKLIST'
                     MOVE '05'               TO CB0001-RRE-CD-SQN-PJL
                ELSE
                IF CB0001-RRE-ID-PRCP-PTD-LIT  EQUAL  'LISTAEMB'
                     MOVE '06'               TO CB0001-RRE-CD-SQN-PJL
                ELSE
                     MOVE '03'               TO CB0001-RRE-CD-SQN-PJL.
                     
           EXEC SQL INSERT INTO H1CB.RRE_RESREL
                           (RRE_CD_STM,
                            RRE_DTC_GRC,
                            RRE_ID_PRCP,
                            RRE_CD_SQN_DCT,
                            RRE_CD_SQN_PJL,
                            RRE_ID_AUX_IMPS_1,
                            RRE_ID_AUX_IMPS_2,
                            RRE_ID_AUX_IMPS_3,
                            RRE_ID_AUX_IMPS_4,
                            RRE_ID_AUX_IMPS_5,
                            RRE_ID_REL,
                            RRE_ID_IMPR)
                    VALUES (:CB0001-RRE-CD-STM,
                            TO_DATE(:CB0001-RRE-DTC-GRC,
                                    'YYYYMMDDHH24MISS'),
                            :CB0001-RRE-ID-PRCP,
                            :CB0001-RRE-CD-SQN-DCT,
                            :CB0001-RRE-CD-SQN-PJL,
                            :CB0001-RRE-ID-AUX-IMPS-1,
                            :CB0001-RRE-ID-AUX-IMPS-2,
                            :CB0001-RRE-ID-AUX-IMPS-3,
                            :CB0001-RRE-ID-AUX-IMPS-4,
                            :CB0001-RRE-ID-AUX-IMPS-5
                                        :WI01-RRE-ID-AUX-IMPS-5,
                            :CB0001-RRE-ID-REL,
                            :CB0001-RRE-ID-IMPR)
                END-EXEC.

       550-10-RESET-CHV.

           MOVE 'N'                          TO WS31-CHV-COMANDO-PJL.

       550-99-SQL-GRAVA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *         === ROTINA DE LINK PARA PROGRAMA ===        ACA  08/00 *
      *                                                                *
      *  DESVIA O CONTROLE PARA O PROGRAMA H1CB5022.                   *
      *----------------------------------------------------------------*

       555-00-GRAVA-MENSAGEM-MQ              SECTION.
      *----------------------------------------------*
       
           MOVE '555-00-GRAVA-MENSAGEM-MQ'   TO  WS35-AUX-TS.
                 
      *----------------------------------------------------------------*
      *    GO                                TO 555-99-GRAVA-EXIT.
      *----------------------------------------------------------------*

           EXEC CICS LINK         PROGRAM    ('H1CB5022')
                                  COMMAREA   (ACB5022-ARE-COMA)
                                  LENGTH     (10000)
                END-EXEC.

           IF ACB5022-CD-RETR-ECI  NOT EQUAL  ZEROS  OR
              ACB5022-CD-RETR-ACES NOT EQUAL  ZEROS
                MOVE '*** ERRO - GRAVACAO FILA MQ - RCODE:   ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE ACB50221-CD-ACES-MQ     TO WS35-CD-ACES-ERRO
                MOVE ACB5022-CD-RETR-ECI     TO WS35-CD-ERRO-ECI
                MOVE ACB5022-CD-RETR-ACES    TO WS35-CD-ERRO-ACES
                MOVE ACB50221-CD-RSON-R      TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF5022'              TO WS35-ID-PGM                                                        
                PERFORM 900-00-REGISTRA-ERRO-TRNS.                                                                  

       555-99-GRAVA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 10/00 *
      *                                                                *
      *  EFETUA SQL PARA ATUALIZAR MONITOR DE FATURAMENTO.             *
      *----------------------------------------------------------------*

       560-00-ATUALIZA-MONITOR               SECTION.
      *----------------------------------------------*

           MOVE '560-00-ATUALIZA-MONITOR'    TO  WS35-AUX-TS.

       560-10-VERIFICA-CANCELAMENTO.

           EXEC SQL SELECT 1
                    FROM   H1SF.MNT_MONITOR_FTRM
                    WHERE  MNT_CD_MERC_DST  = :WQ02-CD-MERC-DST   AND
                           MNT_DTC_SEL_FTRM = :WQ02-DTC-SEL-FTRM  AND
                           MNT_LGON_FUNC    = :WQ02-LGON-FUNC     AND
                           MNT_ID_MTV_ITRP = 'E'                  AND    
                           ROWNUM = 1
                END-EXEC.

           IF SQLCODE  NOT EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*'                    TO WS31-CHV-CANCELADO
                GO                          TO 560-99-ATUALIZA-EXIT.

           EXEC SQL SELECT 1
                    FROM   H1SF.MNT_MONITOR_FTRM
                    WHERE  MNT_CD_MERC_DST  = :WQ02-CD-MERC-DST   AND
                           MNT_DTC_SEL_FTRM = :WQ02-DTC-SEL-FTRM  AND
                           MNT_LGON_FUNC    = :WQ02-LGON-FUNC     AND
                           MNT_IC_CAN        IS NOT NULL          AND   
                           ROWNUM = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                          TO 560-20-ATUALIZA-FASE.

           EXEC SQL UPDATE H1SF.MNT_MONITOR_FTRM
                    SET    MNT_ID_MTV_ITRP = 'C'
                    WHERE  MNT_CD_MERC_DST  = :WQ02-CD-MERC-DST   AND
                           MNT_DTC_SEL_FTRM = :WQ02-DTC-SEL-FTRM  AND
                           MNT_LGON_FUNC    = :WQ02-LGON-FUNC     AND
                           MNT_IC_CAN         IS NOT NULL         AND    
                           (MNT_ID_MTV_ITRP = 'C'                 OR    
                            MNT_ID_MTV_ITRP = 'K')    
                END-EXEC.

           MOVE '*'                         TO WS31-CHV-CANCELADO.

       560-20-ATUALIZA-FASE.

           IF WS36-FASE-FTRM  EQUAL  '1'
                EXEC SQL UPDATE H1SF.MNT_MONITOR_FTRM
                         SET    MNT_DTC_FASE_MTG = SYSDATE
                         WHERE  MNT_CD_MERC_DST  = :WQ02-CD-MERC-DST
                         AND    MNT_DTC_SEL_FTRM = :WQ02-DTC-SEL-FTRM
                         AND    MNT_LGON_FUNC    = :WQ02-LGON-FUNC
                     END-EXEC.

           IF WS36-FASE-FTRM  EQUAL  '2'
                EXEC SQL UPDATE H1SF.MNT_MONITOR_FTRM
                         SET    MNT_DTC_FASE_MTG_CPLM = SYSDATE
                         WHERE  MNT_CD_MERC_DST  = :WQ02-CD-MERC-DST
                         AND    MNT_DTC_SEL_FTRM = :WQ02-DTC-SEL-FTRM
                         AND    MNT_LGON_FUNC    = :WQ02-LGON-FUNC
                     END-EXEC.

       560-30-EFETIVA-FASE.

           PERFORM 590-00-EMITE-SYNCPOINT.

       560-99-ATUALIZA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               EFJ 10/07 *
      *                                                                *
      *  EFETUA SQL PARA ATUALIZAR MONITOR DE FATURAMENTO.             *
      *----------------------------------------------------------------*

       565-00-ATUALIZA-LBRC-IMPS             SECTION.
      *----------------------------------------------*

           MOVE '565-00-ATUALIZA-LBRC-IMPS'  TO  WS35-AUX-TS.

           EXEC SQL UPDATE H1SF.MNT_MONITOR_FTRM
                    SET    MNT_DTC_FASE_LBRC_IMPS = SYSDATE
                    WHERE  MNT_CD_MERC_DST  = :WQ02-CD-MERC-DST
                    AND    MNT_DTC_SEL_FTRM = :WQ02-DTC-SEL-FTRM
                    AND    MNT_LGON_FUNC    = :WQ02-LGON-FUNC
                END-EXEC.

       565-99-ATUALIZA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               EFJ 06/13 *
      *                                                                *
      *  EFETUA SQL PARA ATUALIZAR VALOR DE ODA CMIS2.                 *
      *----------------------------------------------------------------*

       567-00-ATUALIZA-ODA-CMIS2             SECTION.
      *----------------------------------------------*

           MOVE '567-00-ATUALIZA-ODA-CMIS2'  TO  WS35-AUX-TS.

           EXEC SQL SELECT B.CD_T_PREC_FTRM
                    INTO   :ST0005-CD-T-PREC-FTRM
                    FROM   H1SF.ITD_ITMFATURADO A,
                           H1ST.ITEM_RECOLHIMENTO B
                   WHERE  A.ITD_ID_ETIQ_REC  = B.ID_ETIQ_REC
                     AND  A.ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                     AND  A.ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                     AND  A.ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                     AND  A.ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                     AND  A.ITD_ID_NF        = :CC0001-NUMERO
                     AND  A.ITD_CD_SEQ_ITM   = :CC0002-IDF-NUM
                     AND  ROWNUM = 1
                END-EXEC.

           IF CB0004-CD-FBR  EQUAL  '28'  AND
              ST0005-CD-T-PREC-FTRM  EQUAL  'T'
                GO                           TO 567-99-ATUALIZA-EXIT.

           EXEC SQL UPDATE H1SF.ITD_ITMFATURADO
                    SET    ITD_V_CAS_RMAN_CMIS2 = 
                           ((ITD_V_CAS_RMAN_CMIS2/ITD_Q_PECA_FTRD)-
                             TRUNC(ROUND((
                                   ITD_V_CAS_RMAN_ODA/ITD_Q_PECA_FTRD)*
                                          (:CC0002-VL-ALIQ-PIS-5 +
                                           :CC0002-VL-ALIQ-COFINS-5)/
                                              10000,2)))*ITD_Q_PECA_FTRD
                    WHERE  ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                    AND    ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                    AND    ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                    AND    ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                    AND    ITD_ID_NF        = :CC0001-NUMERO
                    AND    ITD_CD_SEQ_ITM   = :CC0002-IDF-NUM
                    AND    NVL(ITD_V_CAS_RMAN_CMIS2,0) > 0
                END-EXEC.

       567-99-ATUALIZA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *      === ROTINA DE RECEBIMENTO DE PARAMETROS ===    ACA  08/00 *
      *                                                                *
      *  RECEBE PARAMETROS PASSADOS NO START DA TRANSACAO.             *
      *----------------------------------------------------------------*

       570-00-RETRIEVE-PARAMETRO             SECTION.
      *----------------------------------------------*

           MOVE '570-00-RETRIEVE-PARAMETRO'  TO  WS35-AUX-TS.
                
      *----------------------------------------------------------------*
      *    MOVE 'D20040427145853MRSH1C3 1'   TO WS36-ARE-RECEIVE.
      *    MOVE WS36-CD-MERC-DST             TO WQ02-CD-MERC-DST.
      *    MOVE WS36-DTC-SEL-FTRM            TO WQ02-DTC-SEL-FTRM.
      *    MOVE WS36-LGON-FUNC               TO WQ02-LGON-FUNC.
      *    MOVE WS36-FASE-FTRM               TO WQ02-FASE-FTRM.
      *    GO                                TO 570-99-RETRIEVE-EXIT.
      *----------------------------------------------------------------*

           MOVE 24                           TO WS33-UND-TAM-PARM.

           EXEC CICS RETRIEVE     INTO       (WS36-ARE-RECEIVE)
                                  LENGTH     (WS33-UND-TAM-PARM)
                END-EXEC.

           IF WS36-CD-MERC-DST  NOT GREATER  SPACES
                MOVE '*** ERRO - PARAMETRO P/ SF33 INVALIDO   ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WS36-ARE-RECEIVE        TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM                                                        
                PERFORM 900-00-REGISTRA-ERRO-TRNS.                                                                  

           MOVE WS36-CD-MERC-DST             TO WQ02-CD-MERC-DST.
           MOVE WS36-DTC-SEL-FTRM            TO WQ02-DTC-SEL-FTRM.
           MOVE WS36-LGON-FUNC               TO WQ02-LGON-FUNC.
           MOVE WS36-FASE-FTRM               TO WQ02-FASE-FTRM.

       570-99-RETRIEVE-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               EFJ 09/09 *
      *                                                                *
      *  EFETUA SQL PARA RECUPERAR CNPJ.                               *
      *----------------------------------------------------------------*
      
       572-00-SQL-RECUPERA-CNPJ              SECTION.
      *----------------------------------------------*      

           MOVE '572-00-SQL-RECUPERA-CNPJ'   TO WS35-AUX-TS.      

           IF WS36-CD-MERC-DST  EQUAL  'D'  AND
              WS36-FASE-FTRM  EQUAL  '2'
                GO                           TO 572-20-SQL-CNPJ-TRIANG.

       572-10-SQL-CNPJ-VENDA.

           EXEC SQL SELECT A.CD_T_PRD,
                           A.ID_CNPJ,
                           A.CD_FBR
                    INTO   :CB0004-CD-T-PRD,
                           :CB0004-ID-CNPJ,
                           :CB0004-CD-FBR
                    FROM   H1CB.FABRICA A,
                           H1ST.TIPO_RECOLHIMENTO B
                    WHERE  A.CD_FBR = B.CD_FBR
                    AND    A.CD_T_PRD = B.CD_T_PRD
                    AND    A.NM_CDAD = B.NM_CDAD
                    AND    B.CD_T_REC IN
                                 (SELECT C.SFT_CD_T_REC
                                  FROM   H1SF.SFT_SELECAO_FTRM C
                                  WHERE  C.SFT_CD_MERC_DST  =
                                                      :WQ02-CD-MERC-DST
                                  AND    C.SFT_DTC_SEL_FTRM =
                                                      :WQ02-DTC-SEL-FTRM
                                  AND    C.SFT_LGON_FUNC    =
                                                      :WQ02-LGON-FUNC
                                  AND    ROWNUM = 1)
                END-EXEC.

           INSPECT CB0004-ID-CNPJ            CONVERTING SPACES TO ZEROS.
           
           GO                                TO 572-30-TRATA-CNPJ.

       572-20-SQL-CNPJ-TRIANG.

           EXEC SQL SELECT A.CD_T_PRD,
                           A.ID_CNPJ,
                           A.CD_FBR
                    INTO   :CB0004-CD-T-PRD,
                           :CB0004-ID-CNPJ,
                           :CB0004-CD-FBR
                    FROM   H1CB.FABRICA A,
                           H1ST.CONTROLE_VOLUME B,
                           H1ST.TIPO_RECOLHIMENTO C,
                           H1ST.CONTROLE_VOLUME E
                    WHERE  A.CD_FBR = C.CD_FBR
                    AND    A.CD_T_PRD = C.CD_T_PRD
                    AND    A.CD_UF = B.CD_UF_DST
                    AND    A.IC_FBR_TRGD = :WQ01-IC-SIM
                    AND    E.ID_CLI = A.ID_CLI
                    AND    EXISTS (SELECT 1
                                   FROM   H1SF.SFT_SELECAO_FTRM D
                                   WHERE  D.SFT_CD_T_REC = C.CD_T_REC
                                   AND    D.SFT_CD_T_MTZ = B.CD_T_MTZ
                                   AND    D.SFT_ID_MTZ = B.ID_MTZ
                                   AND    D.SFT_ID_CLI = B.ID_CLI
                                   AND    D.SFT_CD_MERC_DST =
                                                      :WQ02-CD-MERC-DST
                                   AND    D.SFT_DTC_SEL_FTRM =
                                                      :WQ02-DTC-SEL-FTRM
                                   AND    D.SFT_LGON_FUNC =
                                                      :WQ02-LGON-FUNC
                                   AND    ROWNUM = 1)
                END-EXEC.

           INSPECT CB0004-ID-CNPJ            CONVERTING SPACES TO ZEROS.
           
           GO                                TO 572-30-TRATA-CNPJ.

       572-30-TRATA-CNPJ.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - CNPJ FABRICA NAO ENCONTRADO  ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WQ02-DTC-SEL-FTRM       TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.

           INSPECT CB0004-ID-CNPJ            CONVERTING SPACES TO ZEROS.

       572-99-SQL-CNPJ-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               EFJ 07/23 *
      *                                                                *
      *  EFETUA ENTRADA DE NF INTERCOMPANY NO RIS.                     *
      *----------------------------------------------------------------*
      
       573-00-ENTRADA-NF-IC-RIS              SECTION.
      *----------------------------------------------*      

           MOVE '573-00-ENTRADA-NF-IC-RIS'   TO WS35-AUX-TS.      

           MOVE '02'                         TO WX04-CD-ACES.
           MOVE ZEROS                        TO WX04-CD-RETR-ECI
                                                WX04-CD-RETR-ACES.
           MOVE 'I'                          TO WX04-IC-T-ACAO.
           MOVE WQ02-CD-MERC-DST             TO WX04-CD-MERC-DST.
           MOVE WQ02-DTC-SEL-FTRM            TO WX04-DTC-SEL-FTRM.
           MOVE WQ02-LGON-FUNC               TO WX04-LGON-FUNC.
           MOVE SPACES                       TO WX04-ID-PTC-DSP.
           MOVE SPACES                       TO WX04-ID-IMPR-FTRM.
           MOVE WQ02-LGON-FUNC               TO WX04-LGON-FUNC-RSP.

           PERFORM 584-00-EMITE-LINK-H1SF5008-02.

           IF WX04-CD-RETR-ECI  NOT EQUAL  ZEROS  OR
              WX04-CD-RETR-ACES NOT EQUAL  ZEROS
                MOVE '*** ERRO - GRAVACAO INTERFACE RIS (MQ): ==>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WX04-CD-ACES            TO WS35-CD-ACES-ERRO
                MOVE WX04-CD-RETR-ECI        TO WS35-CD-ERRO-ECI
                MOVE WX04-CD-RETR-ACES       TO WS35-CD-ERRO-ACES
                MOVE WQ02-ARE-PARM           TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF5008'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS. 

       573-99-RIS-IC-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *         === ROTINA DE LINK PARA PROGRAMA ===        ACA  08/00 *
      *                                                                *
      *  DESVIA O CONTROLE PARA O PROGRAMA H1CB5026.                   *
      *----------------------------------------------------------------*

       575-00-EMITE-LINK-H1CB5026            SECTION.
      *----------------------------------------------*
       
           MOVE '575-00-EMITE-LINK-H1CB5026'  TO  WS35-AUX-TS.
                
           MOVE '03'                         TO WX01-CD-ACES.
           MOVE ZEROS                        TO WX01-CD-RETR-ECI
                                                WX01-CD-RETR-ACES.
           MOVE 'BPIS'                       TO WX01-CD-STM.
           MOVE CB0001-RRE-DTC-GRC           TO WX01-DTC-GRC.
           MOVE SF0001-PTD-CD-T-REC          TO WX01-ID-AUX-IMPS-1.
           IF WS01-T-IMPS  EQUAL  'P'
                MOVE WQ01-DOF-IMPOR-PROTOCOLO
                                             TO WX01-ID-PRCP
                MOVE 'PROTOCOL'              TO WX01-ID-PRCP-FILL
                MOVE SF0001-PTD-ID-MTZ       TO WX01-ID-AUX-IMPS-2
                MOVE SF0001-PTD-ID-CLI       TO WX01-ID-AUX-IMPS-3
                MOVE SPACES                  TO WX01-ID-AUX-IMPS-4
                MOVE SF0001-PTD-ID-PTC-DSP   TO WX01-ID-AUX-IMPS-5
                MOVE 'PROTOCOLO DE DESPACHO DE PECAS'
                                             TO WX01-ID-REL
                MOVE WS01-CD-SQN-PJL-PTD     TO WX01-ID-VIA
                MOVE 'N'                     TO WX01-IC-ATLZ-MNT
           ELSE
                MOVE WQ01-DOF-IMPOR-NUMERO   TO WX01-ID-PRCP
                MOVE SPACES                  TO WX01-ID-PRCP-CD-SEQ
                                                WX01-ID-PRCP-FILL
                                                WX01-ID-AUX-IMPS-2
                                                WX01-ID-AUX-IMPS-3
                                                WX01-ID-AUX-IMPS-4
                                                WX01-ID-AUX-IMPS-5
                                                WX01-ID-REL
                                                WX01-ID-VIA
                MOVE "%"                     TO WX01-ID-PRCP-CD-SEQ
                MOVE 'S'                     TO WX01-IC-ATLZ-MNT.

           MOVE WS01-IMPRESSORA-LASER        TO WX01-ID-IMPR.

           EXEC CICS LINK         PROGRAM    ('H1CB5026')
                                  COMMAREA   (WX01-ARE-H1CB-5026)
                                  LENGTH     (251)
                END-EXEC.

           IF WX01-CD-RETR-ECI  NOT EQUAL  ZEROS  OR
              WX01-CD-RETR-ACES NOT EQUAL  ZEROS
                MOVE '*** ERRO - GRAVACAO FILA MQ - LOTE:   ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WX01-CD-ACES            TO WS35-CD-ACES-ERRO
                MOVE WX01-CD-RETR-ECI        TO WS35-CD-ERRO-ECI
                MOVE WX01-CD-RETR-ACES       TO WS35-CD-ERRO-ACES
                MOVE WX01-ID-PRCP            TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1CB5026'              TO WS35-ID-PGM                                                        
                PERFORM 900-00-REGISTRA-ERRO-TRNS.                                                                  

       575-99-LINK-PROG-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *         === ROTINA DE LINK PARA PROGRAMA ===        ACA  08/00 *
      *                                                                *
      *  DESVIA O CONTROLE PARA O PROGRAMA H1CB5010.                   *
      *----------------------------------------------------------------*

       580-00-EMITE-LINK-H1CB5010            SECTION.
      *----------------------------------------------*
       
           MOVE '580-00-EMITE-LINK-H1CB5010'  TO  WS35-AUX-TS.
                
           EXEC CICS LINK         PROGRAM    ('H1CB5010')
                                  COMMAREA   (ACB5010-ARE-COMA)
                                  LENGTH     (136)
                END-EXEC.

       580-99-LINK-PROG-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE COMUNICACAO ===            PFN 03/20 *
      *                                                                *
      *  EMITE LINK PARA EXECUTAR O PROGRAMA H1CB5035.                 *
      *----------------------------------------------------------------*

       581-00-EMITE-LINK-H1CB5035            SECTION.
      *----------------------------------------------*

           EXEC CICS LINK         PROGRAM    ('H1CB5035')
                                  COMMAREA   (ACB5035-ARE-COMA)
                                  LENGTH     (23)
                END-EXEC.

       581-99-LINK-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *         === ROTINA DE LINK PARA PROGRAMA ===        EFJ  06/18 *
      *                                                                *
      *  DESVIA O CONTROLE PARA O PROGRAMA H1SF5049.                   *
      *----------------------------------------------------------------*

       582-00-EMITE-LINK-H1SF5049            SECTION.
      *----------------------------------------------*

           MOVE '582-00-EMITE-LINK-H1SF5049' TO  WS35-AUX-TS.

           EXEC CICS LINK         PROGRAM    ('H1SF5049')
                                  COMMAREA   (WX03-ARE-H1SF-5049)
                                  LENGTH     (13)
                END-EXEC.

       582-99-LINK-PROG-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *         === ROTINA DE LINK PARA PROGRAMA ===        EFJ  06/11 *
      *                                                                *
      *  DESVIA O CONTROLE PARA O PROGRAMA H1SF5053.                   *
      *----------------------------------------------------------------*

       583-00-EMITE-LINK-H1SF5053            SECTION.
      *----------------------------------------------*

           MOVE '583-00-EMITE-LINK-H1SF5053'  TO  WS35-AUX-TS.

           EXEC SQL SELECT  FTE_CD_T_DE
                    INTO    :SF0018-FTE-CD-T-DE    :WI01-FTE-CD-T-DE
                    FROM    H1SF.FTE_FATURAS_TRSP_EXP
                    WHERE   FTE_FTR_EXP = :SF0002-ITD-FTR-EXP
                END-EXEC.

           IF SF0018-FTE-CD-T-DE  EQUAL  'DUE'
                GO                           TO 583-99-LINK-PROG-EXIT.

           MOVE '01'                         TO WX02-CD-ACES.
           MOVE ZEROS                        TO WX02-CD-RETR-ECI
                                                WX02-CD-RETR-ACES.
           MOVE SF0002-ITD-FTR-EXP           TO WX02-FTR-EXP.
           
           INSPECT WX02-FTR-EXP              CONVERTING SPACES TO ZEROS.
                
           EXEC CICS LINK         PROGRAM    ('H1SF5053')
                                  COMMAREA   (WX02-ARE-H1SF-5053)
                                  LENGTH     (13)
                END-EXEC.

           IF WX02-CD-RETR-ECI  NOT EQUAL  ZEROS  OR
              (WX02-CD-RETR-ACES NOT EQUAL  ZEROS  AND
               WX02-CD-RETR-ACES NOT EQUAL  '01')
                MOVE '*** ERRO - GRAVACAO INTERFACE SYNITF_IMP_EXP: ==>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WX02-CD-ACES            TO WS35-CD-ACES-ERRO
                MOVE WX02-CD-RETR-ECI        TO WS35-CD-ERRO-ECI
                MOVE WX02-CD-RETR-ACES       TO WS35-CD-ERRO-ACES
                MOVE SF0002-ITD-FTR-EXP      TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF5053'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.   

       583-99-LINK-PROG-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *              === ROTINA DE COMUNICACAO ===           ACA 10/00 *
      *                                                                *
      *  EMITE ROLLBACK PARA DESFAZER ALTERACOES NO BANCO DE DADOS.    *
      *----------------------------------------------------------------*

       585-00-EMITE-ROLLBACK                 SECTION.
      *----------------------------------------------*

           EXEC SQL WHENEVER      SQLERROR   CONTINUE
                END-EXEC.

           EXEC CICS SYNCPOINT ROLLBACK
                END-EXEC.

       585-99-ROLLBACK-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *         === ROTINA DE LINK PARA PROGRAMA ===        EFJ  07/23 *
      *                                                                *
      *  DESVIA O CONTROLE PARA O PROGRAMA H1SF5008 ACESSO 02.         *
      *----------------------------------------------------------------*

       584-00-EMITE-LINK-H1SF5008-02         SECTION.
      *----------------------------------------------*

           MOVE '584-00-EMITE-LINK-H1SF5008-02'
                                             TO  WS35-AUX-TS.

           EXEC CICS LINK         PROGRAM    ('H1SF5008')
                                  COMMAREA   (WX04-ARE-H1SF-5008-02)
                                  LENGTH     (55)
                END-EXEC.

       584-99-LINK-PROG-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *              === ROTINA DE COMUNICACAO ===           ACA 10/00 *
      *                                                                *
      *  EMITE SYNCPOINT PARA CONFIRMAR ALTERACOES NO BANCO DE DADOS.  *
      *----------------------------------------------------------------*
      
       590-00-EMITE-SYNCPOINT                SECTION.
      *----------------------------------------------*
      
           EXEC CICS SYNCPOINT
                END-EXEC.
                
       590-99-SYNCPOINT-EXIT.
           EXIT.           
                                
      *----------------------------------------------------------------*
      *              === ROTINA DE COMUNICACAO ===           ACA 10/00 *
      *                                                                *
      *  RETORNA O CONTROLE PARA O CICS.                               *
      *----------------------------------------------------------------*
      
       595-00-EMITE-RETURN-CICS              SECTION.
      *----------------------------------------------*
      
           EXEC CICS RETURN
                END-EXEC.
                
       595-99-RETURN-EXIT.
           EXIT.           
           
      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 08/00 *
      *                                                                *
      *  EFETUA SQL PARA VERIFICACAO DE DESCONTO DELTA.                *
      *----------------------------------------------------------------*

       600-00-VERIFICA-DELTA                 SECTION.
      *----------------------------------------------*

           MOVE '600-00-VERIFICA-DELTA'      TO WS35-AUX-TS. 

           MOVE '5'                          TO WS01-CD-T-DSCT-CAMP-AUX.

           EXEC SQL DECLARE CSR_SEL_600  CURSOR FOR       
                    SELECT A.CD_T_PGM
                    FROM  H1ST.ITEM_RECOLHIMENTO A, 
                          H1SF.ITD_ITMFATURADO B
                   WHERE  A.ID_ETIQ_REC      = B.ITD_ID_ETIQ_REC
                     AND  B.ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                     AND  B.ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                     AND  B.ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                     AND  B.ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                     AND  B.ITD_ID_NF        = :CC0001-NUMERO
                END-EXEC.

           EXEC SQL OPEN   CSR_SEL_600 
                END-EXEC. 

       600-10-LOOP-DELTA.

           EXEC SQL FETCH  CSR_SEL_600
                    INTO   :WQ01-CD-T-PGM   :WI01-CD-T-PGM
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                           TO 600-20-CLOSE-DELTA.

           IF WQ01-CD-T-PGM  GREATER  SPACES
                IF WQ01-CD-T-PGM  EQUAL  'DELT'
                     MOVE '4'                TO WS01-CD-T-DSCT-CAMP-AUX
                ELSE
                     MOVE '1'                TO WS01-CD-T-DSCT-CAMP-AUX
                END-IF
                GO                           TO 600-20-CLOSE-DELTA.

           GO                                TO 600-10-LOOP-DELTA.

       600-20-CLOSE-DELTA.

           EXEC SQL CLOSE  CSR_SEL_600 
                END-EXEC. 
                
       600-99-SQL-VERIFICA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 11/03 *
      *                                                                *
      *  EFETUA SQL PARA VERIFICACAO DE NECESSIDADE DE INTERFACE CME.  *
      *----------------------------------------------------------------*

       605-00-VERIFICA-CME                   SECTION.
      *----------------------------------------------*

           MOVE '605-00-VERIFICA-CME'        TO WS35-AUX-TS. 

           MOVE 'N'                          TO WS31-CHV-CME.

           EXEC SQL SELECT ID_FRN
                    INTO   :ST0006-ID-FRN  :WI01-ID-FRN
                    FROM   H1ST.CONTROLE_VOLUME
                   WHERE   ID_CLI    = :WQ01-ID-CLI-AUX
                     AND   IC_CLI_RM = 'S'
                     AND   ROWNUM    = 1
                END-EXEC.

           IF SQLCODE  NOT EQUAL  WS31-CHV-NTFD-SQL
                MOVE 'S'                     TO WS31-CHV-CME.

           IF WS31-CHV-CME    EQUAL  'S'      AND
              (WI01-ID-FRN    NOT GREATER -1  OR
               ST0006-ID-FRN  NOT GREATER     SPACES)
                MOVE '*** ERRO - CONTROLE-VOLUME SEM FORNECEDOR   ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WQ01-ID-CLI-AUX         TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM                                                        
                PERFORM 900-00-REGISTRA-ERRO-TRNS.                                                                  

       605-99-SQL-VERIFICA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 01/04 *
      *                                                                *
      *  EFETUA SQL PARA VERIFICACAO DE NECESSIDADE DE INTERFACE DEA.  *
      *----------------------------------------------------------------*

       607-00-VERIFICA-DEA                  SECTION.
      *----------------------------------------------*

           MOVE '607-00-VERIFICA-DEA'        TO WS35-AUX-TS.

           MOVE 'N'                          TO WS31-CHV-DEA.

           IF WS36-CD-MERC-DST  EQUAL  'E'
                GO                           TO 607-10-VERIFICA-EXP.

       607-05-VERIFICA-DOM.

           EXEC SQL SELECT 1
                    FROM   H1SF.ITD_ITMFATURADO A,
                           H1ST.ITEM_RECOLHIMENTO B
                    WHERE  A.ITD_CD_MERC_DST  = :SF0002-ITD-CD-MERC-DST
                      AND  A.ITD_DTC_SEL_FTRM = :SF0002-ITD-DTC-SEL-FTRM
                      AND  A.ITD_LGON_FUNC    = :SF0002-ITD-LGON-FUNC
                      AND  A.ITD_CD_SEQ       = :SF0002-ITD-CD-SEQ
                      AND  A.ITD_ID_ETIQ_REC  = B.ID_ETIQ_REC
                      AND  B.NM_FNT_ATND      = 'SBD'
                      AND  ROWNUM             = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                           TO 607-99-SQL-VERIF-EXIT.
                
           MOVE 'S'                          TO WS31-CHV-DEA.
           GO                                TO 607-15-DATA-DEA.
           
       607-10-VERIFICA-EXP.

           IF WS36-FASE-FTRM   EQUAL  '1'  AND
              (ST0001-CD-REGR-FTRM  EQUAL  'H'  OR
               ST0001-CD-REGR-FTRM  EQUAL  'I'  OR
               ST0001-CD-REGR-FTRM  EQUAL  'N')
                MOVE 'S'                     TO WS31-CHV-DEA
                GO                           TO 607-15-DATA-DEA.
           
           GO                                TO 607-99-SQL-VERIF-EXIT.
                
       607-15-DATA-DEA.

           EXEC SQL SELECT TO_CHAR(SYSDATE,'DD-MM-YYYY-HH24:MI:SS')
                    INTO   :WQ01-SYSDATE-DEA
                    FROM   DUAL
                    WHERE  ROWNUM = 1
                END-EXEC.

       607-99-SQL-VERIF-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               EFJ 10/06 *
      *                                                                *
      *  RECUPERA INFORMACAO PARA EMISSAO DE S.                        *
      *----------------------------------------------------------------*

       608-00-RECUPERA-DADOS-S               SECTION.
      *----------------------------------------------*

           MOVE '608-00-RECUPERA-DADOS-S'    TO WS35-AUX-TS.

       608-05-INICIALIZA-CONTORLES.

           MOVE SF0001-PTD-ID-PTC-DSP        TO WS01-ID-NUM-CNT-S.
           MOVE ZEROS                        TO WS01-ID-NUM-T-REG-S.

       608-10-RECUPERA-DATA-S.

           EXEC SQL SELECT TO_CHAR(SYSDATE,'DD-MM-YYYY-HH24:MI:SS')
                    INTO   :WQ01-SYSDATE-S
                    FROM   DUAL
                    WHERE  ROWNUM = 1
                END-EXEC.

       608-99-RECUPERA-S-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *        === ROTINA DE GETMAIN ===                    ACA  11/01 *
      *----------------------------------------------------------------*

       610-00-GETMAIN-TRSC                   SECTION.
      *----------------------------------------------*
       
           MOVE +6912000                     TO WS01-UND-TAM.

           EXEC CICS GETMAIN  SET      (ADDRESS OF WS01-ARE-IMPRESSAO)
                              FLENGTH  (WS01-UND-TAM)
                              INITIMG  (WS01-ARE-HIGH)
                END-EXEC.
           
           MOVE 'S'                          TO WS31-CHV-GETMAIN.

       610-99-EXIT.
           EXIT.        
           
      *----------------------------------------------------------------*
      *        === ROTINA DE FREEMAIN ===                   ACA  11/01 *
      *----------------------------------------------------------------*

       615-00-FREEMAIN-TRSC                  SECTION.
      *----------------------------------------------*
       
           IF WS31-CHV-GETMAIN  NOT EQUAL  'S'
                GO                           TO 615-99-EXIT.

           EXEC CICS FREEMAIN  DATA     (WS01-ARE-IMPRESSAO)
                END-EXEC.
           
       615-99-EXIT.
           EXIT.        
           
      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 01/04 *
      *                                                                *
      *  EFETUA SQL PARA GRAVACAO DE INTERFACE PARA O DEA.             *
      *----------------------------------------------------------------*

       620-00-GRAVA-INTERFACE-DEA            SECTION.
      *----------------------------------------------*

           MOVE '620-00-GRAVA-INTERFACE-DEA' TO  WS35-AUX-TS.

           PERFORM 630-00-EMITE-ENQ-CONTROLE.

           EXEC SQL INSERT INTO H1SE.IDE_INTERFACE_DE
                           (IDE_NM_EMP,
                            IDE_ID_T_ITF,
                            IDE_ID_STM_ORGM,
                            IDE_DTC_GRC,
                            IDE_DTC_ITF,
                            IDE_NUM_CNT,
                            IDE_NUM_T_REG,
                            IDE_NUM_SQN,
                            IDE_IC_PRC,
                            IDE_TXT_MSG)
                    VALUES (:SE0001-IDE-NM-EMP,
                            :SE0001-IDE-ID-T-ITF,
                            :SE0001-IDE-ID-STM-ORGM,
                            TO_DATE(:SE0001-IDE-DTC-GRC,
                                    'DD-MM-YYYY-HH24:MI:SS'),
                            TO_DATE(:SE0001-IDE-DTC-ITF,
                                    'DD-MM-YYYY-HH24:MI:SS'),
                            :SE0001-IDE-NUM-CNT,
                            :SE0001-IDE-NUM-T-REG,
                            :SE0001-IDE-NUM-SQN,
                            :SE0001-IDE-IC-PRC,
                            :SE0001-IDE-TXT-MSG)
                END-EXEC.
                
           PERFORM 635-00-LIBERA-ENQ-CONTROLE.

           EXEC SQL SELECT 1
                    FROM   H1SE.IDE_INTERFACE_DE
                    WHERE  IDE_NM_EMP = :SE0001-IDE-NM-EMP
                    AND    IDE_ID_T_ITF = :SE0001-IDE-ID-T-ITF
                    AND    IDE_ID_STM_ORGM = :SE0001-IDE-ID-STM-ORGM
                    AND    IDE_DTC_GRC = TO_DATE(:SE0001-IDE-DTC-GRC,
                                    'DD-MM-YYYY-HH24:MI:SS')
                    AND    IDE_DTC_ITF = TO_DATE(:SE0001-IDE-DTC-ITF,
                                    'DD-MM-YYYY-HH24:MI:SS')
                    AND    IDE_NUM_CNT = :SE0001-IDE-NUM-CNT
                    AND    IDE_NUM_T_REG = :SE0001-IDE-NUM-T-REG
                    AND    IDE_NUM_SQN = :SE0001-IDE-NUM-SQN
                    AND    IDE_IC_PRC = :SE0001-IDE-IC-PRC
                    AND    ROWNUM = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO NA GRAVACAO DA INTERFACE DE ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE SE0001-IDE-NUM-CNT      TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.

       620-99-SQL-GRAVA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *         ===  ROTINA DE START DE TRANSACAO  ===       EFJ 04/06 *
      *                                                                *
      *   START DE TRANSACAO.                                          *
      *----------------------------------------------------------------*

       625-00-START-SF30                     SECTION.
      *----------------------------------------------*

           EXEC CICS START        TRANSID    ('SF30')
                                  FROM       (WS36-ARE-SF30)
                END-EXEC.

       625-99-START-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *              === ROTINA DE COMUNICACAO ===           EFJ 09/07 *
      *                                                                *
      *  EMITE ENQUEUE PARA CONTROLE DE ACESSOS.                       *
      *----------------------------------------------------------------*

       630-00-EMITE-ENQ-CONTROLE             SECTION.
      *----------------------------------------------*

       630-10-ADQUIRE-CONTROLE.
       
           EXEC SQL SELECT TO_CHAR(SYSDATE,'YYYYMMDDHH24MISS')
                    INTO   :WQ01-CONTROLE-ENQ
                    FROM   DUAL
                    WHERE  ROWNUM = 1
                END-EXEC.

           MOVE WQ01-CONTROLE-ENQ            TO WS35-CONTROLE-ENQ.
           
       630-20-EMITE-ENQUEUE.

           EXEC CICS HANDLE CONDITION ENQBUSY(630-55-ERRO-ENQ)
                END-EXEC.

           EXEC CICS ENQ            RESOURCE (WS35-CONTROLE-ENQ)
                                    LENGTH   (14)
                END-EXEC.

           GO                                TO 630-90-REST-HAND-COND.

       630-55-ERRO-ENQ.
       
           MOVE 1                            TO WS33-INTERV-DELAY.
           PERFORM 640-00-EMITE-DELAY.
           GO                                TO 630-10-ADQUIRE-CONTROLE.
           
       630-90-REST-HAND-COND.

           EXEC CICS HANDLE CONDITION ENQBUSY(000-70-ERRO-GERAL-CICS)
                END-EXEC.

       630-99-ENQ-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *              === ROTINA DE COMUNICACAO ===           EFJ 09/07 *
      *                                                                *
      *  EMITE DEQUEUE PARA CONTROLE DE ACESSOS.                       *
      *----------------------------------------------------------------*

       635-00-LIBERA-ENQ-CONTROLE            SECTION.
      *----------------------------------------------*

           EXEC CICS DEQ            RESOURCE (WS35-CONTROLE-ENQ)
                                    LENGTH   (14)
                END-EXEC.

       635-99-ENQ-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *              === ROTINA DE COMUNICACAO ===           EFJ 09/07 *
      *                                                                *
      *  EMITE DELAY PARA CONTROLE DE TEMPO.                           *
      *----------------------------------------------------------------*

       640-00-EMITE-DELAY                    SECTION.
      *----------------------------------------------*

           EXEC CICS DELAY  INTERVAL(WS33-INTERV-DELAY)
                END-EXEC.
           
       640-99-DELAY-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *         ===  ROTINA DE START DE TRANSACAO  ===       EFJ 07/23 *
      *                                                                *
      *   START DE TRANSACAO.                                          *
      *----------------------------------------------------------------*

       645-00-START-SF31                     SECTION.
      *----------------------------------------------*

           EXEC CICS START        TRANSID    ('SF31')
                                  FROM       (WS36-ARE-SF31)
                END-EXEC.

       645-99-START-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 10/00 *
      *                                                                *
      *  TRATAMENTO DOS REGISTROS SELECIONADOS.                        *  
      *----------------------------------------------------------------*
      
       700-00-TRATA-PROTOCOLO                SECTION.
      *----------------------------------------------*

           MOVE '700-00-TRATA-PROTOCOLO'     TO  WS35-AUX-TS.

       700-10-GRAVA-LINHA-NF.

           MOVE ZEROS                        TO WS01-CD-SQN-LNH.

           PERFORM 705-00-MONTA-DANFE.

           INSPECT WS01-CD-SQN-LNH-AUX       CONVERTING SPACES TO ZEROS.

      *    IF WS01-CD-SQN-LNH-AUX  NOT GREATER  ZEROS OR
      *       (WS36-CD-MERC-DST  EQUAL  'E'  AND
      *        ST0001-CD-REGR-FTRM  NOT EQUAL  'J')
      *         IF WS36-CD-MERC-DST  EQUAL  'E'  AND
      *            (WS36-FASE-FTRM  EQUAL  '2'  OR
      *             (WS36-FASE-FTRM  EQUAL  '1' AND
      *              (SF0002-ITD-CD-MOD-TRSP  EQUAL  '4'  OR
      *               SF0002-ITD-CD-MOD-TRSP  EQUAL  '5'  OR
      *               SF0002-ITD-CD-MOD-TRSP  EQUAL  '6')))
      *              MOVE 'P'                TO WS01-T-IMPS
      *              PERFORM 575-00-EMITE-LINK-H1CB5026
      *         END-IF
      *         GO                           TO 700-99-TRATA-FTRM-EXIT.
       
           IF WS01-CD-SQN-LNH-AUX  NOT GREATER  ZEROS OR
              WS36-CD-MERC-DST  EQUAL  'E'
      *       (WS36-CD-MERC-DST  EQUAL  'E'  AND
      *        ST0001-CD-REGR-FTRM  NOT EQUAL  'J')
                GO                           TO 700-99-TRATA-FTRM-EXIT.

           MOVE 'G'                          TO WS01-T-IMPS.
           PERFORM 575-00-EMITE-LINK-H1CB5026.

       700-99-TRATA-FTRM-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 03/09 *
      *                                                                *
      *  MONTAGEM DA DANFE.                                            *  
      *----------------------------------------------------------------*
      
       705-00-MONTA-DANFE                    SECTION.
      *----------------------------------------------*

           MOVE '705-00-MONTA-DANFE'         TO  WS35-AUX-TS.
           
           MOVE 'N'                          TO  WQ01-N.      

           EXEC SQL DECLARE CSR_SEL_A  CURSOR FOR       
                    SELECT PTD_CD_MERC_DST,
                           PTD_DTC_SEL_FTRM,
                           PTD_LGON_FUNC,
                           PTD_CD_SEQ,
                           PTD_CD_T_REC,
                           PTD_CD_T_MTZ,
                           PTD_ID_MTZ,
                           PTD_ID_CLI,
                           PTD_ID_PTC_DSP,
                           LTRIM(TO_CHAR(TO_NUMBER(
                                 PTD_ID_PTC_DSP),
                                 '9,999,999')),
                           TO_CHAR(PTD_DTC_PTC_DSP,'DD/MM/YYYY - HH24')
                                   || 'h'
                                   || TO_CHAR(PTD_DTC_PTC_DSP,'MI'),
                           PTD_CD_PGT_FRT,
                           DECODE(PTD_CD_TRSR,'-',NULL,PTD_CD_TRSR),
                           LTRIM(TO_CHAR(TO_NUMBER(
                                 PTD_PESO_TTL_LQD)/1000,
                                 '9,999,999,990.000') || 'Kg'),
                           TO_NUMBER(TO_CHAR(TO_NUMBER(
                                 PTD_PESO_TTL_LQD)/1000,
                                 '9999999990.000')),
                           LTRIM(TO_CHAR(TO_NUMBER(
                                 PTD_PESO_TTL_BRT)/1000,
                                 '9,999,999,990.000') || 'Kg'),
                           TO_NUMBER(TO_CHAR(TO_NUMBER(
                                 PTD_PESO_TTL_BRT)/1000,
                                 '9999999990.000')),
                           LTRIM(TO_CHAR(TO_NUMBER(
                                PTD_PESO_TTL_BRT-PTD_PESO_TTL_LQD)/1000,
                                 '9,999,999,990.000') || 'Kg'),
                           TO_NUMBER(TO_CHAR(TO_NUMBER(
                                PTD_PESO_TTL_BRT-PTD_PESO_TTL_LQD)/1000,
                                 '9999999990.000')),
                           LTRIM(TO_CHAR(PTD_Q_TTL_VOL)),
                           PTD_Q_TTL_VOL,
                           LTRIM(
                                 'R$' || 
                                 TO_CHAR(TO_NUMBER(
                                 PTD_V_TTL_MRCD)/100,
                                 '99,999,999,990.00')),
                           TO_NUMBER(TO_CHAR(TO_NUMBER(
                                PTD_V_TTL_MRCD)/100,
                                 '99999999990.00')),
                           PTD_IC_DSP_IMPS
                    FROM   H1SF.PTD_PROTODSP
                    WHERE  PTD_CD_MERC_DST  = :WQ02-CD-MERC-DST   AND
                           PTD_DTC_SEL_FTRM = :WQ02-DTC-SEL-FTRM  AND
                           PTD_LGON_FUNC    = :WQ02-LGON-FUNC     AND
                           PTD_IC_DSP_IMPS  = :WQ01-N
                    ORDER  BY  PTD_CD_MERC_DST,
                               PTD_DTC_SEL_FTRM,
                               PTD_LGON_FUNC,
                               PTD_CD_T_REC,
                               PTD_CD_T_MTZ,
                               PTD_ID_MTZ,
                               PTD_ID_CLI,
                               PTD_ID_PTC_DSP
                END-EXEC.

           EXEC SQL OPEN   CSR_SEL_A 
                END-EXEC. 
                
       705-05-LOOP-PROTOCOLO.
       
           EXEC SQL FETCH  CSR_SEL_A
                    INTO   :SF0001-PTD-CD-MERC-DST,
                           :SF0001-PTD-DTC-SEL-FTRM,
                           :SF0001-PTD-LGON-FUNC,
                           :SF0001-PTD-CD-SEQ,
                           :SF0001-PTD-CD-T-REC,
                           :SF0001-PTD-CD-T-MTZ,
                           :SF0001-PTD-ID-MTZ,
                           :SF0001-PTD-ID-CLI,
                           :SF0001-PTD-ID-PTC-DSP,
                           :SF0001-PTD-ID-PTC-DSP-E,
                           :SF0001-PTD-DTC-PTC-DSP,
                           :SF0001-PTD-CD-PGT-FRT,
                           :SF0001-PTD-CD-TRSR   :WI01-PTD-CD-TRSR,
                           :SF0001-PTD-PESO-TTL-LQD,
                           :SF0001-PTD-PESO-TTL-LQD-LOG,
                           :SF0001-PTD-PESO-TTL-BRT,
                           :SF0001-PTD-PESO-TTL-BRT-LOG,
                           :SF0001-PTD-PESO-TTL-EMB,
                           :SF0001-PTD-PESO-TTL-EMB-LOG,
                           :SF0001-PTD-Q-TTL-VOL,
                           :SF0001-PTD-Q-TTL-VOL-LOG,
                           :SF0001-PTD-V-TTL-MRCD,
                           :SF0001-PTD-V-TTL-MRCD-LOG,
                           :SF0001-PTD-IC-DSP-IMPS
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                           TO 705-95-FECHA-CURSOR-A.

           IF WI01-PTD-CD-TRSR  GREATER  -1
                INSPECT SF0001-PTD-CD-TRSR   CONVERTING SPACES TO ZEROS
           ELSE
                MOVE SPACES                  TO SF0001-PTD-CD-TRSR.

           INSPECT SF0001-PTD-ID-PTC-DSP     CONVERTING SPACES TO ZEROS.

           MOVE ZEROS                        TO WS01-PRECO-TOTAL-M-TOT
                                                WS01-PESO-BRUTO-KG-TOT
                                                WS01-PESO-LIQUIDO-KG-TOT
                                                WS01-TOT-VOL-CONF.

           EXEC SQL SELECT 1
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                      AND  ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                      AND  ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                      AND  ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                      AND  ROWNUM           = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                EXEC SQL UPDATE H1SF.PTD_PROTODSP
                        SET    PTD_IC_DSP_IMPS  = 'S'
                        WHERE  PTD_CD_MERC_DST  = :WQ02-CD-MERC-DST 
                          AND  PTD_DTC_SEL_FTRM = :WQ02-DTC-SEL-FTRM
                          AND  PTD_LGON_FUNC    = :WQ02-LGON-FUNC  
                          AND  PTD_CD_T_REC     = :SF0001-PTD-CD-T-REC
                          AND  PTD_CD_T_MTZ     = :SF0001-PTD-CD-T-MTZ
                          AND  PTD_ID_MTZ       = :SF0001-PTD-ID-MTZ
                          AND  PTD_ID_CLI       = :SF0001-PTD-ID-CLI
                          AND  PTD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                     END-EXEC
                GO                           TO 705-05-LOOP-PROTOCOLO.

           EXEC SQL SELECT MIN(ITD_ID_NF),
                           MAX(ITD_ID_NF)
                    INTO   :WQ01-MENOR-DANFE,
                           :WQ01-MAIOR-DANFE
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                      AND  ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                      AND  ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                      AND  ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                END-EXEC.

           INSPECT WQ01-MENOR-DANFE          CONVERTING SPACES TO ZEROS.
           INSPECT WQ01-MAIOR-DANFE          CONVERTING SPACES TO ZEROS.

           IF WS36-CD-MERC-DST  EQUAL  'E'  OR
              (WS36-CD-MERC-DST  EQUAL  'D'  AND
               WS36-FASE-FTRM  EQUAL  '1'  AND
               SF0005-SFT-IC-FTRM-TRGD  EQUAL  'S')
                EXEC SQL SELECT ITD_ID_MTZ,
                                ITD_ID_CLI
                         INTO   :WQ01-ID-MTZ-AUX,
                                :WQ01-ID-CLI-AUX
                         FROM   H1SF.ITD_ITMFATURADO
                         WHERE  ITD_CD_MERC_DST
                                               = :SF0001-PTD-CD-MERC-DST
                           AND  ITD_DTC_SEL_FTRM
                                              = :SF0001-PTD-DTC-SEL-FTRM
                           AND  ITD_LGON_FUNC
                                              = :SF0001-PTD-LGON-FUNC
                           AND  ITD_ID_PTC_DSP
                                              = :SF0001-PTD-ID-PTC-DSP
                           AND  ROWNUM        = 1
                     END-EXEC
           ELSE
                MOVE SF0001-PTD-ID-MTZ       TO WQ01-ID-MTZ-AUX
                MOVE SF0001-PTD-ID-CLI       TO WQ01-ID-CLI-AUX.

           PERFORM 605-00-VERIFICA-CME.
           
           IF WS36-CD-MERC-DST  EQUAL  'E'
                PERFORM 608-00-RECUPERA-DADOS-S.

           EXEC SQL DECLARE CSR_SEL_B  CURSOR FOR       
                    SELECT ITD_CD_MERC_DST,
                           ITD_DTC_SEL_FTRM,
                           ITD_LGON_FUNC,
                           ITD_CD_SEQ
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                      AND  ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                      AND  ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                      AND  ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                    GROUP  BY ITD_CD_MERC_DST,
                              ITD_DTC_SEL_FTRM,
                              ITD_LGON_FUNC,
                              ITD_CD_SEQ
                    ORDER  BY ITD_CD_MERC_DST,
                              ITD_DTC_SEL_FTRM,
                              ITD_LGON_FUNC,
                              ITD_CD_SEQ
                END-EXEC.

           EXEC SQL OPEN   CSR_SEL_B 
                END-EXEC. 

       705-20-LOOP-ITEM-FTRD.

           EXEC SQL FETCH  CSR_SEL_B
                    INTO   :SF0002-ITD-CD-MERC-DST,
                           :SF0002-ITD-DTC-SEL-FTRM,
                           :SF0002-ITD-LGON-FUNC,
                           :SF0002-ITD-CD-SEQ
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                           TO 705-80-CLOSE-ITEM-FTRD.
                
           MOVE 'BPIS'                       TO WQ01-DOF-CD-SISTEMA.      
           MOVE SF0002-ITD-CD-MERC-DST       TO WQ01-DOF-CD-MERC-DST.      
           MOVE SF0002-ITD-DTC-SEL-FTRM      TO WQ01-DOF-DTC-SEL-FTRM.      
           MOVE SF0002-ITD-LGON-FUNC         TO WQ01-DOF-LGON-FUNC.
           MOVE WS36-FASE-FTRM               TO WQ01-DOF-FASE-FTRM.
           MOVE SF0002-ITD-CD-SEQ            TO WQ01-DOF-CD-SEQ.
           MOVE SPACES                       TO WQ01-DOF-FILL.
                
      *    MOVE 'SF'                         TO  WQ01-2.      
      *    MOVE 'CBL02'                      TO  WQ01-5.      

           IF ST0001-CD-T-ATND  EQUAL  'ESTOQUE FGW' OR
              ST0001-CD-T-ATND  EQUAL  'EMERGENCIA FGW'
                MOVE 'FG'                    TO WQ01-2
           ELSE
                MOVE 'SF'                    TO WQ01-2.

           EXEC SQL AT CCPR
                    SELECT A.DOF_SEQUENCE,
                           A.IND_ENTRADA_SAIDA,
                           A.PRECO_TOTAL_M,
                           TO_CHAR(A.PRECO_TOTAL_M,
                                  '99,999,999,990.00'),
                           A.PRECO_TOTAL_M,
                           A.SERIE_SUBSERIE,
                           TO_CHAR(A.CTP_VL_TOTAL_DESCONTO,
                                  '99,999,999,990.00'),
                           A.CTP_VL_TOTAL_DESCONTO,
                           LTRIM(TO_CHAR(A.CTP_VL_TOTAL_DESCONTO,
                                  '00000000000V00')),
                           A.VL_AJUSTE_PRECO_TOTAL_M,
                           A.VL_FRETE,
                           A.VL_SEGURO,
                           TO_CHAR(A.VL_OUTRAS_DESPESAS,
                                  '99,999,999,990.00'),
                           A.VL_OUTRAS_DESPESAS,
                           TO_CHAR((A.CTP_VL_TOTAL_ODA+
                                    A.CTP_VL_TOTAL_FRETE),
                                  '99,999,999,990.00'),
                           TO_CHAR(A.VL_FISCAL_M,
                                  '99,999,999,990.00'),
                           TO_CHAR((A.PRECO_TOTAL_M - A.VL_FISCAL_M),
                                  '99,999,999,990.00'),
                           TO_CHAR(((A.CTP_VL_TOTAL_ODA+
                                     A.CTP_VL_TOTAL_FRETE)* 
                                   TRUNC(0.93,2)),
                                  '99,999,999,990.00'),
                           TO_CHAR(((A.CTP_VL_TOTAL_ODA+
                                     A.CTP_VL_TOTAL_FRETE) -
                                   ((A.CTP_VL_TOTAL_ODA+
                                     A.CTP_VL_TOTAL_FRETE) * 
                                   TRUNC(0.93,2))),
                                  '99,999,999,990.00'),
                           TO_CHAR(A.VL_SEGURO,
                                  '99,999,999,990.00'),
                           TO_CHAR(A.VL_TOTAL_BASE_ICMS,
                                  '99,999,999,990.00'),
                           A.VL_TOTAL_BASE_ICMS,
                           TO_CHAR(A.VL_TOTAL_BASE_STF,
                                  '99,999,999,990.00'),
                           A.VL_TOTAL_BASE_STF,
                           A.VL_TOTAL_CONTABIL,
                           TO_CHAR(A.VL_TOTAL_CONTABIL,
                                  '99,999,999,990.00'),
                           A.VL_TOTAL_CONTABIL,
                           A.VL_TOTAL_ICMS,
                           TO_CHAR(A.VL_TOTAL_ICMS,
                                  '99,999,999,990.00'),
                           A.VL_TOTAL_ICMS,
                           TO_CHAR(A.VL_TOTAL_IPI,
                                  '99,999,999,990.00'),
                           A.VL_TOTAL_IPI,
                           TO_CHAR(A.VL_TOTAL_STF,
                                  '99,999,999,990.00'),
                           A.VL_TOTAL_STF,
                           A.VL_TOTAL_PIS_PASEP,
                           A.VL_TOTAL_COFINS,
                           A.CFOP_CODIGO,
                           REPLACE(A.CFOP_CODIGO,'.'),
                           TO_CHAR(A.DH_EMISSAO,'DD/MM/YYYY'),
                           TO_CHAR(A.DH_EMISSAO,'YYYYMMDD'),
                           TO_CHAR(A.DH_EMISSAO,'YYYY/MM/DD'),
                           A.IND_RESP_FRETE,
                           A.NUMERO,
                           LTRIM(TO_CHAR(A.NUMERO,'00000')),
                           LTRIM(TO_CHAR(A.NUMERO,'000000')),
                           LTRIM(TO_CHAR(A.NUMERO,'000000000')),
                           A.PESO_BRUTO_KG,
                           TO_CHAR(A.PESO_BRUTO_KG,
                                  '9,999,999,990.000'),
                           TRUNC(A.PESO_BRUTO_KG,3),
                           LTRIM(TO_CHAR(A.PESO_BRUTO_KG,
                                  '000000000V00000')),
                           A.PESO_LIQUIDO_KG,
                           TO_CHAR(A.PESO_LIQUIDO_KG,
                                  '9,999,999,990.000'),
                           A.TRANSPORTADOR_PFJ_CODIGO,
                           A.PLACA_VEICULO_UF_CODIGO,
                           A.NUM_PLACA_VEICULO,
                           A.NOP_CODIGO,
                           LTRIM(TO_CHAR(A.VL_TOTAL_BASE_IPI,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_TOTAL_BASE_IPI,
                                  '00000000000V00')),
                           LTRIM(TO_CHAR(A.VL_TOTAL_BASE_ICMS,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_TOTAL_BASE_ICMS,
                                  '00000000000V00')),
                           LTRIM(TO_CHAR(A.VL_TOTAL_BASE_STF,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_TOTAL_BASE_STF,
                                  '00000000000V00')),
                           LTRIM(TO_CHAR(A.VL_TOTAL_BASE_ISS,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_TOTAL_IPI,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_TOTAL_IPI,
                                  '00000000000V00')),
                           LTRIM(TO_CHAR(A.VL_TOTAL_ICMS,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_TOTAL_ICMS,
                                  '00000000000V00')),
                           LTRIM(TO_CHAR(A.VL_TOTAL_STF,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_TOTAL_STF,
                                  '00000000000V00')),
                           LTRIM(TO_CHAR(A.VL_TOTAL_IRRF,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_FRETE,
                                  '0000000000000000V00')),
                           TO_CHAR(A.VL_FRETE,
                                  '99,999,999,990.00'),
                           LTRIM(TO_CHAR(A.VL_FRETE,
                                  '00000000000V00')),
                           LTRIM(TO_CHAR(A.VL_OUTRAS_DESPESAS,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_OUTRAS_DESPESAS,
                                  '00000000000V00')),
                           LTRIM(TO_CHAR(A.VL_SEGURO,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.PRECO_TOTAL_M,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.PRECO_TOTAL_M,
                                  '00000000000V00')),
                           LTRIM(TO_CHAR(A.VL_TOTAL_CONTABIL,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_TOTAL_CONTABIL,
                                  '00000000000V00')),
                           B.DESCRICAO_RESUMIDA,
                           C.RAZAO_SOCIAL,
                           C.CPF_CGC,
                           'CGC ' || C.CPF_CGC,
                           C.LOGRADOURO || ', n. ' || C.NUMERO || ', '
                                                       || C.COMPLEMENTO,
                           C.LOGRADOURO ||
                           DECODE(C.NUMERO, '', '', ', ' || C.NUMERO),
                           C.COMPLEMENTO,
                           DECODE(C.BAIRRO, '', '', C.BAIRRO || ', ') ||
                           C.MUN_NOME || ', ' ||
                           C.UF_CODIGO,
                           C.BAIRRO,
                           C.CEP,
                           C.MUN_NOME,
                           C.MUN_NOME || ' - ' || C.UF_CODIGO,
                           C.TELEFONE1,
                           C.UF_CODIGO,
                           C.PAIS,
                           C.INSCR_ESTADUAL,
                           'Inscricao Estadual ' || C.INSCR_ESTADUAL,
                           D.RAZAO_SOCIAL,
                           D.CPF_CGC,
                           DECODE(D.LOGRADOURO,NULL,NULL,
                                  (D.LOGRADOURO || ', ' 
                                                || D.NUMERO || ' '
                                                || D.CEP || ', '
                                                || D.BAIRRO)),
                           D.MUN_NOME,
                           D.UF_CODIGO,
                           D.INSCR_ESTADUAL,
                           NVL(LTRIM(A.SUBSTITUIDO_PFJ_CODIGO),' '),
                           A.NFE_CONTINGENCIA,
                           A.NFE_COD_SITUACAO,
                           A.NFE_LOCALIZADOR,
                           TO_CHAR(A.DT_SAIDA_MERCADORIAS,'DD/MM/YYYY'),
                           A.NFE_PROTOCOLO,
                           TO_CHAR(A.CTRL_DT_ULT_ALTERACAO,
                                               'DD/MM/YYYY HH24:MI:SS'),
                           UF_CODIGO_EMITENTE,
                           NVL(A.VL_TOTAL_FCP_ST,0)
                    INTO   :CC0001-DOF-SEQUENCE,
                           :CC0001-IND-ENTRADA-SAIDA,
                           :CC0001-PRECO-TOTAL-M,
                           :WM01-PRECO-TOTAL-M,
                           :CC0001-PRECO-TOTAL-M-LOG,
                           :CC0001-SERIE-SUBSERIE,
                           :WM01-VL-AJUSTE-PRECO-TOTAL-M,
                           :CC0001-VL-DESCONTO-LOG,
                           :CC0001-VL-DESCONTO-DEA,
                           :CC0001-VL-AJUSTE-PRECO-TOTAL-M,
                           :CC0001-VL-FRETE-LOG,
                           :CC0001-VL-SEGURO-LOG,
                           :WM01-VL-OUTRAS-DESPESAS,
                           :CC0001-VL-OUTRAS-DESPESAS-LOG,
                           :WM01-VL-OUTRAS-FRETE,
                           :WM01-VL-MANAUS-A,
                           :WM01-VL-MANAUS-B,
                           :WM01-VL-MANAUS-C,
                           :WM01-VL-MANAUS-D,
                           :WM01-VL-SEGURO,
                           :WM01-VL-TOTAL-BASE-ICMS,
                           :CC0001-VL-TOTAL-BASE-ICMS-LOG,
                           :WM01-VL-TOTAL-BASE-STF,
                           :CC0001-VL-TOTAL-BASE-STF-LOG,
                           :CC0001-VL-TOTAL-CONTABIL,
                           :WM01-VL-TOTAL-CONTABIL,
                           :CC0001-VL-TOTAL-CONTABIL-LOG,
                           :CC0001-VL-TOTAL-ICMS,
                           :WM01-VL-TOTAL-ICMS,
                           :CC0001-VL-TOTAL-ICMS-LOG,
                           :WM01-VL-TOTAL-IPI,
                           :CC0001-VL-TOTAL-IPI-LOG,
                           :WM01-VL-TOTAL-STF,
                           :CC0001-VL-TOTAL-STF-LOG,
                           :CC0001-VL-TOTAL-PIS-PASEP-LOG,
                           :CC0001-VL-TOTAL-COFINS-LOG,
                           :CC0001-CFOP-CODIGO        :WI01-CFOP-CODIGO,
                           :CC0001-CFOP-CODIGO-LOG    :WI01-CFOP-CODIGO,
                           :CC0001-DH-EMISSAO          :WI01-DH-EMISSAO,
                           :CC0001-DH-EMISSAO-BARRA    :WI01-DH-EMISSAO,
                           :CC0001-DH-EMISSAO-I        :WI01-DH-EMISSAO,
                           :CC0001-IND-RESP-FRETE  :WI01-IND-RESP-FRETE,
                           :CC0001-NUMERO                  :WI01-NUMERO,
                           :CC0001-NUMERO-CTB              :WI01-NUMERO,
                           :CC0001-NUMERO-CTB-6            :WI01-NUMERO,
                           :CC0001-NUMERO-DEA              :WI01-NUMERO,
                           :CC0001-PESO-BRUTO-KG    :WI01-PESO-BRUTO-KG,
                           :WM01-PESO-BRUTO-KG      :WI01-PESO-BRUTO-KG,
                           :CC0001-PESO-BRUTO-KG-LOG
                                                    :WI01-PESO-BRUTO-KG,
                           :CC0001-PESO-BRUTO-KG-DEA
                                                    :WI01-PESO-BRUTO-KG,
                           :CC0001-PESO-LIQUIDO-KG
                                                  :WI01-PESO-LIQUIDO-KG,
                           :WM01-PESO-LIQUIDO-KG 
                                                  :WI01-PESO-LIQUIDO-KG,
                           :CC0001-TRANSPORTADOR-PFJ-COD
                                            :WI01-TRANSPORTADOR-PFJ-COD,
                           :CC0001-PLACA-VEICULO-UF-CODIGO
                                          :WI01-PLACA-VEICULO-UF-CODIGO,
                           :CC0001-NUM-PLACA-VEICULO 
                                                :WI01-NUM-PLACA-VEICULO,
                           :CC0001-NOP-CODIGO   :WI01-NOP-CODIGO,
                           :CC0001-VL-TOTAL-BASE-IPI-CTB,
                           :CC0001-VL-TOTAL-BASE-IPI-DEA,
                           :CC0001-VL-TOTAL-BASE-ICMS-CTB,
                           :CC0001-VL-TOTAL-BASE-ICMS-DEA,
                           :CC0001-VL-TOTAL-BASE-STF-CTB,
                           :CC0001-VL-TOTAL-BASE-STF-DEA,
                           :CC0001-VL-TOTAL-BASE-ISS-CTB,
                           :CC0001-VL-TOTAL-IPI-CTB,
                           :CC0001-VL-TOTAL-IPI-DEA,
                           :CC0001-VL-TOTAL-ICMS-CTB,
                           :CC0001-VL-TOTAL-ICMS-DEA,
                           :CC0001-VL-TOTAL-STF-CTB,
                           :CC0001-VL-TOTAL-STF-DEA,
                           :CC0001-VL-TOTAL-IRRF-CTB,
                           :CC0001-VL-FRETE-CTB,
                           :WM01-VL-FRETE,
                           :CC0001-VL-FRETE-DEA,
                           :CC0001-VL-OUTRAS-DESPESAS-CTB,
                           :CC0001-VL-OUTRAS-DESPESAS-DEA,
                           :CC0001-VL-SEGURO-CTB,
                           :CC0001-PRECO-TOTAL-M-CTB,
                           :CC0001-PRECO-TOTAL-M-DEA,
                           :CC0001-VL-TOTAL-CONTABIL-CTB,
                           :CC0001-VL-TOTAL-CONTABIL-DEA,
                           :CC0003-DESCRICAO-RESUMIDA,
                           :CC0004-RAZAO-SOCIAL,
                           :CC0004-CPF-CGC                :WI01-CPF-CGC,
                           :CC0004-CPF-CGC-E              :WI01-CPF-CGC,
                           :CC0004-ENDERECO,
                           :CC0004-ENDERECO-EPD,
                           :CC0004-COMPLEMENTO-EPD 
                                                  :WI01-COMPLEMENTO-EPD,
                           :CC0004-BAIRRO-MUN-NOME-UF-EPD,
                           :CC0004-BAIRRO                  :WI01-BAIRRO,
                           :CC0004-CEP                        :WI01-CEP,
                           :CC0004-MUN-NOME              :WI01-MUN-NOME,
                           :CC0004-MUN-NOME-E            :WI01-MUN-NOME,
                           :CC0004-TELEFONE1            :WI01-TELEFONE1,
                           :CC0004-UF-CODIGO            :WI01-UF-CODIGO,
                           :CC0004-PAIS                 :WI01-PAIS,
                           :CC0004-INSCR-ESTADUAL  :WI01-INSCR-ESTADUAL,
                           :CC0004-INSCR-ESTADUAL-E
                                                   :WI01-INSCR-ESTADUAL,
                           :CC0005-RAZAO-SOCIAL      :WI01-RAZAO-SOCIAL,
                           :CC0005-CPF-CGC                :WI01-CPF-CGC,
                           :CC0005-ENDERECO              :WI01-ENDERECO,
                           :CC0005-MUN-NOME              :WI01-MUN-NOME,
                           :CC0005-UF-CODIGO            :WI01-UF-CODIGO,
                           :CC0005-INSCR-ESTADUAL  :WI01-INSCR-ESTADUAL,
                           :CC0001-SUBSTITUIDO-PFJ-CODIGO,
                           :CC0001-NFE-CONTINGENCIA 
                                                 :WI01-NFE-CONTINGENCIA,
                           :CC0001-NFE-COD-SITUACAO
                                                 :WI01-NFE-COD-SITUACAO,
                           :CC0001-NFE-LOCALIZADOR
                                                 :WI01-NFE-LOCALIZADOR,
                           :CC0001-DT-SAIDA-MERCADORIAS
                                             :WI01-DT-SAIDA-MERCADORIAS,
                           :CC0001-NFE-PROTOCOLO :WI01-NFE-PROTOCOLO,
                           :CC0001-CTRL-DT-ULT-ALTERACAO
                                            :WI01-CTRL-DT-ULT-ALTERACAO,
                           :CC0001-UF-CODIGO-EMITENTE
                                               :WI01-UF-CODIGO-EMITENTE,
                           :CC0001-VL-TOTAL-FCP-ST                    
                    FROM   B8CC.COR_DOF A,
                           B8CC.COR_NATUREZA_DE_OPERACAO B,
                           B8CC.COR_PESSOA_VIGENTE C,
                           B8CC.COR_PESSOA_VIGENTE D,
                           B8CC.COR_PESSOA E,
                           B8CC.COR_LOCALIDADE_VIGENCIA F,
                           B8CC.COR_MUNICIPIO G,
                           B8CC.COR_PESSOA H,
                           B8CC.COR_LOCALIDADE_VIGENCIA I,
                           B8CC.COR_MUNICIPIO J
                    WHERE  A.NOP_CODIGO = B.NOP_CODIGO
                      AND  A.DESTINATARIO_PFJ_CODIGO = C.PFJ_CODIGO
                      AND  NVL(A.TRANSPORTADOR_PFJ_CODIGO,'-') =
                                                   D.PFJ_CODIGO(+)
                      AND  E.PFJ_CODIGO = F.PFJ_CODIGO
                      AND  F.MUN_CODIGO = G.MUN_CODIGO
                      AND  E.PFJ_CODIGO = C.PFJ_CODIGO
                      AND  F.LOC_CODIGO = C.LOC_CODIGO
                      AND  C.UF_CODIGO  = G.UF_CODIGO
                      AND  F.DT_INICIO <= SYSDATE
                      AND  (F.DT_FIM   >= SYSDATE
                      OR    F.DT_FIM   IS NULL)
                      AND  NVL(H.PFJ_CODIGO,'-') = I.PFJ_CODIGO(+)
                      AND  NVL(I.MUN_CODIGO,'-') = J.MUN_CODIGO(+)
                      AND  H.PFJ_CODIGO(+) = NVL(D.PFJ_CODIGO,'-')
                      AND  I.LOC_CODIGO(+) = NVL(D.LOC_CODIGO,'-')
                      AND  NVL(D.UF_CODIGO,'-')  = J.UF_CODIGO(+)
                      AND  (NVL(A.TRANSPORTADOR_PFJ_CODIGO,'-') = '-'
                      OR    (NVL(A.TRANSPORTADOR_PFJ_CODIGO,'-') <> '-'
                      AND    I.DT_INICIO <= SYSDATE
                      AND    (I.DT_FIM   >= SYSDATE
                      OR      I.DT_FIM   IS NULL)))
                      AND  A.DOF_IMPORT_NUMERO = :WQ01-DOF-IMPOR-NUMERO
                      AND  A.SIS_CODIGO = :WQ01-2 
                      AND  A.INFORMANTE_EST_CODIGO = :CB0004-ID-CNPJ
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - DANFE NAO ENCONTRADO  ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WQ01-DOF-IMPOR-NUMERO   TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.               

           IF WI01-IND-RESP-FRETE  EQUAL  -1
                MOVE '9'                     TO CC0001-IND-RESP-FRETE.

           IF WI01-TRANSPORTADOR-PFJ-COD  EQUAL  -1
                MOVE SPACES                  TO CC0005-RAZAO-SOCIAL
                                                CC0005-CPF-CGC
                                                CC0005-ENDERECO
                                                CC0005-MUN-NOME
                                                CC0005-UF-CODIGO
                                                CC0005-INSCR-ESTADUAL.

           IF ST0001-CD-REGR-FTRM  EQUAL  'N'
                IF WI01-NFE-LOCALIZADOR  NOT GREATER  -1
                     MOVE ZEROS              TO CC0001-NFE-LOCALIZADOR
                END-IF
                IF WI01-NUMERO  NOT GREATER  -1
                     MOVE WQ01-DOF-CD-SEQ    TO CC0001-NUMERO
                                                CC0001-NUMERO-CTB
                                                CC0001-NUMERO-CTB-6
                                                CC0001-NUMERO-DEA
                END-IF.
           
           IF WS36-CD-MERC-DST  EQUAL  'E'
                EXEC SQL AT CCPR
                         SELECT SUM(ABS(VL_AJUSTE_PRECO_TOTAL)),
                                TO_CHAR(SUM(ABS(VL_AJUSTE_PRECO_TOTAL)),
                                      '99,999,999,990.00'),
                                SUM(PRECO_TOTAL),
                                SUM(PRECO_TOTAL),
                                TO_CHAR(SUM(PRECO_TOTAL), 
                                      '99,999,999,990.00'),
                                LTRIM(TO_CHAR(SUM(PRECO_TOTAL),
                                      '0000000000000000V00')),
                                LTRIM(TO_CHAR(SUM(PRECO_TOTAL),
                                      '00000000000V00'))
                         INTO   :CC0001-VL-AJUSTE-PRECO-TOTAL-M,
                                :WM01-VL-AJUSTE-PRECO-TOTAL-M,
                                :CC0001-PRECO-TOTAL-M,
                                :CC0001-PRECO-TOTAL-M-LOG,
                                :WM01-PRECO-TOTAL-M,
                                :CC0001-PRECO-TOTAL-M-CTB,
                                :CC0001-PRECO-TOTAL-M-DEA
                         FROM   B8CC.COR_IDF
                         WHERE  DOF_SEQUENCE = :CC0001-DOF-SEQUENCE
                     END-EXEC

                IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                     MOVE 
                     '*** ERRO - VALORES DO DANFE NAO ENCONTRADOS  ===>'
                                             TO WS35-MSG-ERRO-LIT
                     MOVE WQ01-DOF-IMPOR-NUMERO
                                             TO WS35-MSG-ERRO-VAR
                     MOVE WS35-MSG-ERRO      TO ACB5010-MSG-ERRO
                     MOVE 'H1SF0033'         TO WS35-ID-PGM
                     PERFORM 900-00-REGISTRA-ERRO-TRNS.

           EXEC SQL AT CCPR
                    SELECT ESPECIE_VOLUMES,
                           MARCA_VOLUMES,
                           QTD_VOLUMES
                    INTO   :CC0010-ESPECIE-VOLUMES,
                           :CC0010-MARCA-VOLUMES,
                           :CC0010-QTD-VOLUMES
                    FROM   B8CC.COR_DOF_VOLUME_CARGA
                    WHERE  DOF_SEQUENCE = :CC0001-DOF-SEQUENCE
                    AND    ROWNUM       = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - DADOS DE VOLUME NAO ENCONTRADOS  ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WQ01-DOF-IMPOR-NUMERO   TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.

      *    ADD CC0001-PRECO-TOTAL-M          TO WS01-PRECO-TOTAL-M-TOT.
           ADD CC0001-VL-TOTAL-CONTABIL      TO WS01-PRECO-TOTAL-M-TOT.
           ADD CC0001-PESO-BRUTO-KG          TO WS01-PESO-BRUTO-KG-TOT.
           ADD CC0001-PESO-LIQUIDO-KG        TO
                                               WS01-PESO-LIQUIDO-KG-TOT.

           MOVE CC0001-NUMERO-DEA            TO WS01-ID-NUM-CNT.
           MOVE ZEROS                        TO WS01-ID-NUM-T-REG.

           PERFORM 607-00-VERIFICA-DEA.

           PERFORM 770-00-TROCA-PONTO-CORPO.

           PERFORM 750-00-PREPARA-DETALHE-DANFE.

           PERFORM 760-00-PREPARA-RESUMO-DANFE.

           IF SF0001-PTD-ID-PTC-DSP NOT EQUAL WS01-PTD-ID-PTC-DSP-ANT
                IF WS36-CD-MERC-DST  EQUAL  'D'  AND
                   WS36-FASE-FTRM  EQUAL  '2'
                     PERFORM 135-00-DEFINE-PJL-OUTBIN-S
                END-IF
                IF CC0001-NFE-CONTINGENCIA  EQUAL  'S'  OR
                   CC0001-NFE-COD-SITUACAO  EQUAL  'SYN027'
                     PERFORM 130-00-DEFINE-PJL-OUTBIN-S
                END-IF
                PERFORM 140-00-DEFINE-PJL-OUTBIN-P
                MOVE SF0001-PTD-ID-PTC-DSP   TO WS01-PTD-ID-PTC-DSP-ANT.
      
           PERFORM 550-00-GRAVA-RESUMO-REL.

       705-30-MONTA-PCL.

           MOVE ZEROS                        TO WS01-ID-VIA
                                                WS32-IND-IMPR
                                                WS32-IND-VIAS
                                                WS01-NUM-PAG-AUX
                                                WS01-TTL-PAG-AUX.

           MOVE SPACES                       TO WS01-ARE-IMPRESSAO.

           MOVE 'S'                          TO WS31-CHV-CARREGA-TAB.

           ADD 1                             TO WS01-ID-VIA.
           
           MOVE 'N'                          TO WS01-IC-PAG-ADIC.

           PERFORM 745-00-PCL-DANFE.

           EXEC SQL AT CCPR DECLARE CSR_SEL_C  CURSOR FOR       
                    SELECT A.IDF_NUM,
                           TO_CHAR(A.ALIQ_ICMS,'999V99'),
                           TO_CHAR(A.ALIQ_ICMS,'990.00'),
                           TO_CHAR(A.ALIQ_IPI,'999V99'),
                           TO_CHAR(A.ALIQ_IPI,'990.00'),
                           LTRIM(TO_CHAR(A.ALIQ_IPI,'00V00')),
                           TO_CHAR(A.PRECO_TOTAL,
                                  '99,999,999,990.00'),
                           LTRIM(TO_CHAR(A.PRECO_TOTAL+A.VL_IPI,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.PRECO_TOTAL,
                                  '00000000000000V0000')),
                           LTRIM(TO_CHAR(A.PRECO_TOTAL,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.PRECO_TOTAL,
                                  '00000000000V00')),
                           DECODE(:CB0004-CD-T-PRD,'C',
                                   SUBSTR(TO_CHAR(
                                           A.PRECO_UNITARIO,
                                           '999,990.00000')
                                                     ,2,13),
                                   TO_CHAR(A.PRECO_UNITARIO,
                                             '9,999,990.00')),
                           TO_CHAR(A.PRECO_UNITARIO,
                                  '999999999V99'),
                           LTRIM(TO_CHAR(A.PRECO_UNITARIO,
                                  '000000000000V0000')),
                           LTRIM(TO_CHAR(A.PRECO_UNITARIO,
                                  '00000000000000V0000')),
                           LTRIM(TO_CHAR(A.PRECO_UNITARIO,
                                  '00000000000V00')),
                           A.QTD,
                           LTRIM(TO_CHAR(A.QTD,
                                  '00000')),
                           TO_CHAR(A.VL_IPI,
                                  '99,999,999,990.00'),
                           TO_CHAR(A.VL_IPI,
                                  '9999999V99'),
                           LTRIM(TO_CHAR(A.VL_BASE_IPI,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_IPI,
                                  '00000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_IPI,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_IPI,
                                  '00000000000V00')),
                           A.ENTSAI_UNI_CODIGO,
                           A.IDF_TEXTO_COMPLEMENTAR,
                           TRIM(SUBSTR(
                                A.IDF_TEXTO_COMPLEMENTAR,1,63)) ||
                                 SUBSTR(A.IDF_TEXTO_COMPLEMENTAR,64) ||
                                           TRIM(DECODE(
                                           C.FAT_CONV_UNI_BAS_MERC,1,'',
                                           ' | V. Un. Trib. = ' ||
                                           REPLACE(ROUND(
                                           A.PRECO_UNITARIO/
                                           C.FAT_CONV_UNI_BAS_MERC,10),
                                                             '.',','))),
                           SUBSTR(A.MERC_CODIGO,1,3) || '-' ||
                                  SUBSTR(A.MERC_CODIGO,4,17),
                           A.MERC_CODIGO,
                           A.NBM_CODIGO,
                           SUBSTR(A.NBM_CODIGO,3,4) || '.' ||
                                  SUBSTR(A.NBM_CODIGO,7,2) || '.' ||
                                  SUBSTR(A.NBM_CODIGO,9,2),
                           SUBSTR(A.NBM_CODIGO,3,8),
                           A.OM_CODIGO,
                           A.STC_CODIGO,
                           TO_CHAR(A.CTP_DESC_INCONDICIONAL,
                                  '9999999V99'),
                           LTRIM(TO_CHAR(A.CTP_DESC_INCONDICIONAL,
                                  '00000000000V00')),
                           TO_CHAR(A.VL_TRIBUTAVEL_ICMS,
                                  '999999999V99'),
                           TO_CHAR(A.VL_ICMS,
                                  '9999999V99'),
                           LTRIM(TO_CHAR(A.VL_ICMS,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_BASE_ICMS,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_BASE_ICMS,
                                  '00000000000V00')),
                           LTRIM(TO_CHAR(A.VL_ICMS,
                                  '00000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_ICMS,
                                  '00000000000V00')),
                           LTRIM(TO_CHAR(A.VL_BASE_STF,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_STF,
                                  '00000000000000V00')),
                           TO_CHAR(A.VL_IMPOSTO_PIS,
                                  '9999999V99'),
                           TO_CHAR(A.VL_IMPOSTO_COFINS,
                                  '9999999V99'),
                           TO_CHAR(A.VL_ALIQ_PIS,'999V99'),
                           TO_CHAR(A.VL_ALIQ_COFINS,'999V99'),
                           B.NOME,
                           B.DESCRICAO,
                           B.CAT_NT_PIS_COFINS,
                           LTRIM(TO_CHAR(A.CTP_FRETE_AEREO,
                                  '00000000000V00')),
                           LTRIM(TO_CHAR(A.FAT_BASE_CALCULO_STF,
                                  '0V0000')),
                           A.PESO_BRUTO_KG/A.QTD,
                           REPLACE(A.CFOP_CODIGO,'.'),
                           TO_CHAR(A.VL_TRIBUTAVEL_ICMS,
                                  '99,999,999,990.00'),
                           TO_CHAR(A.VL_ICMS,
                                  '99,999,999,990.00'),
                           TO_CHAR(A.VL_TRIBUTAVEL_STF,
                                  '99,999,999,990.00'),
                           LTRIM(TO_CHAR(A.VL_TRIBUTAVEL_STF,
                                  '0000000000000000V00')),
                           TO_CHAR(A.VL_STF,
                                  '99,999,999,990.00'),
                           TO_CHAR(A.VL_FISCAL,
                                  '999999999V99'),
                           LTRIM(TO_CHAR(A.VL_BASE_STT,
                                  '0000000000000000V00')),
                           A.NOP_CODIGO,
                           LTRIM(TO_CHAR(A.VL_PIS_ST,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_COFINS_ST,
                                  '0000000000000000V00')),
                           LTRIM(TO_CHAR(A.VL_ICMS_FCPST,
                                  '00000000000000V00')),
                           STA_CODIGO,
                           STN_CODIGO
                    FROM   B8CC.COR_IDF A,
                           B8CC.COR_MERCADORIA B,
                           B8CC.COR_UNIDADE_MERCADORIA C
                    WHERE  A.MERC_CODIGO = B.MERC_CODIGO
                    AND    B.MERC_CODIGO = C.MERC_CODIGO(+)
                    AND    B.DFLT_UNI_CODIGO_SAIDA = C.UNI_CODIGO(+)
                    AND    A.DOF_SEQUENCE = :CC0001-DOF-SEQUENCE
                    ORDER  BY A.IDF_NUM
      *             ORDER  BY A.MERC_CODIGO
                END-EXEC.

           EXEC SQL OPEN   CSR_SEL_C 
                END-EXEC. 

           MOVE ZEROS                        TO WS01-SEQ-LIN-PAG
                                                WS01-SEQ-LIN-DFE.

       705-60-LOOP-DETALHE.

           EXEC SQL FETCH  CSR_SEL_C
                    INTO   :CC0002-IDF-NUM,
                           :CC0002-ALIQ-ICMS-LOG,
                           :WM01-ALIQ-ICMS,
                           :CC0002-ALIQ-IPI-LOG,
                           :WM01-ALIQ-IPI,
                           :CC0002-ALIQ-IPI-CTB,
                           :WM01-PRECO-TOTAL,
                           :CC0002-PRECO-TOTAL-CTB,
                           :CC0002-PRECO-TOTAL-CTB-1,
                           :CC0002-PRECO-TOTAL-CTB-2,
                           :CC0002-PRECO-TOTAL-DEA,
                           :CC0002-PRECO-UNITARIO,
                           :CC0002-PRECO-UNITARIO-LOG,
                           :CC0002-PRECO-UNITARIO-CTB,
                           :CC0002-PRECO-UNITARIO-CME,
                           :CC0002-PRECO-UNITARIO-DEA,
                           :CC0002-QTD,
                           :CC0002-QTD-DEA,
                           :WM01-VL-IPI,
                           :WM01-VL-IPI-LOG,
                           :CC0002-VL-BASE-IPI,
                           :CC0002-VL-IPI-CTB,
                           :CC0002-VL-IPI-CME,
                           :CC0002-VL-IPI-DEA,
                           :CC0002-ENTSAI-UNI-CODIGO
                                                :WI01-ENTSAI-UNI-CODIGO,
                           :CC0002-IDF-TEXTO-COMPLEMENTAR
                                           :WI01-IDF-TEXTO-COMPLEMENTAR,
                           :WQ01-TEXTO-COMPLEMENTAR-EXP
                                           :WI01-TEXTO-COMPLEMENTAR-EXP,
                           :CC0002-MERC-CODIGO        :WI01-MERC-CODIGO,
                           :CC0002-MERC-CODIGO-LIMPO  :WI01-MERC-CODIGO,
                           :CC0002-NBM-CODIGO          :WI01-NBM-CODIGO,
                           :CC0002-NBM-CODIGO-E        :WI01-NBM-CODIGO,
                           :CC0002-NBM-CODIGO-DEA      :WI01-NBM-CODIGO,
                           :CC0002-OM-CODIGO            :WI01-OM-CODIGO,
                           :CC0002-STC-CODIGO          :WI01-STC-CODIGO,
                           :CC0002-DESCONTO-ITEM-LOG   :WI01-DESCONTO,
                           :CC0002-DESCONTO-ITEM-DEA   :WI01-DESCONTO,
                           :CC0002-VL-TRIBUTAVEL-ICMS,
                           :CC0002-VL-ICMS,
                           :CC0002-VL-ICMS-CME,
                           :CC0002-VL-BASE-ICMS,
                           :CC0002-VL-BASE-ICMS-DEA,
                           :CC0002-VL-ICMS-CTB,
                           :CC0002-VL-ICMS-DEA,
                           :CC0002-VL-BASE-STF,
                           :CC0002-VL-STF-CTB,
                           :CC0002-VL-IMPOSTO-PIS,
                           :CC0002-VL-IMPOSTO-COFINS,
                           :CC0002-VL-ALIQ-PIS,
                           :CC0002-VL-ALIQ-COFINS,
                           :CC0005-NOME                 :WI01-NOME,
                           :CC0005-DESCRICAO            :WI01-DESCRICAO,
                           :CC0002-IC-NF-TRBT,
                           :CC0002-FRETE-DEA            :WI01-FRETE-DEA,
                           :CC0002-FAT-BASE-CALC-STF,
                           :WQ01-PESO-BRT-EMIF-UNIT,
                           :CC0002-CFOP-CODIGO  :WI01-CFOP-CODIGO,
                           :WM01-VL-BASE-ICMS   :WI01-VL-BASE-ICMS,
                           :WM01-VL-ICMS        :WI01-VL-ICMS,
                           :WM01-VL-BASE-ICMS-STF
                                                :WI01-VL-BASE-ICMS-STF,
                           :CC0002-VL-TRIBUTAVEL-STF
                                                :WI01-VL-TRIBUTAVEL-STF,
                           :WM01-VL-ICMS-STF    :WI01-VL-ICMS-STF,
                           :CC0002-VL-FISCAL,
                           :CC0002-VL-BASE-STT,
                           :CC0002-NOP-CODIGO   :WI01-NOP-CODIGO,
                           :CC0002-VL-PIS-ST,
                           :CC0002-VL-COFINS-ST,
                           :CC0002-VL-ICMS-FCPST,
                           :CC0002-STA-CODIGO,
                           :CC0002-STN-CODIGO
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                           TO 705-70-CLOSE-DETALHE.

           INSPECT CC0002-IDF-NUM            CONVERTING SPACES TO ZEROS.
           INSPECT CC0002-VL-STF-CTB         CONVERTING SPACES TO ZEROS.
           INSPECT CC0002-VL-ICMS-FCPST      CONVERTING SPACES TO ZEROS.
           INSPECT CC0002-STA-CODIGO         CONVERTING SPACES TO ZEROS.
           INSPECT CC0002-STN-CODIGO         CONVERTING SPACES TO ZEROS.

           ADD 1                             TO WS01-ID-NUM-T-REG
                                                WS01-ID-NUM-T-REG-S.

       705-65-VL-UN-TRIB.

      *    IF WS36-CD-MERC-DST  EQUAL  'E'
      *         EXEC SQL AT CCPR 
      *                  SELECT TRIM(:WQ01-TEXTO-COMPLEMENTAR-EXP) ||
      *                             DECODE(B.FAT_CONV_UNI_BAS_MERC,1,'',
      *                                    ' | V. Un. Trib. = ' ||
      *                                    REPLACE(ROUND(
      *                                    :CC0002-PRECO-UNITARIO-LOG/
      *                                    B.FAT_CONV_UNI_BAS_MERC,10),
      *                                                        '.',','))
      *                  INTO   :WQ01-TEXTO-COMPLEMENTAR-EXP
      *                                     :WI01-TEXTO-COMPLEMENTAR-EXP
      *                  FROM   B8CC.COR_MERCADORIA A,
      *                         B8CC.COR_UNIDADE_MERCADORIA B
      *                  WHERE  A.MERC_CODIGO = B.MERC_CODIGO
      *                  AND    A.DFLT_UNI_CODIGO_SAIDA = B.UNI_CODIGO
      *                  AND    A.MERC_CODIGO =
      *                                        :CC0002-MERC-CODIGO-LIMPO
      *              END-EXEC.

           PERFORM 567-00-ATUALIZA-ODA-CMIS2.

           PERFORM 740-00-PCL-DETALHE.
           
           PERFORM 791-00-MONTA-LOG-NF-ITEM.

           IF WS01-ID-VIA  EQUAL  1  AND
              (WS36-CD-MERC-DST  EQUAL  'D'  OR
               (WS36-CD-MERC-DST  EQUAL  'E'  AND
                WS36-FASE-FTRM  EQUAL  '1'))  AND
              ST0001-CD-REGR-FTRM  NOT EQUAL  'N'
                MOVE 'DET-DANFE'             TO ACB50221-CHV-PRAD     
                MOVE 650                     TO ACB50221-TAM-MSG
                MOVE ST8001-ST80014          TO ACB50221-TXT-MSG
                PERFORM 555-00-GRAVA-MENSAGEM-MQ.
           
           IF ST0001-CD-REGR-FTRM  EQUAL  'E'
                PERFORM 845-00-CONTABILIZA-ITEM.
      
           IF WS31-CHV-CME  EQUAL  'S'  AND
              ST0001-CD-REGR-FTRM  NOT EQUAL  'N'
                PERFORM 855-00-INTERFACE-CME-ITEM.
      
           IF (WS36-CD-MERC-DST  EQUAL  'E'  OR
               (WS36-CD-MERC-DST  EQUAL  'D'  AND
                WS36-FASE-FTRM  EQUAL  1))  AND
              WS31-CHV-DEA  EQUAL  'S'  AND
              ST0001-CD-REGR-FTRM  NOT EQUAL  'N'
                PERFORM 865-00-INTERFACE-DEA-ITEM.

           IF WS36-CD-MERC-DST  EQUAL  'E'  AND
              WS31-CHV-DEA  EQUAL  'S'
                PERFORM 880-00-INTERFACE-S-DE-ITEM.

      *    IF WS36-CD-MERC-DST  EQUAL  'E'  AND
      *       WS36-FASE-FTRM   EQUAL  '1'
      *         PERFORM 890-00-INTERFACE-EXP-CTRL-ITM.
                
           GO                                TO 705-60-LOOP-DETALHE.

       705-70-CLOSE-DETALHE.
       
           EXEC SQL CLOSE  CSR_SEL_C
                END-EXEC.               

           PERFORM 790-00-MONTA-LOG-NF-TOTAL.

           IF WS01-ID-VIA  EQUAL  1  AND
              (WS36-CD-MERC-DST  EQUAL  'D'  OR
               (WS36-CD-MERC-DST  EQUAL  'E'  AND
                WS36-FASE-FTRM  EQUAL  '1'))  AND
              ST0001-CD-REGR-FTRM  NOT EQUAL  'N'
                MOVE 'RES-DANFE'             TO ACB50221-CHV-PRAD     
                MOVE 650                     TO ACB50221-TAM-MSG
                MOVE ST8001-ST80014          TO ACB50221-TXT-MSG
                PERFORM 555-00-GRAVA-MENSAGEM-MQ.

           PERFORM 800-00-DESCARREGA-VIAS-DANFE  UNTIL  
                                WS01-ID-VIA  EQUAL  WS01-QTDE-VIA-DANFE.

           IF ST0001-CD-REGR-FTRM  EQUAL  'E'  AND
              ST0001-CD-REGR-FTRM  NOT EQUAL  'N'  
                PERFORM 850-00-CONTABILIZA-DANFE.
      
           IF WS31-CHV-CME  EQUAL  'S'  AND
              ST0001-CD-REGR-FTRM  NOT EQUAL  'N'
                PERFORM 860-00-INTERFACE-CME-DANFE.

           IF (WS36-CD-MERC-DST  EQUAL  'E'  OR
               (WS36-CD-MERC-DST  EQUAL  'D'  AND
                WS36-FASE-FTRM  EQUAL  1))  AND
              WS31-CHV-DEA  EQUAL  'S'  AND
              ST0001-CD-REGR-FTRM  NOT EQUAL  'N'
                PERFORM 870-00-INTERFACE-DEA-DANFE.

           GO                                TO 705-20-LOOP-ITEM-FTRD.

       705-80-CLOSE-ITEM-FTRD.

           EXEC SQL CLOSE  CSR_SEL_B
                END-EXEC.

           IF WS36-CD-MERC-DST  EQUAL  'E'  AND
              WS36-FASE-FTRM   EQUAL  '1'  AND
              ST0001-CD-REGR-FTRM  NOT EQUAL  'N'
                PERFORM 830-00-INTERFACE-SAP-DADOS-EXP.

           IF WS36-CD-MERC-DST  EQUAL  'E'  AND
              WS31-CHV-DEA  EQUAL  'S'
                PERFORM 885-00-INTERFACE-S-DE-FAT.

      *    IF WS36-CD-MERC-DST  EQUAL  'E'  AND
      *       WS36-FASE-FTRM   EQUAL  '1'
      *         PERFORM 895-00-INTERFACE-EXP-CTRL-TTL.

      *    IF WS36-CD-MERC-DST  EQUAL  'E'  AND
      *       WS36-FASE-FTRM   EQUAL  '1'  AND
      *       ST0001-CD-REGR-FTRM  NOT EQUAL  'I'  AND
      *       SF0002-ITD-CD-MOD-TRSP  NOT EQUAL  '4'  AND
      *       SF0002-ITD-CD-MOD-TRSP  NOT EQUAL  '5'  AND
      *       SF0002-ITD-CD-MOD-TRSP  NOT EQUAL  '6'
      *         GO                         TO 705-90-ATUALIZA-PROTOCOLO.

      * HABILITAR INTERFACE RIEX PARA CASCO REMAN
      *    IF WS36-CD-MERC-DST  EQUAL  'E'  AND
      *       WS36-FASE-FTRM    EQUAL  '2'
      *         PERFORM 583-00-EMITE-LINK-H1SF5053.

           IF WS36-CD-MERC-DST  EQUAL  'E'   AND
             (WS36-FASE-FTRM    EQUAL  '2'   OR
              (WS36-FASE-FTRM   EQUAL  '1'   AND
               ST0001-CD-REGR-FTRM  EQUAL  'J'))
               PERFORM 583-00-EMITE-LINK-H1SF5053.

           IF WS36-CD-MERC-DST  EQUAL  'E'  AND
              WS36-FASE-FTRM  EQUAL  '1'  AND
              ST0001-CD-REGR-FTRM  NOT EQUAL  'J'  AND
              ST0001-CD-REGR-FTRM  NOT EQUAL  'N'
                GO                         TO 705-90-ATUALIZA-PROTOCOLO.

           MOVE ZEROS                        TO WS32-IND-IMPR
                                                WS32-IND-VIAS
                                                WS01-NUM-VIAS-PTD.

           MOVE SPACES                       TO WS01-ARE-IMPRESSAO.

           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.

           PERFORM 960-00-INSTRUCAO-ESPECIAL.

           MOVE 'S'                          TO WS31-CHV-CARREGA-TAB.

           PERFORM 755-00-PREPARA-DETALHE-PTD.
           PERFORM 765-00-PREPARA-RESUMO-PTD.
           
           PERFORM 710-00-MONTA-PROTOCOLO.
           
           PERFORM 810-00-DESCARREGA-VIAS-PTD  UNTIL  
                            WS01-NUM-VIAS-PTD  EQUAL  WS01-QTDE-VIA-PTD.

           PERFORM 795-00-MONTA-LOG-PROTOCOLO.

           PERFORM 550-00-GRAVA-RESUMO-REL.
           
      *    IF WS36-CD-MERC-DST  NOT EQUAL  'E'  OR
      *       (WS36-CD-MERC-DST  EQUAL  'E'  AND 
      *        SF0002-ITD-CD-MOD-TRSP  EQUAL  '6')
           IF WS36-CD-MERC-DST  NOT EQUAL  'E'
                GO                         TO 705-90-ATUALIZA-PROTOCOLO.

           PERFORM 145-00-DEFINE-PJL-OUTBIN-P.

           MOVE ZEROS                        TO WS32-IND-IMPR
                                                WS32-IND-VIAS
                                                WS01-NUM-VIAS-VOL.

           MOVE SPACES                       TO WS01-ARE-IMPRESSAO.
           
           MOVE 'S'                          TO WS31-CHV-CARREGA-TAB.

           PERFORM 757-00-PREPARA-DETALHE-PCK-LST.
           PERFORM 767-00-PREPARA-RESUMO-PCK-LST.

           PERFORM 720-00-MONTA-PCK-LIST.

           PERFORM 820-00-DESCARREGA-VIAS-PCK-LST  UNTIL
                       WS01-NUM-VIAS-VOL  EQUAL  WS01-QTDE-VIA-PCK-LIST.

           MOVE ZEROS                        TO WS32-IND-IMPR
                                                WS32-IND-VIAS
                                                WS01-NUM-VIAS-VOL.

           MOVE SPACES                       TO WS01-ARE-IMPRESSAO.
           
           MOVE 'S'                          TO WS31-CHV-CARREGA-TAB.

           PERFORM 757-00-PREPARA-DETALHE-PCK-LST.
           PERFORM 767-00-PREPARA-RESUMO-PCK-LST.

           PERFORM 730-00-MONTA-PCK-LIST-RES.
           
           PERFORM 820-00-DESCARREGA-VIAS-PCK-LST  UNTIL  
                       WS01-NUM-VIAS-VOL  EQUAL  WS01-QTDE-VIA-PCK-LIST.

           PERFORM 550-00-GRAVA-RESUMO-REL.
           
       705-90-ATUALIZA-PROTOCOLO.

           PERFORM 540-00-ATUALIZA-PROTOCOLO.

           GO                                TO 705-05-LOOP-PROTOCOLO.

       705-95-FECHA-CURSOR-A.
       
           EXEC SQL CLOSE  CSR_SEL_A
                END-EXEC.               
           
       705-99-MONTA-DANFE-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 10/00 *
      *                                                                *
      *  MONTAGEM DO PROTOCOLO DE DESPACHO.                            *  
      *----------------------------------------------------------------*
      
       710-00-MONTA-PROTOCOLO                SECTION.
      *----------------------------------------------*

           MOVE '710-00-MONTA-PROTOCOLO'     TO  WS35-AUX-TS.

           ADD 1                             TO WS01-NUM-VIAS-PTD.

           IF WS01-NUM-VIAS-PTD  EQUAL  1
                MOVE WS01-CD-SQN-PJL-PTD     TO CB0002-DRE-CD-SQN-PJL
           ELSE
           IF WS01-NUM-VIAS-PTD  EQUAL  3  AND
              WS36-CD-MERC-DST  EQUAL  'D'  AND
              WS36-FASE-FTRM  EQUAL  '2'
                MOVE '96'                    TO CB0002-DRE-CD-SQN-PJL
           ELSE
                ADD 1                        TO WS01-CD-SQN-PJL-PTD-N
                MOVE WS01-CD-SQN-PJL-PTD     TO CB0002-DRE-CD-SQN-PJL
                SUBTRACT 1                   FROM WS01-CD-SQN-PJL-PTD-N
           END-IF.

       710-10-MONTA-CORPO-INICIO.

           PERFORM 715-00-MONTA-CORPO-PROTOCOLO.

       710-20-DADOS-DE-DETALHE.

           EXEC SQL DECLARE CSR_SEL_710  CURSOR FOR       
                    SELECT A.ITD_ID_VOL,
                           B.ID_VOL_CMIS2
                    FROM   H1SF.ITD_ITMFATURADO A,
                           H1ST.VOLUME_RECOLHIMENTO B
                    WHERE  A.ITD_ID_VOL       = B.ID_VOL
                      AND  A.ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                      AND  A.ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                      AND  A.ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                      AND  A.ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                    GROUP  BY A.ITD_ID_VOL,
                              B.ID_VOL_CMIS2
                    ORDER  BY A.ITD_ID_VOL,
                              B.ID_VOL_CMIS2
                END-EXEC.

           MOVE ZEROS                        TO WS01-SEQ-VOL-PTD.      
                
           EXEC SQL OPEN   CSR_SEL_710
                END-EXEC. 
                
       710-40-LOOP-DET-PTD.

           EXEC SQL FETCH  CSR_SEL_710
                    INTO   :WQ01-ID-VOL-DET-PTD,
                           :WQ01-ID-VOL-CMIS2-DET-PTD
                                             :WI01-ID-VOL-CMIS2-DET-PTD
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                           TO 710-50-CLOSE-DET-PTD.
                
           MOVE ZEROS                        TO WS01-QTD-VOL-CONF.      

           ADD 1                             TO WS01-SEQ-VOL-PTD.      
           ADD 1                             TO WS01-SEQ-VOL-PTD-IMP.      
                
           IF WS01-SEQ-VOL-PTD  GREATER  38
                MOVE 1                       TO WS01-SEQ-VOL-PTD      
                PERFORM 715-00-MONTA-CORPO-PROTOCOLO.
                
           COMPUTE WS01-CALC-POS-AUX = 1140 + 
                                       ((WS01-SEQ-VOL-PTD - 1) * 70).

           MOVE WS01-CALC-POS-AUX            TO WS01-PCL-POSICAO-Y.

           MOVE '(s0p17.14h0s3b4099T'       TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0390'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-SEQ-VOL-PTD-IMP         TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0610'                       TO WS01-PCL-POSICAO-X.
           IF WI01-ID-VOL-CMIS2-DET-PTD  GREATER  -1
                MOVE WQ01-ID-VOL-CMIS2-DET-PTD
                                             TO WS01-PCL-DADOS
           ELSE
                MOVE WQ01-ID-VOL-DET-PTD     TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           EXEC SQL SELECT SUM(ITD_Q_PECA_FTRD)
                    INTO   :WQ01-TOT-PECA-DET-PTD
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST = :WQ02-CD-MERC-DST
                    AND    ITD_DTC_SEL_FTRM = :WQ02-DTC-SEL-FTRM
                    AND    ITD_LGON_FUNC = :WQ02-LGON-FUNC
                    AND    ITD_ID_VOL = :WQ01-ID-VOL-DET-PTD
                    AND    ((:WQ02-FASE-FTRM = '1'
                    AND      ITD_ID_NF_REF IS NULL)
                    OR      (:WQ02-FASE-FTRM = '2'
                    AND      ITD_ID_NF_REF IS NOT NULL))
                END-EXEC.

           EXEC SQL SELECT INITCAP(LOWER(EA.NM_ACND_PRTG)),
                           EA.ID_CNTG_CONF
                    INTO   :WQ01-NM-ACND-PRTG-PTD,
                           :WQ01-ID-CNTG-CONF  :WI01-ID-CNTG-CONF
                    FROM   H1ST.TIPO_ACONDICIONAMENTO EA,
                           H1ST.VOLUME_RECOLHIMENTO EB
                    WHERE  EA.CD_T_ACND = EB.CD_T_ACND
                      AND  EB.ID_VOL = :WQ01-ID-VOL-DET-PTD
                END-EXEC.

           MOVE SPACES                       TO WQ01-BULK-PKG.

           IF WQ01-ID-CNTG-CONF  EQUAL  'V'
                ADD 1                        TO WS01-QTD-VOL-CONF 
                ADD 1                        TO WS01-TOT-VOL-CONF
                GO                           TO 710-45-QTD-VOL.

           EXEC SQL SELECT B.Q_PECA_CAXA,
                           B.Q_PECA_BULK,
                           B.Q_PECA_MIN,
                           INITCAP(LOWER(B.NM_PECA_PRTG))
                    INTO   :WQ01-PKG,
                           :WQ01-BULK,
                           :WQ01-MINIMA,
                           :WQ01-NM-PECA-PRTG   :WI01-NM-PECA-PRTG
                    FROM   H1SF.ITD_ITMFATURADO A,
                           H1SR.PECA B
                    WHERE  A.ITD_ID_PECA = B.ID_PECA
                    AND    A.ITD_CD_MERC_DST = :WQ02-CD-MERC-DST
                    AND    A.ITD_DTC_SEL_FTRM = :WQ02-DTC-SEL-FTRM
                    AND    A.ITD_LGON_FUNC = :WQ02-LGON-FUNC
                    AND    A.ITD_ID_VOL  = :WQ01-ID-VOL-DET-PTD
                    AND    ROWNUM = 1
                END-EXEC.

           MOVE WQ01-TOT-PECA-DET-PTD        TO WS01-TOT-PECA-DET-PTD.
           INSPECT WS01-TOT-PECA-DET-PTD     CONVERTING SPACES TO ZEROS.

           MOVE WQ01-BULK                    TO WS01-BULK.
           MOVE WQ01-PKG                     TO WS01-PKG.
           MOVE WQ01-MINIMA                  TO WS01-MINIMA.
           INSPECT WS01-BULK                 CONVERTING SPACES TO ZEROS.
           INSPECT WS01-PKG                  CONVERTING SPACES TO ZEROS.
           INSPECT WS01-MINIMA               CONVERTING SPACES TO ZEROS.

           IF WS01-BULK    NOT GREATER  ZEROS  AND
              WS01-PKG     NOT GREATER  ZEROS  AND
              WS01-MINIMA  NOT GREATER  ZEROS
                ADD WS01-TOT-PECA-DET-PTD    TO WS01-QTD-VOL-CONF 
                ADD WS01-TOT-PECA-DET-PTD    TO WS01-TOT-VOL-CONF
                GO                           TO 710-45-QTD-VOL.

           IF WS01-BULK  GREATER  ZEROS
                MOVE WS01-BULK               TO WS01-BULK-PKG
                COMPUTE WS01-BULK-PKG-QTD =  WS01-TOT-PECA-DET-PTD /
                                             WS01-BULK
           ELSE
           IF WS01-PKG  GREATER  ZEROS
                MOVE WS01-PKG                TO WS01-BULK-PKG
                COMPUTE WS01-BULK-PKG-QTD =  WS01-TOT-PECA-DET-PTD /
                                             WS01-PKG
           ELSE
                MOVE WS01-MINIMA             TO WS01-BULK-PKG
                COMPUTE WS01-BULK-PKG-QTD =  WS01-TOT-PECA-DET-PTD /
                                             WS01-MINIMA.

           MOVE WS01-BULK-PKG                TO WQ01-QTD-AUX.
           EXEC SQL SELECT TO_CHAR(TO_NUMBER(
                                 :WQ01-QTD-AUX),
                                 '9999')
                    INTO   :WQ01-BULK-PKG
                    FROM   DUAL
                    WHERE  ROWNUM = 1
                END-EXEC.

           IF WS01-BULK-PKG-RES  GREATER  ZEROS
                ADD 1                        TO WS01-BULK-PKG-INT.
                
           ADD WS01-BULK-PKG-INT             TO WS01-QTD-VOL-CONF.
           ADD WS01-BULK-PKG-INT             TO WS01-TOT-VOL-CONF.
            
       710-45-QTD-VOL.

           MOVE WS01-QTD-VOL-CONF            TO WQ01-QTD-AUX.
           EXEC SQL SELECT TO_CHAR(TO_NUMBER(
                                 :WQ01-QTD-AUX),
                                 '9999')
                    INTO   :WM01-QTD-AUX
                    FROM   DUAL
                    WHERE  ROWNUM = 1
                END-EXEC.

           MOVE '1325'                       TO WS01-PCL-POSICAO-X.
           MOVE WM01-QTD-AUX                 TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '1570'                       TO WS01-PCL-POSICAO-X.
           MOVE WQ01-NM-ACND-PRTG-PTD        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2320'                       TO WS01-PCL-POSICAO-X.
           MOVE WQ01-BULK-PKG                TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           EXEC SQL SELECT COUNT(*)
                    INTO   :WQ01-TOT-ITEM-DET-PTD
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST = :WQ02-CD-MERC-DST
                    AND    ITD_DTC_SEL_FTRM = :WQ02-DTC-SEL-FTRM
                    AND    ITD_LGON_FUNC = :WQ02-LGON-FUNC
                    AND    ITD_ID_VOL = :WQ01-ID-VOL-DET-PTD
                    AND    ((:WQ02-FASE-FTRM = '1'
                    AND      ITD_ID_NF_REF IS NULL)
                    OR      (:WQ02-FASE-FTRM = '2'
                    AND      ITD_ID_NF_REF IS NOT NULL))
                END-EXEC.

           MOVE '2620'                       TO WS01-PCL-POSICAO-X.
           MOVE WQ01-TOT-ITEM-DET-PTD        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2950'                       TO WS01-PCL-POSICAO-X.
           MOVE WQ01-TOT-PECA-DET-PTD        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           EXEC SQL SELECT TO_CHAR((PESO_BRT_VOL/1000),'99,990.000')
                    INTO   :WQ01-TOT-PESO-DET-PTD
                    FROM   H1ST.VOLUME_RECOLHIMENTO
                    WHERE  ID_VOL  = :WQ01-ID-VOL-DET-PTD
                END-EXEC.

           INSPECT WQ01-TOT-PESO-DET-PTD     CONVERTING '.' TO '!'.
           INSPECT WQ01-TOT-PESO-DET-PTD     CONVERTING ',' TO '.'.
           INSPECT WQ01-TOT-PESO-DET-PTD     CONVERTING '!' TO ','.

           MOVE '3240'                       TO WS01-PCL-POSICAO-X.
           MOVE WQ01-TOT-PESO-DET-PTD        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3760'                       TO WS01-PCL-POSICAO-X.
           IF WQ01-ID-CNTG-CONF  EQUAL  'V'
                MOVE 'Diversos'              TO WS01-PCL-DADOS
           ELSE
                MOVE WQ01-NM-PECA-PRTG       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           GO                                TO 710-40-LOOP-DET-PTD.

       710-50-CLOSE-DET-PTD.

           EXEC SQL CLOSE  CSR_SEL_710
                END-EXEC. 

           MOVE '(s16901t3b0s11.00v1P'      TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE WS01-TOT-VOL-CONF            TO WQ01-QTD-AUX.
           EXEC SQL SELECT LTRIM(TO_CHAR(TO_NUMBER(
                                 :WQ01-QTD-AUX),
                                 '99999'))
                    INTO   :WM01-QTD-AUX
                    FROM   DUAL
                    WHERE  ROWNUM = 1
                END-EXEC.

           MOVE '5720'                       TO WS01-PCL-RESET-X.
           MOVE '2355'                       TO WS01-PCL-RESET-Y.
           MOVE WM01-QTD-AUX                 TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(s16901t3b0s9.00v1P'       TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       710-99-MONTA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 10/00 *
      *                                                                *
      *  MONTAGEM DO CORPO DO PROTOCOLO DE DESPACHO.                   *  
      *----------------------------------------------------------------*
      
       715-00-MONTA-CORPO-PROTOCOLO          SECTION.
      *----------------------------------------------*

           MOVE '715-00-MONTA-CORPO-PROTOCOLO'     TO  WS35-AUX-TS.

       715-10-CONTROLE-IMPRESSAO.

           MOVE 'E&l1H&f39y2X&u600D&l32D*p0x0Y'
                                             TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           PERFORM 930-00-MONTA-COD-BARRA-PRT.

           IF SF0002-ITD-CD-MOD-TRSP  EQUAL  '1'
                MOVE '(42X*p4700x0160Y!'   TO WS01-LINHA-IMPR-AUX
                MOVE 'Rodoviario CBL'        TO WS01-VIA-TRANSPORTE
           ELSE
           IF SF0002-ITD-CD-MOD-TRSP  EQUAL  '2'
                MOVE '(42X*p4700x0160Y!'   TO WS01-LINHA-IMPR-AUX
                MOVE 'Rodoviario Cliente'    TO WS01-VIA-TRANSPORTE
           ELSE
           IF SF0002-ITD-CD-MOD-TRSP  EQUAL  '3'
                MOVE '(47X*p4700x0160Y!'   TO WS01-LINHA-IMPR-AUX
                MOVE 'Retirado pelo Cliente' TO WS01-VIA-TRANSPORTE
           ELSE
           IF SF0002-ITD-CD-MOD-TRSP  EQUAL  '4'
                MOVE '(41X*p4700x0160Y!'   TO WS01-LINHA-IMPR-AUX
                MOVE 'Aereo'                 TO WS01-VIA-TRANSPORTE
           ELSE
           IF SF0002-ITD-CD-MOD-TRSP  EQUAL  '5'
                MOVE '(47X*p4700x0160Y!'   TO WS01-LINHA-IMPR-AUX
                MOVE 'Aereo Retira'          TO WS01-VIA-TRANSPORTE
           ELSE
           IF SF0002-ITD-CD-MOD-TRSP  EQUAL  '6'
                MOVE '(46X*p4700x0160Y!'   TO WS01-LINHA-IMPR-AUX
                MOVE 'Maritimo'              TO WS01-VIA-TRANSPORTE
           ELSE
           IF SF0002-ITD-CD-MOD-TRSP  EQUAL  '7'
                MOVE '(48X*p4700x0160Y!'   TO WS01-LINHA-IMPR-AUX
                MOVE 'Ferroviario'           TO WS01-VIA-TRANSPORTE
           ELSE
           IF SF0002-ITD-CD-MOD-TRSP  EQUAL  '8'
                MOVE '(45X*p4700x0160Y!'   TO WS01-LINHA-IMPR-AUX
                MOVE 'Malote'                TO WS01-VIA-TRANSPORTE.
           
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U'                      TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(s16901t3b0s11.00v1P'      TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       715-15-CORPO.

           MOVE '5800'                       TO WS01-PCL-POSICAO-X.
           MOVE '0100'                       TO WS01-PCL-POSICAO-Y.
           MOVE SF0001-PTD-DTC-PTC-DSP       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(s16901t3b0s13.00v1P'      TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           INSPECT SF0001-PTD-ID-PTC-DSP-E   CONVERTING ',' TO '.'.
           MOVE '3700'                       TO WS01-PCL-POSICAO-X.
           MOVE '0200'                       TO WS01-PCL-POSICAO-Y.
           MOVE SF0001-PTD-ID-PTC-DSP-E      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(s16901t0b0s7.00v1P'       TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5580'                       TO WS01-PCL-POSICAO-X.
           MOVE '0180'                       TO WS01-PCL-POSICAO-Y.
           IF CB0004-CD-FBR  EQUAL  '28'
                MOVE '3 Vias (1a CBL / 2a Transp. / 3a Destino)'
                                             TO WS01-PCL-DADOS
           ELSE
                MOVE '3 Vias (1a CBCL / 2a Transp. / 3a Destino)'
                                             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(s16901t3b0s9.00v1P'       TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0430'                       TO WS01-PCL-POSICAO-X.
           MOVE '0420'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0008-RAZAO-SOCIAL-E        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE 500                          TO WS01-POS-ENDR-AUX.
      
           MOVE '0430'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-POS-ENDR-AUX            TO WS01-PCL-POSICAO-Y.
           MOVE CC0008-ENDERECO-EP           TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           IF WI01-COMPLEMENTO  GREATER  -1
                ADD 80                       TO WS01-POS-ENDR-AUX
                MOVE '0430'                  TO WS01-PCL-POSICAO-X
                MOVE WS01-POS-ENDR-AUX       TO WS01-PCL-POSICAO-Y
                MOVE CC0008-COMPLEMENTO      TO WS01-PCL-DADOS
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL.

           ADD 80                            TO WS01-POS-ENDR-AUX.
           MOVE '0430'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-POS-ENDR-AUX            TO WS01-PCL-POSICAO-Y.
           MOVE CC0008-BAIRRO-MUN-NOME-UF-EP TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           ADD 80                            TO WS01-POS-ENDR-AUX.
           MOVE '0430'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-POS-ENDR-AUX            TO WS01-PCL-POSICAO-Y.
           MOVE CC0008-CPF-CGC-E             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           ADD 80                            TO WS01-POS-ENDR-AUX.
           MOVE '0430'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-POS-ENDR-AUX            TO WS01-PCL-POSICAO-Y.
           MOVE CC0008-INSCR-ESTADUAL-E      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(s16901t3b0s11.00v1P'      TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           IF WS36-CD-MERC-DST  EQUAL  'D'  AND
              WS36-FASE-FTRM  EQUAL  '1'  AND
              SF0005-SFT-IC-FTRM-TRGD  EQUAL  'S'
                MOVE '4340'                  TO WS01-PCL-POSICAO-X
                MOVE '0340'                  TO WS01-PCL-POSICAO-Y
                MOVE SF0001-PTD-ID-CLI       TO WS01-PCL-DADOS
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL

                MOVE '6070'                  TO WS01-PCL-POSICAO-X
                MOVE '0340'                  TO WS01-PCL-POSICAO-Y
                MOVE WQ01-ID-CLI-AUX         TO WS01-PCL-DADOS
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL
           ELSE
                MOVE '6070'                  TO WS01-PCL-POSICAO-X
                MOVE '0340'                  TO WS01-PCL-POSICAO-Y
                MOVE SF0001-PTD-ID-CLI       TO WS01-PCL-DADOS
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(s16901t3b0s9.00v1P'       TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3670'                       TO WS01-PCL-POSICAO-X.
           MOVE '0420'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-RAZAO-SOCIAL          TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE 500                          TO WS01-POS-ENDR-AUX.

           MOVE '3670'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-POS-ENDR-AUX            TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-ENDERECO-EPD          TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           IF WI01-COMPLEMENTO-EPD  GREATER  -1
                ADD 80                       TO WS01-POS-ENDR-AUX
                MOVE '3670'                  TO WS01-PCL-POSICAO-X
                MOVE WS01-POS-ENDR-AUX       TO WS01-PCL-POSICAO-Y
                MOVE CC0004-COMPLEMENTO-EPD  TO WS01-PCL-DADOS
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL.

           ADD 80                            TO WS01-POS-ENDR-AUX.
           MOVE '3670'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-POS-ENDR-AUX            TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-BAIRRO-MUN-NOME-UF-EPD
                                             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           ADD 80                            TO WS01-POS-ENDR-AUX.
           MOVE '3670'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-POS-ENDR-AUX            TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-CPF-CGC-E             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           ADD 80                            TO WS01-POS-ENDR-AUX.
           MOVE '3670'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-POS-ENDR-AUX            TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-INSCR-ESTADUAL-E      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       715-20-TOTAIS-DO-PROTOCOLO.

           MOVE '(19U(s16602t0b0s11v1P'    TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4376'                       TO WS01-PCL-POSICAO-X.
           MOVE '1640'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'Valor Total da Mercadoria:' TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4376'                       TO WS01-PCL-POSICAO-X.
           MOVE '1756'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'Frete Pago por:'            TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4376'                       TO WS01-PCL-POSICAO-X.
           MOVE '1871'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'Tipo de Pedido:'            TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4376'                       TO WS01-PCL-POSICAO-X.
           MOVE '1986'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'Transporte:'                TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4376'                       TO WS01-PCL-POSICAO-X.
           MOVE '2102'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'Fatura no:'                 TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U(s16602t3b0s12v1P'     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4376'                       TO WS01-PCL-POSICAO-X.
           MOVE '2361'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'Total de Volumes:'          TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4376'                       TO WS01-PCL-POSICAO-X.
           MOVE '2573'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'Peso Total dos Itens:'      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4376'                       TO WS01-PCL-POSICAO-X.
           MOVE '2786'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'Peso Total de Embalagem:'   TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4376'                       TO WS01-PCL-RESET-X.
           MOVE '2999'                       TO WS01-PCL-RESET-Y.
           MOVE 'Peso Bruto do Embarque:'    TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           EXEC SQL SELECT MIN(ITD_ID_NF),
                           MAX(ITD_ID_NF)
                    INTO   :WQ01-MENOR-DANFE,
                           :WQ01-MAIOR-DANFE
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                      AND  ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                      AND  ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                      AND  ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                END-EXEC.

           INSPECT WQ01-MENOR-DANFE          CONVERTING SPACES TO ZEROS.
           INSPECT WQ01-MAIOR-DANFE          CONVERTING SPACES TO ZEROS.

       715-30-QUEBRA-SEQ-DANFE.
       
           MOVE '(s0p12.54h1s3b24579T'      TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
       
           MOVE ZEROS                        TO WS01-ID-NF-SEQ
                                                WS01-ID-NF-SEQ-ANT
                                                WS32-IND-NF-MAX.
           MOVE SPACES                       TO WQ01-TXT-SEQ-NF
                                                WQ01-ID-NF-SEQ-AUX.
       
           EXEC SQL DECLARE CSR_SEL_715  CURSOR FOR       
                    SELECT DISTINCT ITD_ID_NF
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                    AND    ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                    AND    ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                    AND    ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                    ORDER  BY ITD_ID_NF
                END-EXEC.
       
           EXEC SQL OPEN   CSR_SEL_715
                END-EXEC.
       
       715-32-LOOP-SEQ-NF.
       
           EXEC SQL FETCH  CSR_SEL_715
                    INTO   :WQ01-ID-NF-SEQ
                END-EXEC.
       
           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                           TO 715-34-ULTIMA-NF.
           
           INSPECT WQ01-ID-NF-SEQ            CONVERTING SPACES TO ZEROS.
           MOVE WQ01-ID-NF-SEQ               TO WS01-ID-NF-SEQ.
           
           IF WS01-ID-NF-SEQ-ANT  EQUAL  ZEROS
                MOVE WS01-ID-NF-SEQ          TO WS01-ID-NF-SEQ-ANT
                                
                EXEC SQL SELECT LTRIM(TO_NUMBER(:WQ01-ID-NF-SEQ))
                         INTO   :WQ01-TXT-SEQ-NF
                         FROM   DUAL
                     END-EXEC

                MOVE WS01-ID-NF-SEQ          TO WS01-ID-NF-SEQ-IMPS
                GO                           TO 715-32-LOOP-SEQ-NF.
       
           IF WS01-ID-NF-SEQ - WS01-ID-NF-SEQ-ANT  GREATER  1
                IF WS01-ID-NF-SEQ-ANT  NOT EQUAL  WS01-ID-NF-SEQ-IMPS
                     MOVE WS01-ID-NF-SEQ-ANT TO WQ01-ID-NF-SEQ-AUX
                
                     EXEC SQL SELECT :WQ01-TXT-SEQ-NF || ' a ' ||
                                     LTRIM(TO_NUMBER(
                                                   :WQ01-ID-NF-SEQ-AUX))
                              INTO   :WQ01-TXT-SEQ-NF
                              FROM   DUAL
                          END-EXEC

                     MOVE SPACES             TO WQ01-ID-NF-SEQ-AUX
                    
                END-IF
                
                EXEC SQL SELECT :WQ01-TXT-SEQ-NF || ', ' ||
                                LTRIM(TO_NUMBER(:WQ01-ID-NF-SEQ))
                         INTO   :WQ01-TXT-SEQ-NF
                         FROM   DUAL
                     END-EXEC
       
                MOVE WS01-ID-NF-SEQ          TO WS01-ID-NF-SEQ-IMPS.
       
           MOVE WS01-ID-NF-SEQ               TO WS01-ID-NF-SEQ-ANT.
           GO                                TO 715-32-LOOP-SEQ-NF.
       
       715-34-ULTIMA-NF.
       
           IF WS01-ID-NF-SEQ-IMPS  EQUAL  WS01-ID-NF-SEQ-ANT
                GO                           TO 715-38-CLOSE-SEQ-NF.
       
           MOVE WS01-ID-NF-SEQ-ANT           TO WQ01-ID-NF-SEQ-AUX.
       
           IF (WS01-ID-NF-SEQ-ANT - WS01-ID-NF-SEQ-IMPS)  GREATER  1                
                EXEC SQL SELECT :WQ01-TXT-SEQ-NF || ' a ' ||
                                LTRIM(TO_NUMBER(:WQ01-ID-NF-SEQ-AUX))
                         INTO   :WQ01-TXT-SEQ-NF
                         FROM   DUAL
                     END-EXEC
           ELSE
                EXEC SQL SELECT :WQ01-TXT-SEQ-NF || ', ' ||
                                LTRIM(TO_NUMBER(:WQ01-ID-NF-SEQ-AUX))
                         INTO   :WQ01-TXT-SEQ-NF
                         FROM   DUAL
                     END-EXEC.

       715-38-CLOSE-SEQ-NF.
       
           EXEC SQL CLOSE  CSR_SEL_715
                END-EXEC.
       
           MOVE WQ01-TXT-SEQ-NF              TO WQ01-TXT-NF-IST-ESP.
           
           EXEC SQL SELECT LENGTH(:WQ01-TXT-SEQ-NF)
                    INTO   :WQ01-IND-NF-MAX
                    FROM   DUAL
                END-EXEC.
                
           INSPECT WQ01-IND-NF-MAX           CONVERTING SPACES TO ZEROS.
           MOVE WQ01-IND-NF-MAX              TO WS32-IND-NF-MAX.
       
           IF WS32-IND-NF-MAX  GREATER  9
                ADD 15                       TO WS32-IND-NF-MAX
                EXEC SQL SELECT 'Notas Fiscais: ' || :WQ01-TXT-SEQ-NF
                         INTO   :WQ01-TXT-SEQ-NF
                         FROM   DUAL
                     END-EXEC
           ELSE
                ADD 13                       TO WS32-IND-NF-MAX
                EXEC SQL SELECT 'Nota Fiscal: ' || :WQ01-TXT-SEQ-NF
                         INTO   :WQ01-TXT-SEQ-NF
                         FROM   DUAL
                     END-EXEC.
       
       715-40-IMPRESSAO-NOTAS.

           MOVE WQ01-TXT-SEQ-NF              TO WS01-TXT-SEQ-NF.
           MOVE ZEROS                        TO WS01-POSICAO-NF-X
                                                WS01-POSICAO-NF-Y
                                                WS32-IND-AT.
           MOVE 1                            TO WS32-IND-IN.
           
       715-42-DEFINE-IND.
           
           IF WS32-IND-NF-MAX  GREATER  (WS32-IND-IN + 43)
                ADD 43                       TO WS32-IND-AT
                IF WS01-TXT-SEQ-NF-C(WS32-IND-AT + 1) NOT GREATER SPACES
                     ADD 1                   TO WS32-IND-AT
                END-IF
           ELSE
                MOVE WS32-IND-NF-MAX         TO WS32-IND-AT.

       715-44-LOOP-NF-1.
           
           IF WS32-IND-AT  LESS  WS32-IND-NF-MAX  AND
              WS01-TXT-SEQ-NF-C(WS32-IND-AT)  GREATER  SPACES
                SUBTRACT 1                   FROM WS32-IND-AT
                GO                           TO 715-44-LOOP-NF-1.
           
           MOVE ZEROS                        TO WS32-IND-IMPS.
           
       715-46-LOOP-NF-2.
       
           ADD 1                             TO WS32-IND-IMPS.
       
           MOVE WS01-TXT-SEQ-NF-C(WS32-IND-IN)
                                             TO WS01-TXT-SEQ-NF-LN-C
                                                        (WS32-IND-IMPS).
                
           IF WS32-IND-IN  LESS  WS32-IND-AT
                ADD 1                        TO WS32-IND-IN
                GO                           TO 715-46-LOOP-NF-2.
          
       715-49-IMPRIME-LINHA.
           
           IF WS32-IND-IMPS  EQUAL  43
                MOVE 4376                    TO WS01-POSICAO-NF-X
           ELSE
                COMPUTE WS01-POSICAO-NF-X ROUNDED = 4376 +
                                      (((43 - WS32-IND-IMPS) / 2) * 45).
           
           IF WS01-POSICAO-NF-Y  NOT GREATER  ZEROS
                IF WS32-IND-NF-MAX  LESS  44
                     MOVE 1130               TO WS01-POSICAO-NF-Y
                ELSE
                     MOVE 930                TO WS01-POSICAO-NF-Y
                END-IF
           ELSE
                ADD 80                       TO WS01-POSICAO-NF-Y.
       
           IF WS01-POSICAO-NF-Y  GREATER  1490
                MOVE '*** ERRO - QUEBRA DE SEQ. NOTAS EXCEDIDA  ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE SF0001-PTD-DTC-SEL-FTRM TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.

           MOVE WS01-POSICAO-NF-X            TO WS01-PCL-RESET-X.
           MOVE WS01-POSICAO-NF-Y            TO WS01-PCL-RESET-Y.
           MOVE WS01-TXT-SEQ-NF-LN           TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.

           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE SPACES                       TO WS01-TXT-SEQ-NF-LN.
       
           IF WS32-IND-IN  LESS  WS32-IND-NF-MAX
                GO                           TO 715-42-DEFINE-IND.
       
       715-50-CONTINUA-TOT-PROTOCOLO.

           MOVE '(s16901t3b0s9.00v1P'       TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE WS01-PRECO-TOTAL-M-TOT       TO WQ01-PRECO-TOTAL-M-TOT.
           EXEC SQL SELECT LTRIM('R$' || TO_CHAR(
                                 :WQ01-PRECO-TOTAL-M-TOT,
                                 '99,999,999,990.00'))
                    INTO   :WM01-PRECO-TOTAL-M-TOT
                    FROM   DUAL
                    WHERE  ROWNUM = 1
                END-EXEC.
          
           INSPECT WM01-PRECO-TOTAL-M-TOT    CONVERTING '.' TO '!'.
           INSPECT WM01-PRECO-TOTAL-M-TOT    CONVERTING ',' TO '.'.
           INSPECT WM01-PRECO-TOTAL-M-TOT    CONVERTING '!' TO ','.

           MOVE '5480'                       TO WS01-PCL-POSICAO-X.
           MOVE '1640'                       TO WS01-PCL-POSICAO-Y.
           MOVE WM01-PRECO-TOTAL-M-TOT       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5480'                       TO WS01-PCL-POSICAO-X.
           MOVE '1756'                       TO WS01-PCL-POSICAO-Y.
           
           IF SF0001-PTD-CD-PGT-FRT EQUAL '1' OR
              SF0001-PTD-CD-PGT-FRT EQUAL '2'
                MOVE 'Destinatario'          TO WS01-PCL-DADOS
           ELSE
                IF SF0001-PTD-CD-PGT-FRT EQUAL '3'
                     MOVE 'Emitente'         TO WS01-PCL-DADOS
                END-IF
                IF SF0001-PTD-CD-PGT-FRT EQUAL '0'
                     MOVE 'Terceiros'        TO WS01-PCL-DADOS
                END-IF.
                
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE ST0001-DESC-REC              TO WS01-ORIGEM.
           PERFORM 910-00-TIPO-PEDIDO.
           MOVE WS01-DESTINO                 TO ST0001-DESC-REC
                                                WS01-DESC-REC.
           MOVE ST0001-CD-T-REC              TO WS01-CD-T-REC.

           MOVE '5480'                       TO WS01-PCL-POSICAO-X.
           MOVE '1871'                       TO WS01-PCL-POSICAO-Y.
           MOVE WS01-TIPO-RECOLHIMENTO       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           EXEC SQL SELECT A.CD_CLS_PDD,
                           A.ID_PRFL_ATND
                    INTO   :ST0003-CD-CLS-PDD,
                           :ST0003-ID-PRFL-ATND
                    FROM   H1ST.RECOLHIMENTO A,
                           H1ST.ITEM_RECOLHIMENTO B
                   WHERE  A.CD_T_REC    = B.CD_T_REC
                     AND  A.CD_T_MTZ    = B.CD_T_MTZ
                     AND  A.ID_MTZ      = B.ID_MTZ
                     AND  A.ID_CLI      = B.ID_CLI
                     AND  A.CD_SIT_ATND = B.CD_SIT_ATND
                     AND  A.ID_PDD      = B.ID_PDD
                     AND  A.ID_PSO      = B.ID_PSO
                     AND  B.ID_ETIQ_REC = :SF0002-ITD-ID-ETIQ-REC-LOG
                     AND  ROWNUM = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - LOG. SYNC. - RECOL.  ETIQ-REC: ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE SF0002-ITD-ID-ETIQ-REC-LOG  TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.               

           INSPECT ST0003-ID-PRFL-ATND       CONVERTING SPACES TO ZEROS.
           
           IF ST0003-CD-CLS-PDD    EQUAL  'S'  AND
              ST0003-ID-PRFL-ATND  EQUAL  '00100'
                MOVE '6060'                  TO WS01-PCL-POSICAO-X
                MOVE '1871'                  TO WS01-PCL-POSICAO-Y
                MOVE 00301                   TO SR0002-ID-PARM 
                PERFORM 530-00-RECUPERA-PARAMETRO
                MOVE SR0002-CN-PARM          TO WS01-PCL-DADOS
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5480'                       TO WS01-PCL-POSICAO-X.
           MOVE '1986'                       TO WS01-PCL-POSICAO-Y.
           MOVE WS01-VIA-TRANSPORTE          TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           IF WS36-CD-MERC-DST  EQUAL  'E'
                MOVE '5480'                  TO WS01-PCL-POSICAO-X
                MOVE '2102'                  TO WS01-PCL-POSICAO-Y
                MOVE SF0002-ITD-FTR-EXP      TO WS01-PCL-DADOS
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL.

      *    MOVE WS01-PESO-LIQUIDO-KG-TOT     TO 
      *                                       WQ01-PESO-LIQUIDO-KG-TOT.
      *    EXEC SQL SELECT LTRIM(TO_CHAR(
      *                          :WQ01-PESO-LIQUIDO-KG-TOT,
      *                          '9,999,999,990.000') || 'Kg')
      *             INTO   :WM01-PESO-LIQUIDO-KG-TOT
      *             FROM   DUAL
      *             WHERE  ROWNUM = 1
      *         END-EXEC.
           IF WS36-CD-MERC-DST  EQUAL  'E'
                MOVE WS01-PESO-LIQUIDO-KG-TOT
                                             TO WQ01-PESO-LIQUIDO-KG-TOT
                EXEC SQL SELECT LTRIM(TO_CHAR(
                                      :WQ01-PESO-LIQUIDO-KG-TOT,
                                      '9,999,999,990.000') || 'Kg')
                         INTO   :WM01-PESO-LIQUIDO-KG-TOT
                         FROM   DUAL
                         WHERE  ROWNUM = 1
                     END-EXEC
           ELSE
                EXEC SQL SELECT LTRIM(TO_CHAR(
                                (SUM(B.PESO_BRT_VOL -
                                           C.PESO_BRT_ACND)/1000),
                                           '9,999,999,990.000') || 'Kg')
                         INTO   :WM01-PESO-LIQUIDO-KG-TOT
                         FROM   H1ST.VOLUME_RECOLHIMENTO B,
                                H1ST.TIPO_ACONDICIONAMENTO C
                         WHERE  EXISTS (SELECT 1
                                        FROM   H1SF.ITD_ITMFATURADO A
                                        WHERE  A.ITD_CD_MERC_DST  = 
                                               :SF0001-PTD-CD-MERC-DST
                                          AND  A.ITD_DTC_SEL_FTRM = 
                                               :SF0001-PTD-DTC-SEL-FTRM
                                          AND  A.ITD_LGON_FUNC    = 
                                               :SF0001-PTD-LGON-FUNC
                                          AND  A.ITD_ID_PTC_DSP   = 
                                               :SF0001-PTD-ID-PTC-DSP
                                          AND  B.ID_VOL = A.ITD_ID_VOL)
                           AND  C.CD_T_ACND        = B.CD_T_ACND
                     END-EXEC.

           INSPECT WM01-PESO-LIQUIDO-KG-TOT    CONVERTING '.' TO '!'.
           INSPECT WM01-PESO-LIQUIDO-KG-TOT    CONVERTING ',' TO '.'.
           INSPECT WM01-PESO-LIQUIDO-KG-TOT    CONVERTING '!' TO ','.

           MOVE '5720'                       TO WS01-PCL-POSICAO-X.
           MOVE '2560'                       TO WS01-PCL-POSICAO-Y.
           MOVE WM01-PESO-LIQUIDO-KG-TOT     TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

      *    MOVE WS01-PESO-BRUTO-KG-TOT       TO WQ01-PESO-BRUTO-KG-TOT.
      *    EXEC SQL SELECT LTRIM(TO_CHAR(
      *                          :WQ01-PESO-BRUTO-KG-TOT,
      *                          '9,999,999,990.000') || 'Kg')
      *             INTO   :WM01-PESO-BRUTO-KG-TOT
      *             FROM   DUAL
      *             WHERE  ROWNUM = 1
      *         END-EXEC.

           EXEC SQL SELECT LTRIM(TO_CHAR(
                                 (SUM(B.PESO_BRT_VOL)/1000),
                                 '9,999,999,990.000') || 'Kg'),
                           SUM(B.PESO_BRT_VOL)/1000
                    INTO   :WM01-PESO-BRUTO-KG-TOT,
                           :WQ01-PESO-BRUTO-KG-TOT
                    FROM   H1ST.VOLUME_RECOLHIMENTO B
                    WHERE  EXISTS (SELECT 1
                                   FROM   H1SF.ITD_ITMFATURADO A
                                   WHERE  A.ITD_CD_MERC_DST  = 
                                          :SF0001-PTD-CD-MERC-DST
                                     AND  A.ITD_DTC_SEL_FTRM = 
                                          :SF0001-PTD-DTC-SEL-FTRM
                                     AND  A.ITD_LGON_FUNC    = 
                                          :SF0001-PTD-LGON-FUNC
                                     AND  A.ITD_ID_PTC_DSP   = 
                                          :SF0001-PTD-ID-PTC-DSP
                                     AND  B.ID_VOL = A.ITD_ID_VOL)
                END-EXEC.

           INSPECT WM01-PESO-BRUTO-KG-TOT    CONVERTING '.' TO '!'.
           INSPECT WM01-PESO-BRUTO-KG-TOT    CONVERTING ',' TO '.'.
           INSPECT WM01-PESO-BRUTO-KG-TOT    CONVERTING '!' TO ','.

           MOVE '5720'                       TO WS01-PCL-POSICAO-X.
           MOVE '2980'                       TO WS01-PCL-POSICAO-Y.
           MOVE WM01-PESO-BRUTO-KG-TOT       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

      *    EXEC SQL SELECT LTRIM(TO_CHAR(
      *                          :WQ01-PESO-BRUTO-KG-TOT -
      *                          :WQ01-PESO-LIQUIDO-KG-TOT,
      *                          '9,999,999,990.000') || 'Kg')
      *             INTO   :WM01-PESO-EMB-KG-TOT
      *             FROM   DUAL
      *             WHERE  ROWNUM = 1
      *         END-EXEC.

           IF WS36-CD-MERC-DST  EQUAL  'E'
                EXEC SQL SELECT LTRIM(TO_CHAR(
                                      :WQ01-PESO-BRUTO-KG-TOT -
                                      :WQ01-PESO-LIQUIDO-KG-TOT,
                                      '9,999,999,990.000') || 'Kg')
                         INTO   :WM01-PESO-EMB-KG-TOT
                         FROM   DUAL
                         WHERE  ROWNUM = 1
                     END-EXEC
           ELSE
                EXEC SQL SELECT LTRIM(TO_CHAR(
                                     (SUM(C.PESO_BRT_ACND)/1000),
                                      '9,999,999,990.000') || 'Kg')
                         INTO   :WM01-PESO-EMB-KG-TOT
                         FROM   H1ST.VOLUME_RECOLHIMENTO B,
                                H1ST.TIPO_ACONDICIONAMENTO C
                         WHERE  EXISTS (SELECT 1
                                        FROM   H1SF.ITD_ITMFATURADO A
                                        WHERE  A.ITD_CD_MERC_DST  = 
                                               :SF0001-PTD-CD-MERC-DST
                                          AND  A.ITD_DTC_SEL_FTRM = 
                                               :SF0001-PTD-DTC-SEL-FTRM
                                          AND  A.ITD_LGON_FUNC    = 
                                               :SF0001-PTD-LGON-FUNC
                                          AND  A.ITD_ID_PTC_DSP   = 
                                               :SF0001-PTD-ID-PTC-DSP
                                          AND  B.ID_VOL = A.ITD_ID_VOL)
                           AND  C.CD_T_ACND        = B.CD_T_ACND
                     END-EXEC.

           INSPECT WM01-PESO-EMB-KG-TOT      CONVERTING '.' TO '!'.
           INSPECT WM01-PESO-EMB-KG-TOT      CONVERTING ',' TO '.'.
           INSPECT WM01-PESO-EMB-KG-TOT      CONVERTING '!' TO ','.

           MOVE '5720'                       TO WS01-PCL-POSICAO-X.
           MOVE '2770'                       TO WS01-PCL-POSICAO-Y.
           MOVE WM01-PESO-EMB-KG-TOT         TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           EXEC SQL SELECT B.CD_PDIO
                    INTO   :WM01-CD-PDIO :WI01-CD-PDIO
                    FROM   H1ST.VOLUME_RECOLHIMENTO B
                    WHERE  EXISTS (SELECT 1
                                   FROM   H1SF.ITD_ITMFATURADO A
                                   WHERE  A.ITD_CD_MERC_DST  = 
                                          :SF0001-PTD-CD-MERC-DST
                                     AND  A.ITD_DTC_SEL_FTRM = 
                                          :SF0001-PTD-DTC-SEL-FTRM
                                     AND  A.ITD_LGON_FUNC    = 
                                          :SF0001-PTD-LGON-FUNC
                                     AND  A.ITD_ID_PTC_DSP   = 
                                          :SF0001-PTD-ID-PTC-DSP
                                     AND  B.ID_VOL = A.ITD_ID_VOL)
                    AND    ROWNUM = 1
                END-EXEC.

           MOVE '*** PREDIO '                TO WM01-PREDIO-P1.
           MOVE ' ***'                       TO WM01-PREDIO-P2.
           
           MOVE '(s16901t3b0s13.00v1P'      TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '4900'                       TO WS01-PCL-POSICAO-X.
           MOVE '3190'                       TO WS01-PCL-POSICAO-Y.
           
           IF CB0004-CD-FBR  EQUAL  '28'
                MOVE '* CBL EXPEDICAO *'     TO WM01-PREDIO.

           MOVE WM01-PREDIO                  TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           EXEC SQL SELECT 1
                    FROM   H1SF.ITD_ITMFATURADO A,
                           H1SF.PRD_PERIGOSOS B
                    WHERE  A.ITD_ID_PECA = B.PRD_ID_PECA
                    AND    A.ITD_CD_MERC_DST = :SF0001-PTD-CD-MERC-DST
                    AND    A.ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                    AND    A.ITD_LGON_FUNC = :SF0001-PTD-LGON-FUNC
                    AND    A.ITD_ID_PTC_DSP = :SF0001-PTD-ID-PTC-DSP
                    AND    ROWNUM = 1
                END-EXEC.

           IF SQLCODE  NOT EQUAL  WS31-CHV-NTFD-SQL
                MOVE '4550'                  TO WS01-PCL-POSICAO-X
                MOVE '3410'                  TO WS01-PCL-POSICAO-Y
                MOVE '*** PRODUTOS PERIGOSOS  ***'
                                             TO WS01-PCL-DADOS
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5700'                       TO WS01-PCL-POSICAO-X.
           MOVE '3900'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0001-DT-SAIDA-MERCADORIAS  TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           IF CC0001-DT-SAIDA-MERCADORIAS  GREATER  SPACES
                PERFORM 545-00-GRAVA-DETALHE-REL.

        715-60-DADOS-DE-TRANSPORTE.

           EXEC SQL SELECT TPT_CD_TRSR_DSP
                    INTO    :SF0003-TPT-CD-TRSR-DSP
                                             :WI01-TPT-CD-TRSR-DSP
                    FROM   H1SF.TPT_TRANSPORTADORA
                    WHERE  TPT_ID_CLI      = :WQ01-ID-CLI-AUX
                    AND  TPT_CD_MOD_TRSP = :SF0002-ITD-CD-MOD-TRSP
                    AND  TPT_CD_TRSR = : SF0003-TPT-CD-TRSR
                    AND  ROWNUM = 1
                END-EXEC.

        715-70-DADOS-DE-TRSR-CCPR.

           EXEC SQL SELECT A.SFT_CD_TRSR
                    INTO    :SF0003-TPT-CD-TRSR  :WI01-TPT-CD-TRSR
                    FROM   H1SF.SFT_SELECAO_FTRM A
                    WHERE  A.SFT_CD_MERC_DST = :SF0001-PTD-CD-MERC-DST
                    AND    A.SFT_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                    AND    A.SFT_LGON_FUNC = :SF0001-PTD-LGON-FUNC
                    AND    ROWNUM = 1
                END-EXEC.
           
           IF WI01-TPT-CD-TRSR  GREATER  -1
                EXEC SQL AT CCPR
                         SELECT RAZAO_SOCIAL,
                                'CGC: ' || CPF_CGC,
                                LOGRADOURO || ' - ' || NUMERO || '   '
                                      || MUN_NOME || ' - ' || UF_CODIGO,
                                'Insc. Estadual: ' || INSCR_ESTADUAL
                         INTO   :CC0005-RAZAO-SOCIAL-E
                                                    :WI01-RAZAO-SOCIAL,
                                :CC0005-CPF-CGC-E        :WI01-CPF-CGC,
                                :CC0005-ENDERECO-E      :WI01-ENDERECO,
                                :CC0005-INSCR-ESTADUAL-E
                                                    :WI01-INSCR-ESTADUAL
                         FROM   B8CC.COR_PESSOA_VIGENTE
                         WHERE  PFJ_CODIGO = :SF0003-TPT-CD-TRSR
                     END-EXEC
           ELSE
                MOVE SPACES                  TO CC0005-RAZAO-SOCIAL-E
                                                CC0005-CPF-CGC-E
                                                CC0005-ENDERECO-E
                                                CC0005-INSCR-ESTADUAL-E
                MOVE -1                      TO WI01-RAZAO-SOCIAL
                                                WI01-CPF-CGC
                                                WI01-ENDERECO
                                                WI01-INSCR-ESTADUAL.

           MOVE '(s16901t3b0s9.00v1P'       TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '1100'                       TO WS01-PCL-RESET-X.
           MOVE '3940'                       TO WS01-PCL-RESET-Y.
           MOVE CC0005-RAZAO-SOCIAL-E        TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '1100'                       TO WS01-PCL-RESET-X.
           MOVE '4030'                       TO WS01-PCL-RESET-Y.
           MOVE CC0005-ENDERECO-E            TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '1100'                       TO WS01-PCL-RESET-X.
           MOVE '4120'                       TO WS01-PCL-RESET-Y.
           MOVE CC0005-CPF-CGC-E             TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2800'                       TO WS01-PCL-RESET-X.
           MOVE '4120'                       TO WS01-PCL-RESET-Y.
           MOVE CC0005-INSCR-ESTADUAL-E      TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           IF WI01-TPT-CD-TRSR-DSP  NOT GREATER  -1
                GO                           TO 715-90-RAZAO-SOCIAL.

           EXEC SQL AT CCPR
                    SELECT RAZAO_SOCIAL
                    INTO   :CC0005-RAZAO-SOCIAL-E
                                           :WI01-RAZAO-SOCIAL
                    FROM   B8CC.COR_PESSOA_VIGENTE
                    WHERE  PFJ_CODIGO = :SF0003-TPT-CD-TRSR-DSP
                END-EXEC.

           MOVE '1100'                       TO WS01-PCL-RESET-X.
           MOVE '4220'                       TO WS01-PCL-RESET-Y.
           MOVE CC0005-RAZAO-SOCIAL-E        TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       715-80-DADOS-VEI-TRSP.

           EXEC SQL SELECT ID_VEIC_TRSP,
                           UF_VEIC_TRSP,
                           INITCAP(LOWER(TRIM(NM_RSP_VEIC)))
                    INTO   :ST0004-ID-VEIC-TRSP :WI01-ID-VEIC-TRSP,
                           :ST0004-UF-VEIC-TRSP :WI01-UF-VEIC-TRSP,
                           :ST0004-NM-RESP-VEIC :WI01-NM-RESP-VEIC
                    FROM   H1ST.VOLUME_RECOLHIMENTO
                    WHERE  ID_VOL = :SF0002-ITD-ID-VOL-LOG
                    AND    ROWNUM = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL  OR
              WI01-ID-VEIC-TRSP  NOT GREATER  -1
                GO                           TO 715-90-RAZAO-SOCIAL.
       
           MOVE '(s16901t3b0s11.00v1P'      TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '1570'                       TO WS01-PCL-POSICAO-X.
           MOVE '4420'                       TO WS01-PCL-POSICAO-Y.
           MOVE ST0004-NM-RESP-VEIC          TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5250'                       TO WS01-PCL-RESET-X.
           MOVE '4420'                       TO WS01-PCL-RESET-Y.
           MOVE ST0004-ID-VEIC-TRSP          TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '6070'                       TO WS01-PCL-RESET-X.
           MOVE '4420'                       TO WS01-PCL-RESET-Y.
           MOVE ST0004-UF-VEIC-TRSP          TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       715-90-RAZAO-SOCIAL.

           MOVE '(19U(s16602t0b0s8.00v1P'  TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3495'                       TO WS01-PCL-RESET-X.
           MOVE '4704'                       TO WS01-PCL-RESET-Y.
           MOVE CC0008-RAZAO-SOCIAL-EPM      TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       715-99-MONTA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 06/06 *
      *                                                                *
      *  MONTAGEM DO PACK LIST DE DESPACHO.                            *
      *                                                                *
      *----------------------------------------------------------------*
      
       720-00-MONTA-PCK-LIST                 SECTION.
      *----------------------------------------------*

           MOVE '720-00-MONTA-PCK-LIST'      TO WS35-AUX-TS.    

           MOVE 'N'                          TO WS31-CHV-FIM-PCK-LST.
           MOVE SPACES                       TO WS01-ID-VOL-PCK-LST-ANT
                                                WS01-ID-PDD-PCK-LST-ANT.
                
           ADD 1                             TO WS01-NUM-VIAS-VOL.

           IF WS01-NUM-VIAS-VOL  EQUAL  1
                MOVE 1                       TO WS01-IND-PJL-PKLST-AUX
           ELSE
           IF WS01-NUM-VIAS-VOL  EQUAL  2
                IF WS36-CD-MERC-DST  EQUAL  'E'  AND
                   (SF0002-ITD-CD-MOD-TRSP  EQUAL  '1'  OR
                    SF0002-ITD-CD-MOD-TRSP  EQUAL  '2'  OR
                    SF0002-ITD-CD-MOD-TRSP  EQUAL  '3')
                     MOVE 21                 TO WS01-IND-PJL-PKLST-AUX
                ELSE
                     MOVE 3                  TO WS01-IND-PJL-PKLST-AUX
                END-IF
           ELSE
           IF WS01-NUM-VIAS-VOL  EQUAL  3
                MOVE 5                       TO WS01-IND-PJL-PKLST-AUX
           ELSE
                MOVE 7                       TO WS01-IND-PJL-PKLST-AUX.

           ADD WS01-IND-PJL-PKLST-AUX        TO WS01-CD-SQN-PJL-PKLST-N.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
           SUBTRACT WS01-IND-PJL-PKLST-AUX   FROM
                                                WS01-CD-SQN-PJL-PKLST-N.

       720-05-DEFINE-IDIOMA.

           IF SR0005-ID-IDM  NOT GREATER  SPACES
                EXEC SQL SELECT ID_IDM
                         INTO   :SR0005-ID-IDM :WI01-ID-IDM
                         FROM   H1SR.PRECO_FATURA_API
                         WHERE  ID_FTR = :SF0002-ITD-FTR-EXP
                         AND    ROWNUM     = 1
                     END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL   OR
              SR0005-ID-IDM  NOT GREATER  SPACES  OR
              WI01-ID-IDM    EQUAL  -1
                MOVE 'E'                     TO SR0005-ID-IDM.

       720-07-DEFINE-TITULO.
           
           IF WS31-CHV-DEA  EQUAL  'S'
                MOVE '00334'                 TO SR0002-ID-PARM
                MOVE '2600'                  TO WS01-POS-PACK-LIST-X
           ELSE
                MOVE '00333'                 TO SR0002-ID-PARM
                MOVE '2140'                  TO WS01-POS-PACK-LIST-X.

           PERFORM 530-00-RECUPERA-PARAMETRO.
           MOVE SR0002-CN-PARM               TO WS01-TITULO-PACK-LIST.

       720-10-MONTA-CORPO-INICIO.
       
           PERFORM 725-00-MONTA-CORPO-PCK-LIST.

       720-20-DADOS-DE-DETALHE.

           EXEC SQL DECLARE CSR_SEL_720  CURSOR FOR       
                    SELECT A.ITD_ID_VOL,
                           D.ID_VOL_CMIS2,
                           A.ITD_ID_PDD,
                           TO_CHAR(A.ITD_Q_PECA_FTRD,'999999990'),
                           SUBSTR(A.ITD_ID_PECA,1,3) || '-' ||
                                  SUBSTR(A.ITD_ID_PECA,4,17),
                           C.CD_PFO,
                           A.ITD_NM_PECA,
                           A.ITD_SRIE_PECA,
                           B.CLSF_FSCL,
                           TO_CHAR(A.ITD_PREC_US_API_UNT/100,
                                                       '9,999,990.00'),
                           TO_CHAR(A.ITD_Q_PECA_FTRD*
                                             A.ITD_PREC_US_API_UNT/100,
                                                     '999,999,990.00'),
                           TO_CHAR(A.ITD_Q_PECA_FTRD*
                                              A.ITD_PESO_LQD_PECA/1000,
                                                      '9,999,990.000')
                    FROM   H1SF.ITD_ITMFATURADO A,
                           H1SR.PECA B,
                           H1ST.ITEM_RECOLHIMENTO C,
                           H1ST.VOLUME_RECOLHIMENTO D
                    WHERE  A.ITD_ID_PECA      = B.ID_PECA
                    AND    A.ITD_ID_ETIQ_REC  = C.ID_ETIQ_REC
                    AND    A.ITD_ID_VOL       = D.ID_VOL
                    AND    A.ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                    AND    A.ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                    AND    A.ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                    AND    A.ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                    ORDER  BY A.ITD_ID_VOL,
                              A.ITD_ID_PDD,
                              A.ITD_ID_PECA,
                              C.CD_PFO
                END-EXEC.

           MOVE ZEROS                        TO WS01-SEQ-VOL-PTD.      
                
           EXEC SQL OPEN   CSR_SEL_720
                END-EXEC. 
                
       720-30-LOOP-DET-VOL.

           EXEC SQL FETCH  CSR_SEL_720
                    INTO   :SF0002-ITD-ID-VOL,
                           :WQ01-ID-VOL-CMIS2-PCKL
                                             :WI01-ID-VOL-CMIS2-PCKL,
                           :SF0002-ITD-ID-PDD,
                           :WQ01-Q-PCK-LIST,
                           :SF0002-ITD-ID-PECA,
                           :ST0005-CD-PFO        :WI01-CD-PFO,
                           :SF0002-ITD-NM-PECA,
                           :SF0002-ITD-SRIE-PECA,
                           :SR0004-CLSF-FSCL,
                           :WQ01-PRECO-API-PCK-LIST,
                           :WQ01-PRECO-API-PCK-LIST-TOT,
                           :WQ01-PESO-PCK-LIST-TOT
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE 'S'                     TO WS31-CHV-FIM-PCK-LST.

       720-40-VERIFICA-CAB-QUEBRA.

           IF SF0002-ITD-ID-VOL  NOT EQUAL  WS01-ID-VOL-PCK-LST-ANT  OR
              WS31-CHV-FIM-PCK-LST  EQUAL  'S'
                MOVE SPACES                  TO WS01-ID-PDD-PCK-LST-ANT
                IF WS01-ID-VOL-PCK-LST-ANT  GREATER  SPACES
                     ADD 1                   TO WS01-SEQ-VOL-PTD
                     IF WS01-SEQ-VOL-PTD  GREATER  48
                          MOVE 1             TO WS01-SEQ-VOL-PTD
                          PERFORM 725-00-MONTA-CORPO-PCK-LIST
                     END-IF
                     COMPUTE WS01-CALC-POS-AUX = 888 + 
                                       ((WS01-SEQ-VOL-PTD - 1) * 75)
                     MOVE WS01-CALC-POS-AUX  TO WS01-PCL-POSICAO-Y

                     MOVE WS01-ID-VOL-PCK-LST-ANT
                                             TO WQ01-ID-VOL-AUX

                     EXEC SQL SELECT TO_CHAR(SUM(ITD_Q_PECA_FTRD),
                                                           '999999990'),
                                     TO_CHAR(SUM(ITD_Q_PECA_FTRD
                                          *ITD_PREC_US_API_UNT/100),
                                                      '999,999,990.00'),
                                     TO_CHAR(SUM(ITD_Q_PECA_FTRD
                                             *ITD_PESO_LQD_PECA/1000),
                                                       '9,999,990.000')
                              INTO   :WQ01-Q-TOTAL-PCK-LIST,
                                     :WQ01-PRECO-TOTAL-API-PCK-LIST,
                                     :WQ01-PESO-TOTAL-PCK-LIST
                              FROM   H1SF.ITD_ITMFATURADO
                              WHERE  ITD_CD_MERC_DST  =
                                                :SF0001-PTD-CD-MERC-DST
                              AND    ITD_DTC_SEL_FTRM =
                                                :SF0001-PTD-DTC-SEL-FTRM
                              AND    ITD_LGON_FUNC    =
                                                :SF0001-PTD-LGON-FUNC
                              AND    ITD_ID_PTC_DSP   =
                                                :SF0001-PTD-ID-PTC-DSP
                              AND    ITD_ID_VOL       =
                                                :WQ01-ID-VOL-AUX
                          END-EXEC
                     MOVE '(s0p12.00h0s3b4099T'
                                             TO WS01-LINHA-IMPR-AUX
                     PERFORM 545-00-GRAVA-DETALHE-REL

                     MOVE '0060'             TO WS01-PCL-POSICAO-X
                     MOVE WQ01-Q-TOTAL-PCK-LIST
                                             TO WS01-PCL-DADOS
                     MOVE WS01-PCL           TO WS01-LINHA-IMPR-AUX
                     PERFORM 545-00-GRAVA-DETALHE-REL

                     IF SR0005-ID-IDM  EQUAL  'E'
                          MOVE ' CASE    - ' TO WS01-LN-TOTAL-PCK-AUX-2
                     ELSE
                          MOVE ' BULTO   - ' TO WS01-LN-TOTAL-PCK-AUX-2
                     END-IF
                     MOVE '<---------------------------  TOTAL'
                                             TO WS01-LN-TOTAL-PCK-AUX-1
                     MOVE WS01-ID-VOL-PCK-LST-ANT
                                             TO WS01-LN-TOTAL-CD-QBR
                     MOVE ' --------------------------------->'
                                             TO WS01-LN-TOTAL-PCK-AUX-3

                     MOVE '0675'             TO WS01-PCL-POSICAO-X
                     MOVE WS01-LN-TOTAL-PCK-AUX
                                             TO WS01-PCL-DADOS
                     MOVE WS01-PCL           TO WS01-LINHA-IMPR-AUX
                     PERFORM 545-00-GRAVA-DETALHE-REL

                     MOVE '5160'             TO WS01-PCL-POSICAO-X
                     MOVE WQ01-PRECO-TOTAL-API-PCK-LIST
                                             TO WS01-PCL-DADOS
                     MOVE WS01-PCL           TO WS01-LINHA-IMPR-AUX
                     PERFORM 545-00-GRAVA-DETALHE-REL

                     INSPECT WQ01-PESO-TOTAL-PCK-LIST
                                                  CONVERTING '.' TO '!'
                     INSPECT WQ01-PESO-TOTAL-PCK-LIST
                                                  CONVERTING ',' TO '.'
                     INSPECT WQ01-PESO-TOTAL-PCK-LIST
                                                  CONVERTING '!' TO ','
                     
                     MOVE '5930'             TO WS01-PCL-POSICAO-X
                     MOVE WQ01-PESO-TOTAL-PCK-LIST
                                             TO WS01-PCL-DADOS
                     MOVE WS01-PCL           TO WS01-LINHA-IMPR-AUX
                     PERFORM 545-00-GRAVA-DETALHE-REL
                END-IF
                IF WS01-ID-VOL-PCK-LST-ANT  GREATER  SPACES  AND
                   WS31-CHV-FIM-PCK-LST  EQUAL  'S'
                     ADD 1                   TO WS01-SEQ-VOL-PTD
                     IF WS01-SEQ-VOL-PTD  GREATER  48
                          MOVE 1             TO WS01-SEQ-VOL-PTD
                          PERFORM 725-00-MONTA-CORPO-PCK-LIST
                     END-IF
                     COMPUTE WS01-CALC-POS-AUX = 888 + 
                                       ((WS01-SEQ-VOL-PTD - 1) * 75)
                     MOVE WS01-CALC-POS-AUX  TO WS01-PCL-POSICAO-Y

                     EXEC SQL SELECT TO_CHAR(SUM(ITD_Q_PECA_FTRD),
                                                           '999999990'),
                                     TO_CHAR(SUM(ITD_Q_PECA_FTRD
                                        *ITD_PREC_US_API_UNT/100),
                                                      '999,999,990.00'),
                                     TO_CHAR(SUM(ITD_Q_PECA_FTRD
                                             *ITD_PESO_LQD_PECA/1000),
                                                       '9,999,990.000')
                              INTO   :WQ01-Q-TOTAL-PCK-LIST,
                                     :WQ01-PRECO-TOTAL-API-PCK-LIST,
                                     :WQ01-PESO-TOTAL-PCK-LIST
                              FROM   H1SF.ITD_ITMFATURADO
                              WHERE  ITD_CD_MERC_DST  =
                                                :SF0001-PTD-CD-MERC-DST
                              AND    ITD_DTC_SEL_FTRM =
                                                :SF0001-PTD-DTC-SEL-FTRM
                              AND    ITD_LGON_FUNC    =
                                                :SF0001-PTD-LGON-FUNC
                              AND    ITD_ID_PTC_DSP   =
                                                :SF0001-PTD-ID-PTC-DSP
                          END-EXEC

                     MOVE '(s0p12.00h0s3b4099T'
                                             TO WS01-LINHA-IMPR-AUX
                     PERFORM 545-00-GRAVA-DETALHE-REL

                     MOVE '0060'             TO WS01-PCL-POSICAO-X
                     MOVE WQ01-Q-TOTAL-PCK-LIST
                                             TO WS01-PCL-DADOS
                     MOVE WS01-PCL           TO WS01-LINHA-IMPR-AUX
                     PERFORM 545-00-GRAVA-DETALHE-REL

                     IF SR0005-ID-IDM  EQUAL  'E'
                          MOVE ' CNTRL   - ' TO WS01-LN-TOTAL-PCK-AUX-2
                     ELSE
                          MOVE ' CNTRL   - ' TO WS01-LN-TOTAL-PCK-AUX-2
                     END-IF
                     MOVE '<---------------------------  TOTAL'
                                             TO WS01-LN-TOTAL-PCK-AUX-1
                     MOVE SPACES             TO WS01-LN-TOTAL-CD-QBR
                     MOVE SF0002-ITD-FTR-EXP TO WS01-LN-TOTAL-CD-QBR
                     MOVE ' --------------------------------->'
                                             TO WS01-LN-TOTAL-PCK-AUX-3

                     MOVE '0675'             TO WS01-PCL-POSICAO-X
                     MOVE WS01-LN-TOTAL-PCK-AUX
                                             TO WS01-PCL-DADOS
                     MOVE WS01-PCL           TO WS01-LINHA-IMPR-AUX
                     PERFORM 545-00-GRAVA-DETALHE-REL

                     MOVE '5160'             TO WS01-PCL-POSICAO-X
                     MOVE WQ01-PRECO-TOTAL-API-PCK-LIST
                                             TO WS01-PCL-DADOS
                     MOVE WS01-PCL           TO WS01-LINHA-IMPR-AUX
                     PERFORM 545-00-GRAVA-DETALHE-REL

                     INSPECT WQ01-PESO-TOTAL-PCK-LIST
                                                  CONVERTING '.' TO '!'
                     INSPECT WQ01-PESO-TOTAL-PCK-LIST
                                                  CONVERTING ',' TO '.'
                     INSPECT WQ01-PESO-TOTAL-PCK-LIST
                                                  CONVERTING '!' TO ','
                     
                     MOVE '5930'             TO WS01-PCL-POSICAO-X
                     MOVE WQ01-PESO-TOTAL-PCK-LIST
                                             TO WS01-PCL-DADOS
                     MOVE WS01-PCL           TO WS01-LINHA-IMPR-AUX
                     PERFORM 545-00-GRAVA-DETALHE-REL
                     
                     GO                      TO 720-60-CLOSE-DET-VOL
                     
                END-IF
                
                ADD 1                        TO WS01-SEQ-VOL-PTD
                IF WS01-SEQ-VOL-PTD  GREATER  46
                     MOVE 1                  TO WS01-SEQ-VOL-PTD
                     PERFORM 725-00-MONTA-CORPO-PCK-LIST
                END-IF
                COMPUTE WS01-CALC-POS-AUX = 888 + 
                                       ((WS01-SEQ-VOL-PTD - 1) * 75)
                MOVE WS01-CALC-POS-AUX       TO WS01-PCL-POSICAO-Y

                MOVE '(19U(s16901t3b0s10.00v1P'
                                             TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL

                MOVE '1832'                  TO WS01-PCL-POSICAO-X
                IF SR0005-ID-IDM  EQUAL  'E'
                     MOVE 'CASE:'            TO WS01-PCL-DADOS
                ELSE
                     MOVE 'BULTO:'           TO WS01-PCL-DADOS
                END-IF
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL

                MOVE '2170'                  TO WS01-PCL-POSICAO-X
                IF WI01-ID-VOL-CMIS2-PCKL  GREATER  -1
                     MOVE WQ01-ID-VOL-CMIS2-PCKL
                                             TO WS01-PCL-DADOS
                ELSE
                     MOVE SF0002-ITD-ID-VOL  TO WS01-PCL-DADOS
                END-IF
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL

                MOVE SF0002-ITD-ID-VOL       TO WS01-ID-VOL-PCK-LST-ANT.
                
           IF SF0002-ITD-ID-PDD  NOT EQUAL  WS01-ID-PDD-PCK-LST-ANT
                ADD 1                        TO WS01-SEQ-VOL-PTD
                IF WS01-SEQ-VOL-PTD  GREATER  47
                     MOVE 1                  TO WS01-SEQ-VOL-PTD
                     PERFORM 725-00-MONTA-CORPO-PCK-LIST
                END-IF
                COMPUTE WS01-CALC-POS-AUX = 888 + 
                                       ((WS01-SEQ-VOL-PTD - 1) * 75)
                MOVE WS01-CALC-POS-AUX       TO WS01-PCL-POSICAO-Y

                MOVE '(19U(s16901t3b0s10.00v1P' 
                                             TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL

                MOVE '0686'                  TO WS01-PCL-POSICAO-X
                MOVE 'P.O.:'                 TO WS01-PCL-DADOS
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL

                MOVE '0905'                  TO WS01-PCL-POSICAO-X
                MOVE SF0002-ITD-ID-PDD       TO WS01-PCL-DADOS
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL
           
                MOVE SF0002-ITD-ID-PDD       TO WS01-ID-PDD-PCK-LST-ANT.

       720-50-IMPRIME-DETALHE.
                
           ADD 1                             TO WS01-SEQ-VOL-PTD.      
                
           IF WS01-SEQ-VOL-PTD  GREATER  48
                MOVE 1                       TO WS01-SEQ-VOL-PTD      
                PERFORM 725-00-MONTA-CORPO-PCK-LIST.
                
           COMPUTE WS01-CALC-POS-AUX = 888 + 
                                       ((WS01-SEQ-VOL-PTD - 1) * 75).

           MOVE WS01-CALC-POS-AUX             TO WS01-PCL-POSICAO-Y.

           MOVE '(s0p17.14h0s3b4099T'        TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0210'                       TO WS01-PCL-POSICAO-X.
           MOVE WQ01-Q-PCK-LIST              TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0686'                       TO WS01-PCL-POSICAO-X.
           MOVE SF0002-ITD-ID-PECA           TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '1500'                       TO WS01-PCL-POSICAO-X.
           MOVE ST0005-CD-PFO                TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '1832'                       TO WS01-PCL-POSICAO-X.
           MOVE SF0002-ITD-NM-PECA  TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2977'                       TO WS01-PCL-POSICAO-X.
           MOVE SF0002-ITD-SRIE-PECA  TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3820'                       TO WS01-PCL-POSICAO-X.
           MOVE SR0004-CLSF-FSCL  TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4646'                       TO WS01-PCL-POSICAO-X.
           MOVE WQ01-PRECO-API-PCK-LIST  TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5381'                       TO WS01-PCL-POSICAO-X.
           MOVE WQ01-PRECO-API-PCK-LIST-TOT  TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           INSPECT WQ01-PESO-PCK-LIST-TOT    CONVERTING '.' TO '!'.
           INSPECT WQ01-PESO-PCK-LIST-TOT    CONVERTING ',' TO '.'.
           INSPECT WQ01-PESO-PCK-LIST-TOT    CONVERTING '!' TO ','.

           MOVE '6132'                       TO WS01-PCL-POSICAO-X.
           MOVE WQ01-PESO-PCK-LIST-TOT  TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           GO                                TO 720-30-LOOP-DET-VOL.
           
       720-60-CLOSE-DET-VOL.
       
           EXEC SQL CLOSE  CSR_SEL_720
                END-EXEC.

       720-99-MONTA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 06/06 *
      *                                                                *
      *  MONTAGEM DO CORPO DO PACK LIST DE DESPACHO.                   *  
      *----------------------------------------------------------------*
      
       725-00-MONTA-CORPO-PCK-LIST           SECTION.
      *----------------------------------------------*

           MOVE '725-00-MONTA-CORPO-PCK-LIST'      TO  WS35-AUX-TS.
                
       725-10-CONTROLE-IMPRESSAO.

           MOVE 'E&f1020y2X'                   TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U(s16901t3b0s16.00v1P'   TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           IF SR0005-ID-IDM  EQUAL  'E'
                GO                           TO 725-30-CORPO-INGLES.

       725-20-CORPO-ESPANHOL.

           MOVE WS01-POS-PACK-LIST-X         TO WS01-PCL-POSICAO-X.
           MOVE '0329'                       TO WS01-PCL-POSICAO-Y.
           MOVE WS01-TITULO-PACK-LIST        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U(s16901t3b0s10.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '3170'                       TO WS01-PCL-POSICAO-X.
           MOVE '0468'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'LISTA DE EMBARQUE'          TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '(19U(s16901t3b0s14.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '5570'                       TO WS01-PCL-POSICAO-X.
           MOVE '0467'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'CNTRL No'                   TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '6214'                       TO WS01-PCL-POSICAO-X.
           MOVE '0467'                       TO WS01-PCL-POSICAO-Y.
           MOVE SF0002-ITD-FTR-EXP           TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U(s16901t0b0s10.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '0168'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'CANTIDAD'                   TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '1057'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'PIEZA No'                   TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2069'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'PIEZA NOMBRE'               TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3120'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'SERIE No'                   TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3969'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'NCM'                        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4643'                       TO WS01-PCL-POSICAO-X.
           MOVE '0658'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'PRECIO'                     TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4595'                       TO WS01-PCL-POSICAO-X.
           MOVE '0752'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'UNITARIO'                   TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5398'                       TO WS01-PCL-POSICAO-X.
           MOVE '0658'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'PRECIO'                     TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5409'                       TO WS01-PCL-POSICAO-X.
           MOVE '0752'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'TOTAL'                      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '6109'                       TO WS01-PCL-POSICAO-X.
           MOVE '0658'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'PESO LIQ.'                  TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '6165'                       TO WS01-PCL-POSICAO-X.
           MOVE '0752'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'TOTAL'                      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           GO                                TO 725-99-MONTA-EXIT.

       725-30-CORPO-INGLES.

           MOVE WS01-POS-PACK-LIST-X         TO WS01-PCL-POSICAO-X.
           MOVE '0329'                       TO WS01-PCL-POSICAO-Y.
           MOVE WS01-TITULO-PACK-LIST        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U(s16901t3b0s10.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '3220'                       TO WS01-PCL-POSICAO-X.
           MOVE '0468'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'PACKING LIST'               TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '(19U(s16901t3b0s14.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '5570'                       TO WS01-PCL-POSICAO-X.
           MOVE '0467'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'CNTRL No'                   TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '6214'                       TO WS01-PCL-POSICAO-X.
           MOVE '0467'                       TO WS01-PCL-POSICAO-Y.
           MOVE SF0002-ITD-FTR-EXP           TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U(s16901t0b0s10.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '0168'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'QUANTITY'                   TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '1057'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'PART No'                    TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2140'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'PART NAME'                  TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3160'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'SERIE No'                   TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3969'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'NCM'                        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4698'                       TO WS01-PCL-POSICAO-X.
           MOVE '0658'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'UNIT'                       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4683'                       TO WS01-PCL-POSICAO-X.
           MOVE '0752'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'PRICE'                      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5409'                       TO WS01-PCL-POSICAO-X.
           MOVE '0658'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'TOTAL'                      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5424'                       TO WS01-PCL-POSICAO-X.
           MOVE '0752'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'PRICE'                      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '6230'                       TO WS01-PCL-POSICAO-X.
           MOVE '0658'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'NET'                        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '6130'                       TO WS01-PCL-POSICAO-X.
           MOVE '0752'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'WEIGHT'                     TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       725-99-MONTA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 06/06 *
      *                                                                *
      *  MONTAGEM DO PACK LIST TOTAL DE DESPACHO.                      *
      *----------------------------------------------------------------*
      
       730-00-MONTA-PCK-LIST-RES             SECTION.
      *----------------------------------------------*

           MOVE '730-00-MONTA-PCK-LIST-RES'  TO WS35-AUX-TS.    

           ADD 1                             TO WS01-NUM-VIAS-VOL.

           IF WS01-NUM-VIAS-VOL  EQUAL  1
                MOVE 1                       TO WS01-IND-PJL-PKLST-AUX
           ELSE
           IF WS01-NUM-VIAS-VOL  EQUAL  2
                IF WS36-CD-MERC-DST  EQUAL  'E'  AND
                   (SF0002-ITD-CD-MOD-TRSP  EQUAL  '1'  OR
                    SF0002-ITD-CD-MOD-TRSP  EQUAL  '2'  OR
                    SF0002-ITD-CD-MOD-TRSP  EQUAL  '3')
                     MOVE 21                 TO WS01-IND-PJL-PKLST-AUX
                ELSE
                     MOVE 3                  TO WS01-IND-PJL-PKLST-AUX
                END-IF
           ELSE
           IF WS01-NUM-VIAS-VOL  EQUAL  3
                MOVE 5                       TO WS01-IND-PJL-PKLST-AUX
           ELSE
                MOVE 7                       TO WS01-IND-PJL-PKLST-AUX.

           ADD WS01-IND-PJL-PKLST-AUX        TO WS01-CD-SQN-PJL-PKLST-N.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
           SUBTRACT WS01-IND-PJL-PKLST-AUX   FROM
                                                WS01-CD-SQN-PJL-PKLST-N.

       730-10-MONTA-CORPO-INICIO.
       
           PERFORM 735-00-MONTA-CORPO-PCK-LIST-RE.

       730-20-DADOS-DE-DETALHE.

           EXEC SQL DECLARE CSR_SEL_730  CURSOR FOR
                    SELECT E.ITD_ID_VOL,
                           C.ID_VOL_CMIS2,
                           D.NM_ACND_ING,
                           D.NM_ACND_ESPN,
                           C.ALT_VOL,
                           C.CMP_VOL,
                           C.LRG_VOL,
                           TO_CHAR(TRUNC(C.ALT_VOL/100*C.CMP_VOL/100*
                                   C.LRG_VOL/100,3),'990.000'),
                           TO_CHAR(C.PESO_BRT_VOL/1000,'9,999,990.000'),
                           TO_CHAR((C.PESO_BRT_VOL-E.PESO_ITEM)/1000
                                                      ,'9,999,990.000'),
                           TO_CHAR(E.PESO_ITEM/1000,'9,999,990.000')
                    FROM   (SELECT A.ITD_ID_VOL,
                                   SUM(A.ITD_Q_PECA_FTRD
                                       *A.ITD_PESO_LQD_PECA)
                                                           AS PESO_ITEM
                                   FROM   H1SF.ITD_ITMFATURADO A
                                   WHERE  A.ITD_CD_MERC_DST  =
                                                :SF0001-PTD-CD-MERC-DST
                                   AND    A.ITD_DTC_SEL_FTRM =
                                                :SF0001-PTD-DTC-SEL-FTRM
                                   AND    A.ITD_LGON_FUNC    =
                                                :SF0001-PTD-LGON-FUNC
                                   AND    A.ITD_ID_PTC_DSP   =
                                                :SF0001-PTD-ID-PTC-DSP
                                   GROUP  BY A.ITD_ID_VOL) E,
                           H1ST.VOLUME_RECOLHIMENTO C,
                           H1ST.TIPO_ACONDICIONAMENTO D
                    WHERE  E.ITD_ID_VOL    = C.ID_VOL
                    AND    C.CD_T_ACND     = D.CD_T_ACND
                    ORDER  BY C.ID_VOL
                END-EXEC.

           MOVE ZEROS                        TO WS01-SEQ-VOL-PTD.      
                
           EXEC SQL OPEN   CSR_SEL_730
                END-EXEC. 
                
       730-30-LOOP-DET-VOL.

           EXEC SQL FETCH  CSR_SEL_730
                    INTO   :SF0002-ITD-ID-VOL,
                           :WQ01-ID-VOL-CMIS2-PCKL
                                             :WI01-ID-VOL-CMIS2-PCKL,
                           :ST0007-NM-ACND-ING,
                           :ST0007-NM-ACND-ESPN,
                           :ST0007-ALT-VOL,
                           :ST0007-CMP-VOL,
                           :ST0007-LRG-VOL,
                           :WQ01-MTS-CUB-VOL,
                           :WQ01-PESO-PCK-LIST-TOT,
                           :WQ01-PESO-PCK-LIST-TAR,
                           :WQ01-PESO-PCK-LIST-NET
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                           TO 730-50-CLOSE-DET-VOL.

       730-40-IMPRIME-DETALHE.
                
           ADD 1                             TO WS01-SEQ-VOL-PTD.      
                
           IF WS01-SEQ-VOL-PTD  GREATER  40
                MOVE 1                       TO WS01-SEQ-VOL-PTD      
                PERFORM 735-00-MONTA-CORPO-PCK-LIST-RE.
                
           COMPUTE WS01-CALC-POS-AUX = 888 + 
                                       ((WS01-SEQ-VOL-PTD - 1) * 75).

           MOVE WS01-CALC-POS-AUX            TO WS01-PCL-POSICAO-Y.

           MOVE '(s0p12.00h0s3b4099T'        TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0143'                       TO WS01-PCL-POSICAO-X.
           IF WI01-ID-VOL-CMIS2-PCKL  GREATER  -1
                MOVE WQ01-ID-VOL-CMIS2-PCKL  TO WS01-PCL-DADOS
           ELSE
                MOVE SF0002-ITD-ID-VOL       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0970'                       TO WS01-PCL-POSICAO-X.
           IF SR0005-ID-IDM  EQUAL  'E'
                MOVE ST0007-NM-ACND-ING      TO WS01-PCL-DADOS
           ELSE
                MOVE ST0007-NM-ACND-ESPN     TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2214'                       TO WS01-PCL-POSICAO-X.
           MOVE ST0007-ALT-VOL               TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2876'                       TO WS01-PCL-POSICAO-X.
           MOVE ST0007-CMP-VOL               TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3537'                       TO WS01-PCL-POSICAO-X.
           MOVE ST0007-LRG-VOL               TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           INSPECT WQ01-MTS-CUB-VOL          CONVERTING '.' TO '!'.
           INSPECT WQ01-MTS-CUB-VOL          CONVERTING ',' TO '.'.
           INSPECT WQ01-MTS-CUB-VOL          CONVERTING '!' TO ','.

           MOVE '4090'                       TO WS01-PCL-POSICAO-X.
           MOVE WQ01-MTS-CUB-VOL             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           INSPECT WQ01-PESO-PCK-LIST-TOT    CONVERTING '.' TO '!'.
           INSPECT WQ01-PESO-PCK-LIST-TOT    CONVERTING ',' TO '.'.
           INSPECT WQ01-PESO-PCK-LIST-TOT    CONVERTING '!' TO ','.

           MOVE '4630'                       TO WS01-PCL-POSICAO-X.
           MOVE WQ01-PESO-PCK-LIST-TOT       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           INSPECT WQ01-PESO-PCK-LIST-TAR    CONVERTING '.' TO '!'.
           INSPECT WQ01-PESO-PCK-LIST-TAR    CONVERTING ',' TO '.'.
           INSPECT WQ01-PESO-PCK-LIST-TAR    CONVERTING '!' TO ','.

           MOVE '5210'                       TO WS01-PCL-POSICAO-X.
           MOVE WQ01-PESO-PCK-LIST-TAR       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           INSPECT WQ01-PESO-PCK-LIST-NET    CONVERTING '.' TO '!'.
           INSPECT WQ01-PESO-PCK-LIST-NET    CONVERTING ',' TO '.'.
           INSPECT WQ01-PESO-PCK-LIST-NET    CONVERTING '!' TO ','.

           MOVE '5920'                       TO WS01-PCL-POSICAO-X.
           MOVE WQ01-PESO-PCK-LIST-NET       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           GO                                TO 730-30-LOOP-DET-VOL.
           
       730-50-CLOSE-DET-VOL.
       
           EXEC SQL CLOSE  CSR_SEL_730
                END-EXEC.

       730-60-MONTA-TOTAL-RES.

           EXEC SQL SELECT TO_CHAR(SUM(TRUNC(C.ALT_VOL/100*
                                             C.CMP_VOL/100*
                                           C.LRG_VOL/100,3)),'990.000'),
                           TO_CHAR(SUM(C.PESO_BRT_VOL)/1000,
                                                       '9,999,990.000'),
                           TO_CHAR(SUM(C.PESO_BRT_VOL-D.PESO_ITEM)/1000
                                                      ,'9,999,990.000'),
                           TO_CHAR(SUM(D.PESO_ITEM)/1000,
                                                       '9,999,990.000')
                    INTO   :WQ01-MTS-CUB-VOL,
                           :WQ01-PESO-PCK-LIST-TOT,
                           :WQ01-PESO-PCK-LIST-TAR,
                           :WQ01-PESO-PCK-LIST-NET
                    FROM   (SELECT A.ITD_ID_VOL,
                                   SUM(A.ITD_Q_PECA_FTRD
                                       *A.ITD_PESO_LQD_PECA)
                                                           AS PESO_ITEM
                                   FROM   H1SF.ITD_ITMFATURADO A
                                   WHERE  A.ITD_CD_MERC_DST  =
                                                :SF0001-PTD-CD-MERC-DST
                                   AND    A.ITD_DTC_SEL_FTRM =
                                                :SF0001-PTD-DTC-SEL-FTRM
                                   AND    A.ITD_LGON_FUNC    =
                                                :SF0001-PTD-LGON-FUNC
                                   AND    A.ITD_ID_PTC_DSP   =
                                                :SF0001-PTD-ID-PTC-DSP
                                   GROUP  BY A.ITD_ID_VOL) D,
                           H1ST.VOLUME_RECOLHIMENTO C
                    WHERE  D.ITD_ID_VOL    = C.ID_VOL
                END-EXEC.

           MOVE '(s0p12.00h0s3b4099T'          TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           IF SR0005-ID-IDM  EQUAL  'E'
                MOVE 'TOTAL PACKING LIST       '
                                               TO WS01-LN-LST-PCK-AUX-1
           ELSE
                MOVE 'TOTAL LISTA DE EMBARQUE  '
                                               TO WS01-LN-LST-PCK-AUX-1.
           MOVE '------------------------>'    TO WS01-LN-LST-PCK-AUX-2.

           MOVE '1135'                       TO WS01-PCL-POSICAO-X.
           MOVE '3935'                       TO WS01-PCL-POSICAO-Y.
           MOVE WS01-LN-LST-PCK-TOT-AUX      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           INSPECT WQ01-MTS-CUB-VOL          CONVERTING '.' TO '!'.
           INSPECT WQ01-MTS-CUB-VOL          CONVERTING ',' TO '.'.
           INSPECT WQ01-MTS-CUB-VOL          CONVERTING '!' TO ','.
           
           MOVE '4090'                       TO WS01-PCL-POSICAO-X.
           MOVE '3935'                       TO WS01-PCL-POSICAO-Y.
           MOVE WQ01-MTS-CUB-VOL             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           INSPECT WQ01-PESO-PCK-LIST-TOT    CONVERTING '.' TO '!'.
           INSPECT WQ01-PESO-PCK-LIST-TOT    CONVERTING ',' TO '.'.
           INSPECT WQ01-PESO-PCK-LIST-TOT    CONVERTING '!' TO ','.

           MOVE '4630'                       TO WS01-PCL-POSICAO-X.
           MOVE '3935'                       TO WS01-PCL-POSICAO-Y.
           MOVE WQ01-PESO-PCK-LIST-TOT       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           INSPECT WQ01-PESO-PCK-LIST-TAR    CONVERTING '.' TO '!'.
           INSPECT WQ01-PESO-PCK-LIST-TAR    CONVERTING ',' TO '.'.
           INSPECT WQ01-PESO-PCK-LIST-TAR    CONVERTING '!' TO ','.

           MOVE '5210'                       TO WS01-PCL-POSICAO-X.
           MOVE '3935'                       TO WS01-PCL-POSICAO-Y.
           MOVE WQ01-PESO-PCK-LIST-TAR       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           INSPECT WQ01-PESO-PCK-LIST-NET    CONVERTING '.' TO '!'.
           INSPECT WQ01-PESO-PCK-LIST-NET    CONVERTING ',' TO '.'.
           INSPECT WQ01-PESO-PCK-LIST-NET    CONVERTING '!' TO ','.

           MOVE '5920'                       TO WS01-PCL-POSICAO-X.
           MOVE '3935'                       TO WS01-PCL-POSICAO-Y.
           MOVE WQ01-PESO-PCK-LIST-NET       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           EXEC SQL DECLARE CSR_SEL_730_T  CURSOR FOR
                    SELECT MAX(C.NM_ACND_ING)
                                            || ' = ' || COUNT(B.ID_VOL),
                           MAX(C.NM_ACND_ESPN)
                                            || ' = ' || COUNT(B.ID_VOL)
                    FROM   H1ST.VOLUME_RECOLHIMENTO B,
                           H1ST.TIPO_ACONDICIONAMENTO C
                    WHERE  B.CD_T_ACND     = C.CD_T_ACND
                    AND    EXISTS (SELECT 1
                                   FROM   H1SF.ITD_ITMFATURADO A
                                   WHERE  A.ITD_ID_VOL = B.ID_VOL
                                   AND    A.ITD_CD_MERC_DST  =
                                                :SF0001-PTD-CD-MERC-DST
                                   AND    A.ITD_DTC_SEL_FTRM =
                                                :SF0001-PTD-DTC-SEL-FTRM
                                   AND    A.ITD_LGON_FUNC    =
                                                :SF0001-PTD-LGON-FUNC
                                   AND    A.ITD_ID_PTC_DSP   =
                                                :SF0001-PTD-ID-PTC-DSP
                                   AND    ROWNUM = 1)
                    GROUP  BY C.CD_T_ACND
                    ORDER  BY C.CD_T_ACND
                END-EXEC.
                
           MOVE '0000'                       TO WS01-PCL-POSICAO-X.
           MOVE '4078'                       TO WS01-PCL-POSICAO-Y.

           EXEC SQL OPEN   CSR_SEL_730_T
                END-EXEC. 

       730-70-LOOP-DET-TOT.

           EXEC SQL FETCH  CSR_SEL_730_T
                    INTO   :WQ01-NM-ACND-TOT-ING,
                           :WQ01-NM-ACND-TOT-ESPN
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                           TO 730-80-CLOSE-DET-TOT.

           IF WS01-PCL-POSICAO-X  EQUAL  '5400'
                MOVE WS01-PCL-POSICAO-Y      TO WS01-CALC-POS-AUX
                COMPUTE WS01-CALC-POS-AUX = WS01-CALC-POS-AUX + 142
                MOVE WS01-CALC-POS-AUX       TO WS01-PCL-POSICAO-Y
                MOVE '0000'                  TO WS01-PCL-POSICAO-X.

           IF WS01-PCL-POSICAO-X  EQUAL  '0000'
                MOVE '0200'                  TO WS01-PCL-POSICAO-X
           ELSE
                MOVE WS01-PCL-POSICAO-X      TO WS01-CALC-POS-AUX
                COMPUTE WS01-CALC-POS-AUX = WS01-CALC-POS-AUX + 1300
                MOVE WS01-CALC-POS-AUX       TO WS01-PCL-POSICAO-X.

           IF SR0005-ID-IDM  EQUAL  'E'
                MOVE WQ01-NM-ACND-TOT-ING    TO WS01-PCL-DADOS
           ELSE
                MOVE WQ01-NM-ACND-TOT-ESPN   TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           GO                                TO 730-70-LOOP-DET-TOT.

       730-80-CLOSE-DET-TOT.
       
           EXEC SQL CLOSE  CSR_SEL_730_T
                END-EXEC.

       730-99-MONTA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 06/06 *
      *                                                                *
      *  MONTAGEM DO CORPO DO PACK LIST TOTAL DE DESPACHO.             *
      *----------------------------------------------------------------*
      
       735-00-MONTA-CORPO-PCK-LIST-RE        SECTION.
      *----------------------------------------------*

           MOVE '735-00-MONTA-CORPO-PCK-LIST-RE'
                                                 TO  WS35-AUX-TS.
                
       735-10-CONTROLE-IMPRESSAO.

           MOVE 'E&f1010y2X'                   TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           IF SR0005-ID-IDM  EQUAL  'E'
                GO                           TO 735-30-CORPO-INGLES.

       735-20-CORPO-ESPANHOL.

           MOVE '(19U(s16901t3b0s16.00v1P'   TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE WS01-POS-PACK-LIST-X         TO WS01-PCL-POSICAO-X.
           MOVE '0329'                       TO WS01-PCL-POSICAO-Y.
           MOVE WS01-TITULO-PACK-LIST        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U(s16901t3b0s10.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '3170'                       TO WS01-PCL-POSICAO-X.
           MOVE '0468'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'LISTA DE EMBARQUE'          TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '(19U(s16901t3b0s14.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '5570'                       TO WS01-PCL-POSICAO-X.
           MOVE '0467'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'CNTRL No'                   TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '6214'                       TO WS01-PCL-POSICAO-X.
           MOVE '0467'                       TO WS01-PCL-POSICAO-Y.
           MOVE SF0002-ITD-FTR-EXP           TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U(s16901t0b0s10.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '0334'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'No BULTO'                   TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '1254'                       TO WS01-PCL-POSICAO-X.
           MOVE '0646'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'TIPO DE'                    TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '1195'                       TO WS01-PCL-POSICAO-X.
           MOVE '0764'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'EMBALAJE'                   TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2299'                       TO WS01-PCL-POSICAO-X.
           MOVE '0646'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'DIMENSIONES CENTIMETROS'    TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2046'                       TO WS01-PCL-POSICAO-X.
           MOVE '0776'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'ALTURA'                     TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2729'                       TO WS01-PCL-POSICAO-X.
           MOVE '0776'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'ANCHO'                      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '3395'                       TO WS01-PCL-POSICAO-X.
           MOVE '0776'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'LARGO'                      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4031'                       TO WS01-PCL-POSICAO-X.
           MOVE '0646'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'METROS'                     TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4025'                       TO WS01-PCL-POSICAO-X.
           MOVE '0764'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'CUBICOS'                    TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4679'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'PESO BRUTO'                 TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5527'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'TARA'                       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '6078'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'PESO NETO'                  TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           GO                                TO 735-99-MONTA-EXIT.

       735-30-CORPO-INGLES.

           MOVE '(19U(s16901t3b0s16.00v1P'   TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE WS01-POS-PACK-LIST-X         TO WS01-PCL-POSICAO-X.
           MOVE '0329'                       TO WS01-PCL-POSICAO-Y.
           MOVE WS01-TITULO-PACK-LIST        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U(s16901t3b0s10.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '3220'                       TO WS01-PCL-POSICAO-X.
           MOVE '0468'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'PACKING LIST'               TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '(19U(s16901t3b0s14.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '5570'                       TO WS01-PCL-POSICAO-X.
           MOVE '0467'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'CNTRL No'                   TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '6214'                       TO WS01-PCL-POSICAO-X.
           MOVE '0467'                       TO WS01-PCL-POSICAO-Y.
           MOVE SF0002-ITD-FTR-EXP           TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U(s16901t0b0s10.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '0304'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'PACKAGE No'                 TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '1294'                       TO WS01-PCL-POSICAO-X.
           MOVE '0646'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'TYPE'                       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '1205'                       TO WS01-PCL-POSICAO-X.
           MOVE '0764'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'PACKAGE'                    TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2299'                       TO WS01-PCL-POSICAO-X.
           MOVE '0646'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'DIMENSIONS CENTIMETERS'     TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2046'                       TO WS01-PCL-POSICAO-X.
           MOVE '0776'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'HEIGHT'                     TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2729'                       TO WS01-PCL-POSICAO-X.
           MOVE '0776'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'LENGTH'                     TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '3395'                       TO WS01-PCL-POSICAO-X.
           MOVE '0776'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'WIDTH'                      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4070'                       TO WS01-PCL-POSICAO-X.
           MOVE '0646'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'CUBIC'                      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4031'                       TO WS01-PCL-POSICAO-X.
           MOVE '0764'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'METERS'                     TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4650'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'GROSS WEIGHT'               TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5527'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'TARE'                       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '6060'                       TO WS01-PCL-POSICAO-X.
           MOVE '0705'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'NET WEIGHT'                 TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       735-99-MONTA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 03/09 *
      *                                                                *
      *  MOVIMENTACAO DE DADOS COM CODIGO PCL.                         *  
      *----------------------------------------------------------------*
      
       740-00-PCL-DETALHE                    SECTION.
      *----------------------------------------------*

           MOVE '740-00-PCL-DETALHE'         TO WS35-AUX-TS.  
                
       740-10-DEFINE-LINHA.

           PERFORM 780-00-TROCA-PONTO-DETALHE.
           
           PERFORM 747-00-TRATA-QUEBRA-PAGINA.

       740-20-DETALHE.

           MOVE '(19U(s4099t0b0s20.00h6.00v0P'
                                             TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0036'                       TO WS01-PCL-POSICAO-X.
           IF CB0004-CD-T-PRD  EQUAL  'P'
                MOVE CC0002-MERC-CODIGO      TO WS01-PCL-DADOS
           ELSE
                MOVE CC0002-MERC-CODIGO-LIMPO
                                             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE CC0002-IDF-TEXTO-COMPLEMENTAR
                                        TO WS01-TEXTO-COMPLEMENTAR-EMIF.

           IF WS36-CD-MERC-DST  EQUAL  'D'
                MOVE CC0005-NOME             TO WS01-NOME
                MOVE WS01-TEXTO-COMPLEMENTAR TO WS01-TXT-CLPM

                MOVE '0745'                  TO WS01-PCL-POSICAO-X
                MOVE WS01-DESC-TXT-CMPL      TO WS01-PCL-DADOS
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL
           ELSE
                MOVE CC0005-DESCRICAO        TO WS01-DESCRICAO

                MOVE '0745'                  TO WS01-PCL-POSICAO-X
                MOVE WS01-DESCRICAO-LNH-01   TO WS01-PCL-DADOS
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2777'                       TO WS01-PCL-POSICAO-X.
           MOVE CC0002-NBM-CODIGO-DEA        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3048'                       TO WS01-PCL-POSICAO-X.
           MOVE CC0002-OM-CODIGO             TO WS01-SIT-1.
           MOVE CC0002-STC-CODIGO            TO WS01-SIT-2.
           MOVE WS01-SIT-TRIB                TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3178'                       TO WS01-PCL-POSICAO-X.
           MOVE CC0002-CFOP-CODIGO           TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '3332'                       TO WS01-PCL-POSICAO-X.
           MOVE CC0002-ENTSAI-UNI-CODIGO     TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3520'                       TO WS01-PCL-POSICAO-X.
           MOVE CC0002-QTD                   TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3744'                       TO WS01-PCL-POSICAO-X.
           MOVE CC0002-PRECO-UNITARIO        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4016'                       TO WS01-PCL-POSICAO-X.
           MOVE WM01-PRECO-TOTAL             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4371'                       TO WS01-PCL-POSICAO-X.
           MOVE WM01-VL-BASE-ICMS            TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4749'                       TO WS01-PCL-POSICAO-X.
           MOVE WM01-VL-ICMS                 TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '5103'                       TO WS01-PCL-POSICAO-X.
           MOVE WM01-VL-BASE-ICMS-STF        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5457'                       TO WS01-PCL-POSICAO-X.
           MOVE WM01-VL-ICMS-STF             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5801'                       TO WS01-PCL-POSICAO-X.
           MOVE WM01-VL-IPI                  TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '6320'                       TO WS01-PCL-POSICAO-X.
           MOVE WM01-ALIQ-ICMS               TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '6533'                       TO WS01-PCL-POSICAO-X.
           MOVE WM01-ALIQ-IPI                TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           IF WS01-DESCRICAO-LNH-02  GREATER  SPACES
                PERFORM 747-00-TRATA-QUEBRA-PAGINA

                MOVE '(19U(s4099t0b0s20.00h6.00v0P'
                                             TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL
           
                MOVE '0745'                  TO WS01-PCL-POSICAO-X
                MOVE WS01-DESCRICAO-LNH-02   TO WS01-PCL-DADOS
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE SPACES                       TO WS01-DESCRICAO-COMPLETA.
           MOVE ZEROS                        TO WS01-IND-DESC-CPLT.

           IF WS36-CD-MERC-DST  EQUAL  'D'
                MOVE WS01-CTP-DESCR-COMPLETA TO WS01-DESCRICAO-COMPLETA
           ELSE
                MOVE WQ01-TEXTO-COMPLEMENTAR-EXP
                                             TO WS01-DESCRICAO-COMPLETA.

       740-30-LOOP-DESC-CPLT.
       
           ADD 1                             TO WS01-IND-DESC-CPLT.

           IF WS01-IND-DESC-CPLT  GREATER  10  OR
              WS01-LIN-DESC-CPLT(WS01-IND-DESC-CPLT) NOT GREATER SPACES
                GO                           TO 740-99-PCL-EXIT.

           PERFORM 747-00-TRATA-QUEBRA-PAGINA.

           MOVE '(19U(s4099t0b0s20.00h6.00v0P'
                                             TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0745'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-LIN-DESC-CPLT(WS01-IND-DESC-CPLT)
                                             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           GO                                TO 740-30-LOOP-DESC-CPLT.

       740-99-PCL-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 03/09 *
      *                                                                *
      *  MOVIMENTACAO DE DADOS COM CODIGO PCL.                         *  
      *----------------------------------------------------------------*
      
       745-00-PCL-DANFE                      SECTION.
      *----------------------------------------------*

           MOVE '745-00-PCL-DANFE'           TO  WS35-AUX-TS.

           PERFORM 170-00-DEFINE-VIAS-ORDENACAO.

           IF WS01-ID-VIA  EQUAL  2
                IF WS36-CD-MERC-DST  EQUAL  'D'  AND
                   WS36-FASE-FTRM  EQUAL  '2'
                     MOVE '97'               TO WS01-CD-SQN-PJL-NF
                ELSE
                     MOVE '99'               TO WS01-CD-SQN-PJL-NF
                END-IF
           ELSE
           IF WS01-ID-VIA  EQUAL  3
                MOVE '99'                    TO WS01-CD-SQN-PJL-NF
           END-IF.

           MOVE WS01-CD-SQN-PJL-NF           TO CB0002-DRE-CD-SQN-PJL.

           ADD 1                             TO WS01-NUM-PAG-AUX.

           IF WS01-IC-PAG-ADIC  EQUAL  'S'
                GO                           TO 745-10-CNTR-PAG-ADICION.

       745-05-CNTR-PRIMEIRA-PAG.

           IF CC0001-NFE-CONTINGENCIA  EQUAL  'S'  OR
              CC0001-NFE-COD-SITUACAO  EQUAL  'SYN027'
                MOVE 2                        TO WS01-QTDE-VIA-DANFE
           ELSE
                IF WS36-CD-MERC-DST  EQUAL  'D'  AND
                   WS36-FASE-FTRM  EQUAL  '2'
                     MOVE 2                   TO WS01-QTDE-VIA-DANFE
                ELSE
                     MOVE 1                   TO WS01-QTDE-VIA-DANFE
                END-IF.

           IF (CC0001-NFE-CONTINGENCIA  EQUAL  'S'  OR
               CC0001-NFE-COD-SITUACAO  EQUAL  'SYN027')  AND
              (WS01-ID-VIA  EQUAL  1  OR
               WS01-ID-VIA  EQUAL  2)
                MOVE 'E&l0S&l9H&f4005y2x&u600D*p0x0Y'
                                              TO WS01-LINHA-IMPR-AUX
           ELSE
                MOVE 'E&l0S&l1H&f4005y2x&u600D*p0x0Y'
                                              TO WS01-LINHA-IMPR-AUX.

      *    IF WS01-ID-VIA  EQUAL  1
      *         IF CC0001-NFE-CONTINGENCIA  EQUAL  'S'
      *              MOVE 
      *              'E&l0S&l20H&f4005y2x&u600D*p0x0Y'
      *                                       TO WS01-LINHA-IMPR-AUX
      *         ELSE
      *              MOVE 
      *              'E&l0S&l1H&f4005y2x&u600D*p0x0Y'
      *                                       TO WS01-LINHA-IMPR-AUX
      *         END-IF
      *    ELSE
      *    IF WS01-ID-VIA  EQUAL  2
      *         IF CC0001-NFE-CONTINGENCIA  EQUAL  'S'
      *              MOVE
      *              'E&l0S&l20H&f4005y2x&u600D*p0x0Y'
      *                                       TO WS01-LINHA-IMPR-AUX
      *         ELSE
      *              MOVE 
      *              'E&l0S&l1H&f4005y2x&u600D*p0x0Y'
      *                                       TO WS01-LINHA-IMPR-AUX
      *         END-IF
      *    ELSE
      *    IF WS01-ID-VIA  EQUAL  3
      *         MOVE 
      *         'E&l0S&l1H&f4005y2x&u600D*p0x0Y'
      *                                       TO WS01-LINHA-IMPR-AUX
      *    ELSE
      *         MOVE 
      *         'E&l0S&l1H&f4005y2x&u600D*p0x0Y'
      *                                       TO WS01-LINHA-IMPR-AUX.

           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           GO                                 TO 745-15-SELECIONA-DADOS.

       745-10-CNTR-PAG-ADICION.

           IF CC0001-NFE-CONTINGENCIA  EQUAL  'S'  OR
              CC0001-NFE-COD-SITUACAO  EQUAL  'SYN027'
                MOVE 2                        TO WS01-QTDE-VIA-DANFE
           ELSE
                IF WS36-CD-MERC-DST  EQUAL  'D'  AND
                   WS36-FASE-FTRM  EQUAL  '2'
                     MOVE 2                   TO WS01-QTDE-VIA-DANFE
                ELSE
                     MOVE 1                   TO WS01-QTDE-VIA-DANFE
                END-IF.

           IF (CC0001-NFE-CONTINGENCIA  EQUAL  'S'  OR
               CC0001-NFE-COD-SITUACAO  EQUAL  'SYN027')  AND
              (WS01-ID-VIA  EQUAL  1  OR
               WS01-ID-VIA  EQUAL  2)
                MOVE 'E&l9H&f4007y2x&u600D*p0x0Y'
                                              TO WS01-LINHA-IMPR-AUX
           ELSE
                MOVE 'E&l1H&f4007y2x&u600D*p0x0Y'
                                              TO WS01-LINHA-IMPR-AUX.

      *    IF WS01-ID-VIA  EQUAL  1
      *         IF CC0001-NFE-CONTINGENCIA  EQUAL  'S'
      *              MOVE 
      *              'E&l20H&f4007y2x&u600D*p0x0Y'
      *                                       TO WS01-LINHA-IMPR-AUX
      *         ELSE
      *              MOVE 
      *              'E&l1H&f4007y2x&u600D*p0x0Y'
      *                                       TO WS01-LINHA-IMPR-AUX
      *         END-IF
      *    ELSE
      *    IF WS01-ID-VIA  EQUAL  2
      *         IF CC0001-NFE-CONTINGENCIA  EQUAL  'S'
      *              MOVE 
      *              'E&l20H&f4007y2x&u600D*p0x0Y'
      *                                       TO WS01-LINHA-IMPR-AUX
      *         ELSE
      *              MOVE 
      *              'E&l1H&f4007y2x&u600D*p0x0Y'
      *                                       TO WS01-LINHA-IMPR-AUX
      *         END-IF
      *    ELSE
      *    IF WS01-ID-VIA  EQUAL  3
      *         MOVE 
      *         'E&l1H&f4007y2x&u600D*p0x0Y'
      *                                       TO WS01-LINHA-IMPR-AUX
      *    ELSE
      *         MOVE 
      *         'E&l1H&f4007y2x&u600D*p0x0Y'
      *                                       TO WS01-LINHA-IMPR-AUX.

           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           GO                                 TO 745-20-CORPO.

       745-15-SELECIONA-DADOS.

           EXEC SQL SELECT ITD_CD_MOD_TRSP, 
                           ITD_ID_VOL  
                    INTO   :SF0002-ITD-CD-MOD-TRSP,
                           :WQ04-ITD-ID-VOL
                    FROM   H1SF.ITD_ITMFATURADO
                   WHERE  ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                     AND  ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                     AND  ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                     AND  ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                     AND  ROWNUM = 1
                END-EXEC.

           EXEC SQL SELECT RA.CD_FBR,
                           RA.CD_T_REC,
                           RA.DESC_REC,
                           RA.CD_T_ATND
                    INTO   :ST0001-CD-FBR,
                           :ST0001-CD-T-REC,
                           :ST0001-DESC-REC,
                           :ST0001-CD-T-ATND
                    FROM   H1ST.TIPO_RECOLHIMENTO RA,
                           H1SF.ITD_ITMFATURADO RB
                   WHERE  RB.ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                     AND  RB.ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                     AND  RB.ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                     AND  RB.ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                     AND  RB.ITD_CD_T_REC     = RA.CD_T_REC
                     AND  ROWNUM = 1
                END-EXEC.

           MOVE ST0001-DESC-REC              TO WS01-ORIGEM.
           PERFORM 910-00-TIPO-PEDIDO.
           MOVE WS01-DESTINO                 TO ST0001-DESC-REC.

           MOVE 'N'                          TO WS01-TERMO-SPPP.

           EXEC SQL SELECT 1
                    FROM   H1SF.ITD_ITMFATURADO DA
                   WHERE   DA.ITD_ID_NF  = :CC0001-NUMERO
                     AND   EXISTS 
                            (SELECT 1
                               FROM H1ST.ITEM_RECOLHIMENTO DB
                              WHERE DB.ID_ETIQ_REC =
                                    DA.ITD_ID_ETIQ_REC
                                AND DB.CD_PGT_SPPP IS NOT NULL
                                AND EXISTS
                                     (SELECT 1
                                       FROM H1SF.CPS_CONDPGT_SPPP DC
                                      WHERE DC.CPS_CD_PGT_SPPP =
                                            DB.CD_PGT_SPPP
                                        AND ROWNUM = 1)
                                AND ROWNUM = 1)
                     AND   ROWNUM = 1 
                END-EXEC.

           IF SQLCODE  NOT EQUAL  WS31-CHV-NTFD-SQL
                MOVE 'S'                     TO WS01-TERMO-SPPP.

           EXEC SQL SELECT ITD_FTR_EXP
                    INTO   :SF0002-ITD-FTR-EXP :WI01-ITD-FTR-EXP
                    FROM   H1SF.ITD_ITMFATURADO
                   WHERE   ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                     AND   ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                     AND   ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                     AND   ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                     AND   ITD_ID_NF        = :CC0001-NUMERO
                     AND   ROWNUM = 1
                END-EXEC.

           IF WS36-CD-MERC-DST  EQUAL  'D'
                EXEC SQL SELECT NVL(COUNT(*),0)
                         INTO   :WQ01-TTL-LNH-DESC-ITM
                         FROM   H1SF.ITD_ITMFATURADO
                         WHERE  ITD_CD_MERC_DST  =
                                                :SF0001-PTD-CD-MERC-DST
                         AND    ITD_DTC_SEL_FTRM =
                                                :SF0001-PTD-DTC-SEL-FTRM
                         AND    ITD_LGON_FUNC    =
                                                :SF0001-PTD-LGON-FUNC
                         AND    ITD_ID_PTC_DSP   =
                                                :SF0001-PTD-ID-PTC-DSP
                         AND    ITD_ID_NF        = :CC0001-NUMERO
                     END-EXEC
           ELSE
                EXEC SQL AT CCPR
                         SELECT NVL(SUM(DECODE(CEIL(
                                      LENGTH(B.DESCRICAO)/66),1,1,2)),0)
                         INTO   :WQ01-TTL-LNH-DESC-ITM
                         FROM   B8CC.COR_IDF A,
                                B8CC.COR_MERCADORIA B
                         WHERE  A.MERC_CODIGO = B.MERC_CODIGO
                         AND    A.DOF_SEQUENCE = :CC0001-DOF-SEQUENCE
                     END-EXEC.

           INSPECT WQ01-TTL-LNH-DESC-ITM     CONVERTING SPACES TO ZEROS.
           MOVE WQ01-TTL-LNH-DESC-ITM        TO WS01-TTL-LNH-DESC-ITM.

           PERFORM 746-00-CALCULA-LINHAS-DANFE.

           IF (WS01-TTL-LNH-DESC-ITM + WS01-TOT-LNH-DESC-CPLT)  LESS  17
                MOVE 1                       TO WS01-TTL-PAG-AUX
           ELSE
                COMPUTE WS01-TTL-PAG-AUX ROUNDED =
                            (((((WS01-TTL-LNH-DESC-ITM +
                                 WS01-TOT-LNH-DESC-CPLT) - 16) / 50) +
                                                             0,49) + 1).

       745-20-CORPO.

           MOVE '*p90x250Y&f4011y2X'       TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U(s16901t3b0s12.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE CC0008-RAZAO-SOCIAL-E        TO WS01-RAZAO-SOCIAL-ED.

           MOVE '1253'                       TO WS01-PCL-POSICAO-X.
           MOVE '0159'                       TO WS01-PCL-POSICAO-Y.
           MOVE WS01-RAZAO-SOCIAL-ED-P1      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           IF WS01-RAZAO-SOCIAL-ED-P2  GREATER  SPACES
                MOVE '1253'                  TO WS01-PCL-POSICAO-X
                MOVE '0253'                  TO WS01-PCL-POSICAO-Y
                MOVE WS01-RAZAO-SOCIAL-ED-P2 TO WS01-PCL-DADOS
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U(s16901t3b0s08.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE 336                          TO WS01-POS-ENDR-AUX.
           MOVE CC0008-ENDERECO-ED           TO WS01-ENDERECO-ED.

           MOVE '1253'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-POS-ENDR-AUX            TO WS01-PCL-POSICAO-Y.
           MOVE WS01-ENDERECO-ED             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           ADD 71                            TO WS01-POS-ENDR-AUX.

           MOVE ZEROS                        TO WQ01-IND-END-AUX.

           IF WI01-COMPLEMENTO  NOT GREATER  -1
                GO                           TO 745-30-CORPO-CONTINUA.

       745-25-CORPO-COMPLEM.

           ADD 1                             TO WQ01-IND-END-AUX.

           EXEC SQL SELECT NVL(INSTR(:CC0008-COMPLEMENTO,' ',-1,
                                              :WQ01-IND-END-AUX),0),
                           NVL(LENGTH(TRIM(:CC0008-COMPLEMENTO)),0)
                    INTO   :WQ01-IND-INSTR-AUX,
                           :WQ01-IND-LEN-MAX-AUX
                    FROM   DUAL
                END-EXEC.
           
           IF WQ01-IND-INSTR-AUX  GREATER  48
                GO                           TO 745-25-CORPO-COMPLEM.

           MOVE '1253'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-POS-ENDR-AUX            TO WS01-PCL-POSICAO-Y.
           MOVE CC0008-COMPLEMENTO(1:WQ01-IND-INSTR-AUX)
                                             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           ADD 71                            TO WS01-POS-ENDR-AUX.
           
           ADD 1                             TO WQ01-IND-INSTR-AUX.
           IF CC0008-COMPLEMENTO(WQ01-IND-INSTR-AUX:100)  GREATER SPACES
                MOVE '1253'                  TO WS01-PCL-POSICAO-X
                MOVE WS01-POS-ENDR-AUX       TO WS01-PCL-POSICAO-Y
                COMPUTE WQ01-IND-LEN-MAX-AUX = WQ01-IND-LEN-MAX-AUX -
                                               WQ01-IND-INSTR-AUX + 1
                MOVE CC0008-COMPLEMENTO(WQ01-IND-INSTR-AUX:
                                        WQ01-IND-LEN-MAX-AUX)
                                             TO WS01-PCL-DADOS
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL
           
                ADD 71                       TO WS01-POS-ENDR-AUX.

       745-30-CORPO-CONTINUA.

           MOVE '1253'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-POS-ENDR-AUX            TO WS01-PCL-POSICAO-Y.
           MOVE CC0008-BAIRRO-CEP-ED         TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           ADD 71                            TO WS01-POS-ENDR-AUX.

           MOVE '1253'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-POS-ENDR-AUX            TO WS01-PCL-POSICAO-Y.
           MOVE CC0008-MUN-NOME-UF-E         TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U(s16901t0b0s10.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3734'                       TO WS01-PCL-POSICAO-X.
           MOVE '0407'                       TO WS01-PCL-POSICAO-Y.
           IF CC0001-IND-ENTRADA-SAIDA  EQUAL  'S'
                MOVE '1'                     TO WS01-PCL-DADOS
           ELSE   
                MOVE '0'                     TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE CC0001-NUMERO-DEA            TO WS01-NUMERO-DANFE-AUX.
           
           MOVE WS01-NUMERO-DANFE-A-P1       TO WS01-NUMERO-DANFE-P1.
           MOVE WS01-NUMERO-DANFE-A-P2       TO WS01-NUMERO-DANFE-P2.
           MOVE WS01-NUMERO-DANFE-A-P3       TO WS01-NUMERO-DANFE-P3.

           MOVE WS01-NUM-PAG-AUX             TO WS01-NUM-PAG.
           MOVE WS01-TTL-PAG-AUX             TO WS01-TTL-PAG.

           MOVE '(19U(s16901t3b0s10.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3521'                       TO WS01-PCL-POSICAO-X.
           MOVE '0560'                       TO WS01-PCL-POSICAO-Y.
           MOVE WS01-NUMERO-DANFE-NFE        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '(19U(s16901t0b0s10.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3687'                       TO WS01-PCL-POSICAO-X.
           MOVE '0648'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0001-SERIE-SUBSERIE        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3710'                       TO WS01-PCL-POSICAO-X.
           MOVE '0743'                       TO WS01-PCL-POSICAO-Y.
           MOVE WS01-NUM-TTL-PAG             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           PERFORM 920-00-MONTA-COD-BARRA.

           MOVE '(19U(s16901t3b0s10.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE CC0001-NFE-LOCALIZADOR       TO WS01-NFE-LOCALIZADOR.

           MOVE WS01-NFE-LOCALIZADOR-P01     TO WS01-NFE-LOCAL-FRTD-P01.
           MOVE WS01-NFE-LOCALIZADOR-P02     TO WS01-NFE-LOCAL-FRTD-P02.
           MOVE WS01-NFE-LOCALIZADOR-P03     TO WS01-NFE-LOCAL-FRTD-P03.
           MOVE WS01-NFE-LOCALIZADOR-P04     TO WS01-NFE-LOCAL-FRTD-P04.
           MOVE WS01-NFE-LOCALIZADOR-P05     TO WS01-NFE-LOCAL-FRTD-P05.
           MOVE WS01-NFE-LOCALIZADOR-P06     TO WS01-NFE-LOCAL-FRTD-P06.
           MOVE WS01-NFE-LOCALIZADOR-P07     TO WS01-NFE-LOCAL-FRTD-P07.
           MOVE WS01-NFE-LOCALIZADOR-P08     TO WS01-NFE-LOCAL-FRTD-P08.
           MOVE WS01-NFE-LOCALIZADOR-P09     TO WS01-NFE-LOCAL-FRTD-P09.
           MOVE WS01-NFE-LOCALIZADOR-P10     TO WS01-NFE-LOCAL-FRTD-P10.
           MOVE WS01-NFE-LOCALIZADOR-P11     TO WS01-NFE-LOCAL-FRTD-P11.
           MOVE WS01-NFE-LOCALIZADOR-P12     TO WS01-NFE-LOCAL-FRTD-P12.
           MOVE WS01-NFE-LOCALIZADOR-P13     TO WS01-NFE-LOCAL-FRTD-P13.
           MOVE WS01-NFE-LOCALIZADOR-P14     TO WS01-NFE-LOCAL-FRTD-P14.
           MOVE WS01-NFE-LOCALIZADOR-P15     TO WS01-NFE-LOCAL-FRTD-P15.
           MOVE WS01-NFE-LOCALIZADOR-P16     TO WS01-NFE-LOCAL-FRTD-P16.

           MOVE '4206'                       TO WS01-PCL-POSICAO-X.
           MOVE '0472'                       TO WS01-PCL-POSICAO-Y.
           MOVE WS01-NFE-LOCALIZADOR-FRTD    TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U(s16901t0b0s10.00v1P' TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4570'                       TO WS01-PCL-POSICAO-X.
           MOVE '0646'                       TO WS01-PCL-POSICAO-Y.
           MOVE WS01-TXT-CAMPO-AUTOR-01      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4378'                       TO WS01-PCL-POSICAO-X.
           MOVE '0746'                       TO WS01-PCL-POSICAO-Y.
           MOVE WS01-TXT-CAMPO-AUTOR-02      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U(s4099t0b0s12.00h10.00v0P'
                                             TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0048'                       TO WS01-PCL-POSICAO-X.
           MOVE '0822'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0003-DESCRICAO-RESUMIDA    TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0048'                       TO WS01-PCL-POSICAO-X.
           MOVE '0988'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0008-INSCR-ESTADUAL        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           IF CC0001-VL-TOTAL-STF-LOG  GREATER  ZEROS  AND
              (CC0004-UF-CODIGO  EQUAL  'AC' OR 'AL' OR 'AM' OR 'AP' OR
                                        'BA' OR 'CE' OR 'DF' OR 'ES' OR
                                        'GO' OR 'MA' OR 'MG' OR 'MS' OR
                                        'MT' OR 'PA' OR 'PB' OR 'PE' OR
                                        'PI' OR 'PR' OR 'RJ' OR 'RN' OR
                                        'RO' OR 'RR' OR 'RS' OR 'SC' OR
                                        'SE' OR 'SP' OR 'TO')
                MOVE CC0001-SUBSTITUIDO-PFJ-CODIGO
                                             TO CC0007-PFJ-CODIGO
                MOVE CC0004-UF-CODIGO        TO CC0007-UF-CODIGO

                EXEC SQL AT CCPR
                         SELECT NVL(LTRIM(INSCR_ESTADUAL),' ')
                         INTO   :CC0007-INSCR-ESTADUAL
                         FROM   B8CC.COR_REGISTRO_PESSOA_UF
                         WHERE  PFJ_CODIGO = :CC0007-PFJ-CODIGO
                         AND    UF_CODIGO  = :CC0007-UF-CODIGO
                         AND    DT_INICIO <= SYSDATE
                         AND    (DT_FIM   >= SYSDATE
                         OR      DT_FIM   IS NULL)
                     END-EXEC

                MOVE '1253'                  TO WS01-PCL-POSICAO-X
                MOVE '0988'                  TO WS01-PCL-POSICAO-Y
                MOVE CC0007-INSCR-ESTADUAL   TO WS01-PCL-DADOS
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2599'                       TO WS01-PCL-POSICAO-X.
           MOVE '0988'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0008-CPF-CGC               TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U(s16901t0b0s5v1P'
                                            TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
       
           MOVE '3790'                       TO WS01-PCL-RESET-X.
           MOVE '0888'                       TO WS01-PCL-RESET-Y.
           IF CC0001-NFE-COD-SITUACAO  EQUAL  'SYN077'
                MOVE
                'NUMERO DE REGISTRO DA EMISSAO PREVIA EM CONTINGENCIA'
                                             TO WS01-PCL-DADOS-RESET
           ELSE
                MOVE 'DADOS DA NF-e'         TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
       
           MOVE '(19U(s4099t0b0s12.00h10.00v0P'
                                             TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE SPACES                       TO
                                          WS01-NFE-PROTOCOLO-DT-ULT-ALT.
           MOVE CC0001-NFE-PROTOCOLO         TO WS01-NFE-PROTOCOLO.

           MOVE ZEROS                        TO WS32-IND-TTVA-EPEC.
       
       745-40-DEFINE-DATA-EPEC.
       
           ADD 1                             TO WS32-IND-TTVA-EPEC.
       
           IF CC0001-NFE-COD-SITUACAO  EQUAL  'SYN077'
                EXEC SQL AT CCPR
                         SELECT TO_CHAR(MIN(A.DH_EVENTO),
                                               'DD/MM/YYYY HH24:MI:SS'),
                                TO_CHAR(MIN(A.DH_PROTOCOLO),
                                               'DD/MM/YYYY HH24:MI:SS')
                         INTO   :CC0011-DH-EVENTO    :WI01-DH-EVENTO,
                                :CC0011-DH-PROTOCOLO :WI01-DH-PROTOCOLO
                         FROM   B8CC.C_VIEW_EPEC A,
                                B8CC.COR_DOF B
                         WHERE  A.CHAVE_ACESSO = B.NFE_LOCALIZADOR
                         AND    B.DOF_SEQUENCE = :CC0001-DOF-SEQUENCE
                     END-EXEC
       
                IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL  OR
                   WI01-DH-EVENTO  NOT GREATER  -1  OR
                   WI01-DH-PROTOCOLO  NOT GREATER  -1 OR
                   CC0011-DH-EVENTO  NOT GREATER  SPACES OR
                   CC0011-DH-PROTOCOLO  NOT GREATER  SPACES
                     IF WS32-IND-TTVA-EPEC  GREATER  4
                          MOVE '*** ERRO - B8CC.C_VIEW_EPEC ===>'
                                             TO WS35-MSG-ERRO-LIT
                          MOVE CC0001-DOF-SEQUENCE
                                             TO WS35-MSG-ERRO-VAR
                          MOVE WS35-MSG-ERRO TO ACB5010-MSG-ERRO
                          MOVE 'H1SF0033'    TO WS35-ID-PGM
                          PERFORM 900-00-REGISTRA-ERRO-TRNS
                     ELSE
                          MOVE 100           TO WS33-INTERV-DELAY
                          PERFORM 640-00-EMITE-DELAY
                          GO                 TO 745-40-DEFINE-DATA-EPEC
                     END-IF
                END-IF
                MOVE CC0011-DH-PROTOCOLO     TO WS01-CTRL-DT-PROTOCOLO
           ELSE
                MOVE CC0001-CTRL-DT-ULT-ALTERACAO
                                             TO WS01-CTRL-DT-PROTOCOLO.

           MOVE '3804'                       TO WS01-PCL-POSICAO-X.
           MOVE '0988'                       TO WS01-PCL-POSICAO-Y.
           MOVE WS01-NFE-PROTOCOLO-DT-ULT-ALT
                                             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           IF WS01-IC-PAG-ADIC  EQUAL  'S'
                GO                           TO 745-99-PCL-EXIT.

      *    MOVE '(19U(s16602t0b0s6.00v1P'  TO WS01-LINHA-IMPR-AUX.
      *    PERFORM 545-00-GRAVA-DETALHE-REL.
      *
      *    EXEC SQL SELECT 'RECEBEMOS DE ' ||
      *                    TRIM(:CC0008-RAZAO-SOCIAL-E) ||
      *                    ' OS PRODUTOS CONSTANTES DA NOTA'
      *             INTO   :WQ01-INF-CNHT-DFE 
      *             FROM   DUAL
      *             WHERE  ROWNUM = 1
      *         END-EXEC.
      *
      *    MOVE '0223'                       TO WS01-PCL-VERTICAL-X.
      *    MOVE '0091'                       TO WS01-PCL-VERTICAL-Y.
      *    MOVE WQ01-INF-CNHT-DFE            TO WS01-PCL-DADOS-VERTICAL.
      *    MOVE WS01-PCL-VERTICAL            TO WS01-LINHA-IMPR-AUX.
      *    PERFORM 545-00-GRAVA-DETALHE-REL.
      *    
      *    MOVE '(19U(s16602t3b0s8.00v1P'  TO WS01-LINHA-IMPR-AUX.
      *    PERFORM 545-00-GRAVA-DETALHE-REL.
      *
      *    MOVE '0111'                       TO WS01-PCL-VERTICAL-X.
      *    MOVE '4107'                       TO WS01-PCL-VERTICAL-Y.
      *    MOVE WS01-NUM-DFE-FOLHA-P1        TO WS01-PCL-DADOS-VERTICAL.
      *    MOVE WS01-PCL-VERTICAL            TO WS01-LINHA-IMPR-AUX.
      *    PERFORM 545-00-GRAVA-DETALHE-REL.
      *    
      *    MOVE '(19U(s16602t3b0s6.00v1P'  TO WS01-LINHA-IMPR-AUX.
      *    PERFORM 545-00-GRAVA-DETALHE-REL.
      *
      *    MOVE '0034'                       TO WS01-PCL-VERTICAL-X.
      *    MOVE '4366'                       TO WS01-PCL-VERTICAL-Y.
      *    MOVE CC0001-SERIE-SUBSERIE        TO WS01-PCL-DADOS-VERTICAL.
      *    MOVE WS01-PCL-VERTICAL            TO WS01-LINHA-IMPR-AUX.
      *    PERFORM 545-00-GRAVA-DETALHE-REL.
      *
      *    MOVE '(19U(s4099t0b0s20.00h6.00v0P'
      *                                      TO WS01-LINHA-IMPR-AUX.
      *    PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0048'                       TO WS01-PCL-POSICAO-X.
           MOVE '1224'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-RAZAO-SOCIAL          TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4489'                       TO WS01-PCL-POSICAO-X.
           MOVE '1224'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-CPF-CGC               TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '6048'                       TO WS01-PCL-POSICAO-X.
           MOVE '1224'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0001-DH-EMISSAO            TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
 
           MOVE '0048'                       TO WS01-PCL-POSICAO-X.
           MOVE '1389'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-ENDERECO              TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3804'                       TO WS01-PCL-POSICAO-X.
           MOVE '1389'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-BAIRRO                TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5080'                       TO WS01-PCL-POSICAO-X.
           MOVE '1389'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-CEP                   TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       745-40-EVITA-DATA-SAIDA.

           MOVE '6048'                       TO WS01-PCL-POSICAO-X.
           MOVE '1389'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0001-DT-SAIDA-MERCADORIAS  TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           IF CC0001-DT-SAIDA-MERCADORIAS  GREATER  SPACES
                PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0048'                       TO WS01-PCL-POSICAO-X.
           MOVE '1555'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-MUN-NOME              TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2670'                       TO WS01-PCL-POSICAO-X.
           MOVE '1555'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-TELEFONE1             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           IF CC0004-TELEFONE1  GREATER  SPACES
                PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE CC0004-UF-CODIGO             TO WS01-UF-DEST.

           IF CC0004-PAIS  GREATER  SPACES
                MOVE ' / '                   TO WS01-SEP-UF-PAIS-DEST
                MOVE CC0004-PAIS             TO WS01-PAIS-DEST
           ELSE
                MOVE SPACES                  TO WS01-SEP-UF-PAIS-DEST
                                                WS01-PAIS-DEST.

           MOVE '3804'                       TO WS01-PCL-POSICAO-X.
           MOVE '1555'                       TO WS01-PCL-POSICAO-Y.
           MOVE WS01-UF-PAIS-DEST            TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5080'                       TO WS01-PCL-POSICAO-X.
           MOVE '1555'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-INSCR-ESTADUAL        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       745-45-TOTAIS-DA-DANFE.

           MOVE '0426'                       TO WS01-PCL-POSICAO-X.
           MOVE '2027'                       TO WS01-PCL-POSICAO-Y.
           MOVE WM01-VL-TOTAL-BASE-ICMS      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '1773'                       TO WS01-PCL-POSICAO-X.
           MOVE '2027'                       TO WS01-PCL-POSICAO-Y.
           MOVE WM01-VL-TOTAL-ICMS           TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3119'                       TO WS01-PCL-POSICAO-X.
           MOVE '2027'                       TO WS01-PCL-POSICAO-Y.
           MOVE WM01-VL-TOTAL-BASE-STF       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4466'                       TO WS01-PCL-POSICAO-X.
           MOVE '2027'                       TO WS01-PCL-POSICAO-Y.
           MOVE WM01-VL-TOTAL-STF            TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5812'                       TO WS01-PCL-POSICAO-X.
           MOVE '2027'                       TO WS01-PCL-POSICAO-Y.
           MOVE WM01-PRECO-TOTAL-M           TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0070'                       TO WS01-PCL-POSICAO-X.
           MOVE '2193'                       TO WS01-PCL-POSICAO-Y.
           MOVE WM01-VL-FRETE                TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '1062'                       TO WS01-PCL-POSICAO-X.
           MOVE '2193'                       TO WS01-PCL-POSICAO-Y.
           MOVE WM01-VL-SEGURO               TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2104'                       TO WS01-PCL-POSICAO-X.
           MOVE '2193'                       TO WS01-PCL-POSICAO-Y.
           MOVE WM01-VL-AJUSTE-PRECO-TOTAL-M TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3119'                       TO WS01-PCL-POSICAO-X.
           MOVE '2193'                       TO WS01-PCL-POSICAO-Y.
           MOVE WM01-VL-OUTRAS-DESPESAS      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4466'                       TO WS01-PCL-POSICAO-X.
           MOVE '2193'                       TO WS01-PCL-POSICAO-Y.
           MOVE WM01-VL-TOTAL-IPI            TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U(s4099t3b0s12.00h10.00v0P'
                                             TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5812'                       TO WS01-PCL-POSICAO-X.
           MOVE '2193'                       TO WS01-PCL-POSICAO-Y.
           MOVE WM01-VL-TOTAL-CONTABIL       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       745-50-DADOS-DE-TRANSPORTE.

           MOVE '(19U(s4099t0b0s12.00h10.00v0P'
                                             TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0048'                       TO WS01-PCL-POSICAO-X.
           MOVE '2423'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0005-RAZAO-SOCIAL          TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3804'                       TO WS01-PCL-POSICAO-X.
           MOVE '2405'                       TO WS01-PCL-POSICAO-Y.

      *    IF CC0001-IND-RESP-FRETE  EQUAL  '1'
      *         MOVE '0'                     TO WS01-PCL-DADOS
      *    ELSE
      *         MOVE '1'                     TO WS01-PCL-DADOS.

           IF CC0001-IND-RESP-FRETE      EQUAL  '0'
                MOVE '2'                     TO WS01-PCL-DADOS
           ELSE
             IF CC0001-IND-RESP-FRETE    EQUAL '1' OR '2'
                MOVE '1'                     TO WS01-PCL-DADOS
             ELSE
               IF CC0001-IND-RESP-FRETE  EQUAL  '3'
                  MOVE '0'                   TO WS01-PCL-DADOS
               ELSE
                  MOVE '9'                   TO WS01-PCL-DADOS.
                  
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

      *    MOVE '3970'                       TO WS01-PCL-POSICAO-X.
      *    MOVE '2423'                       TO WS01-PCL-POSICAO-Y.
      *    MOVE 'CODIGO ANTT'                TO WS01-PCL-DADOS.
      *    MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
      *    PERFORM 545-00-GRAVA-DETALHE-REL.

           EXEC SQL SELECT SUBSTR(:CC0001-NUM-PLACA-VEICULO,1,3)||'-'||
                           SUBSTR(:CC0001-NUM-PLACA-VEICULO,4,4)
                    INTO   :WQ01-NUM-PLACA-VEICULO 
                    FROM   DUAL
                    WHERE  ROWNUM = 1
                END-EXEC.
                   
           MOVE '4607'                       TO WS01-PCL-POSICAO-X.
           MOVE '2423'                       TO WS01-PCL-POSICAO-Y.
           MOVE WQ01-NUM-PLACA-VEICULO       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '5198'                       TO WS01-PCL-POSICAO-X.
           MOVE '2423'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0001-PLACA-VEICULO-UF-CODIGO
                                             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5599'                       TO WS01-PCL-POSICAO-X.
           MOVE '2423'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0005-CPF-CGC               TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0048'                       TO WS01-PCL-POSICAO-X.
           MOVE '2594'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0005-ENDERECO              TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3379'                       TO WS01-PCL-POSICAO-X.
           MOVE '2594'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0005-MUN-NOME              TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5198'                       TO WS01-PCL-POSICAO-X.
           MOVE '2594'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0005-UF-CODIGO             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5599'                       TO WS01-PCL-POSICAO-X.
           MOVE '2594'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0005-INSCR-ESTADUAL        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           IF WS36-CD-MERC-DST  EQUAL  'E'
                IF CC0001-NUMERO-DEA  EQUAL  WQ01-MAIOR-DANFE
                     EXEC SQL SELECT TO_CHAR(SUM(ITD_Q_PECA_FTRD
                                              *ITD_PESO_LQD_PECA/1000),
                                                   '9,999,999,990.000')
                              INTO   :WM01-PESO-LIQUIDO-KG-AUX
                              FROM   H1SF.ITD_ITMFATURADO
                              WHERE  ITD_CD_MERC_DST  =
                                                :SF0001-PTD-CD-MERC-DST
                              AND    ITD_DTC_SEL_FTRM =
                                                :SF0001-PTD-DTC-SEL-FTRM
                              AND    ITD_LGON_FUNC    =
                                                :SF0001-PTD-LGON-FUNC
                              AND    ITD_ID_PTC_DSP   =
                                                :SF0001-PTD-ID-PTC-DSP
                          END-EXEC

                     EXEC SQL SELECT TO_CHAR((SUM(B.PESO_BRT_VOL)/1000),
                                                   '9,999,999,990.000')
                              INTO   :WM01-PESO-BRUTO-KG-AUX
                              FROM   H1ST.VOLUME_RECOLHIMENTO B
                              WHERE  EXISTS
                                       (SELECT 1
                                        FROM   H1SF.SFT_SELECAO_FTRM A
                                        WHERE  A.SFT_CD_MERC_DST  = 
                                                :SF0001-PTD-CD-MERC-DST
                                        AND    A.SFT_DTC_SEL_FTRM = 
                                                :SF0001-PTD-DTC-SEL-FTRM
                                        AND    A.SFT_LGON_FUNC    = 
                                                :SF0001-PTD-LGON-FUNC
                                        AND    B.ID_VOL = A.SFT_ID_VOL)
                          END-EXEC
                ELSE
                     MOVE SPACES             TO WM01-PESO-LIQUIDO-KG-AUX
                     MOVE SPACES             TO WM01-PESO-BRUTO-KG-AUX
                END-IF
           ELSE
                MOVE SPACES                  TO WM01-PESO-LIQUIDO-KG-AUX
                MOVE WM01-PESO-BRUTO-KG      TO WM01-PESO-BRUTO-KG-AUX.

           MOVE '0688'                       TO WS01-PCL-POSICAO-X.
           MOVE '2759'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0010-QTD-VOLUMES           TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '1158'                       TO WS01-PCL-POSICAO-X.
           MOVE '2759'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0010-ESPECIE-VOLUMES       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
       
           MOVE '2269'                       TO WS01-PCL-POSICAO-X.
           MOVE '2759'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0010-MARCA-VOLUMES         TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

      *    MOVE '3379'                       TO WS01-PCL-POSICAO-X.
      *    MOVE '2759'                       TO WS01-PCL-POSICAO-Y.
      *    MOVE 'NUMERO'                     TO WS01-PCL-DADOS.
      *    MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
      *    PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4626'                       TO WS01-PCL-POSICAO-X.
           MOVE '2759'                       TO WS01-PCL-POSICAO-Y.
      *    MOVE WM01-PESO-BRUTO-KG-AUX       TO WS01-PCL-DADOS.
           MOVE WM01-PESO-BRUTO-KG           TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '5811'                       TO WS01-PCL-POSICAO-X.
           MOVE '2759'                       TO WS01-PCL-POSICAO-Y.
      *    MOVE WM01-PESO-LIQUIDO-KG-AUX     TO WS01-PCL-DADOS.
           MOVE WM01-PESO-LIQUIDO-KG         TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

      *    MOVE '0048'                       TO WS01-PCL-POSICAO-X.
      *    MOVE '4000'                       TO WS01-PCL-POSICAO-Y.
      *    MOVE 'INSCRICAO MUNICIPAL'        TO WS01-PCL-DADOS.
      *    MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
      *    PERFORM 545-00-GRAVA-DETALHE-REL.
      *
      *    MOVE '1158'                       TO WS01-PCL-POSICAO-X.
      *    MOVE '4000'                       TO WS01-PCL-POSICAO-Y.
      *    MOVE 'VALOR TOTAL SERVICOS'       TO WS01-PCL-DADOS.
      *    MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
      *    PERFORM 545-00-GRAVA-DETALHE-REL.
      *
      *    MOVE '2292'                       TO WS01-PCL-POSICAO-X.
      *    MOVE '4000'                       TO WS01-PCL-POSICAO-Y.
      *    MOVE 'BASE CALC ISSQN'            TO WS01-PCL-DADOS.
      *    MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
      *    PERFORM 545-00-GRAVA-DETALHE-REL.
      *
      *    MOVE '3426'                       TO WS01-PCL-POSICAO-X.
      *    MOVE '4000'                       TO WS01-PCL-POSICAO-Y.
      *    MOVE 'VALOR ISSQN'                TO WS01-PCL-DADOS.
      *    MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
      *    PERFORM 545-00-GRAVA-DETALHE-REL.

       745-55-MENSAGENS-LEGAIS.

           MOVE '(19U(s4099t0b0s20.00h6.00v0P'
                                             TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           PERFORM 950-00-MENSAGENS-LEGAIS.

       745-99-PCL-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 06/15 *
      *                                                                *
      *  CALCULA LINHAS DE DESCRICAO COMPLETA.                         *  
      *----------------------------------------------------------------*
      
       746-00-CALCULA-LINHAS-DANFE           SECTION.
      *----------------------------------------------*

           MOVE ZEROS                        TO WS01-TOT-LNH-DESC-CPLT.

           EXEC SQL AT CCPR
                    SELECT SUM(LEAST(CEIL(LENGTH(
                                     A.IDF_TEXTO_COMPLEMENTAR)/66),10)),
                           SUM(LEAST(CEIL(LENGTH(TRIM(SUBSTR(
                                A.IDF_TEXTO_COMPLEMENTAR,1,63)) ||
                                  SUBSTR(A.IDF_TEXTO_COMPLEMENTAR,64) ||
                                           TRIM(DECODE(
                                           C.FAT_CONV_UNI_BAS_MERC,1,'',
                                           ' | V. Un. Trib. = ' ||
                                           REPLACE(ROUND(
                                           A.PRECO_UNITARIO/
                                           C.FAT_CONV_UNI_BAS_MERC,10),
                                                    '.',','))))/66),10))
                    INTO   :WQ01-TOT-LNH-DESC-CPLT-D,
                           :WQ01-TOT-LNH-DESC-CPLT-E
                    FROM   B8CC.COR_IDF A,
                           B8CC.COR_MERCADORIA B,
                           B8CC.COR_UNIDADE_MERCADORIA C
                    WHERE  A.MERC_CODIGO = B.MERC_CODIGO
                    AND    B.MERC_CODIGO = C.MERC_CODIGO(+)
                    AND    B.DFLT_UNI_CODIGO_SAIDA = C.UNI_CODIGO(+)
                    AND    A.IDF_TEXTO_COMPLEMENTAR IS NOT NULL
                    AND    LENGTH(A.IDF_TEXTO_COMPLEMENTAR) > 0
                    AND    A.DOF_SEQUENCE = :CC0001-DOF-SEQUENCE
                END-EXEC.
                
           INSPECT WQ01-TOT-LNH-DESC-CPLT-D  CONVERTING SPACES TO ZEROS.
           INSPECT WQ01-TOT-LNH-DESC-CPLT-E  CONVERTING SPACES TO ZEROS.

           IF WS36-CD-MERC-DST  EQUAL  'D'
      *          MOVE WQ01-TOT-LNH-DESC-CPLT-D
      *                                      TO WS01-TOT-LNH-DESC-CPLT
                 MOVE ZEROS                  TO WS01-TOT-LNH-DESC-CPLT
           ELSE
                 MOVE WQ01-TOT-LNH-DESC-CPLT-E
                                             TO WS01-TOT-LNH-DESC-CPLT.

       746-99-LINHAS-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 04/15 *
      *                                                                *
      *  CONTROLA QUEBRA DE PAGINA.                                    *  
      *----------------------------------------------------------------*
      
       747-00-TRATA-QUEBRA-PAGINA            SECTION.
      *----------------------------------------------*

           MOVE '747-00-TRATA-QUEBRA-PAGINA' TO WS35-AUX-TS.  

           ADD 1                             TO WS01-SEQ-LIN-PAG
                                                WS01-SEQ-LIN-DFE.
      
           IF (WS01-SEQ-LIN-PAG  EQUAL  17  AND
               WS01-IC-PAG-ADIC  EQUAL  'N')  OR
              WS01-SEQ-LIN-PAG  EQUAL  50
                MOVE ZEROS                   TO WS01-SEQ-LIN-PAG
                MOVE 'S'                     TO WS01-IC-PAG-ADIC
                PERFORM 745-00-PCL-DANFE.

           IF WS01-IC-PAG-ADIC  EQUAL  'S'
                COMPUTE WS01-CALC-POS-AUX = 1230 +
                              ((WS01-SEQ-LIN-DFE -
                                (((WS01-NUM-PAG-AUX - 2) * 50) + 17)) *
                                                                    52)
           ELSE
                COMPUTE WS01-CALC-POS-AUX = 2990 +
                                          ((WS01-SEQ-LIN-DFE - 1) * 52).

           MOVE WS01-CALC-POS-AUX            TO WS01-PCL-POSICAO-Y.

       747-99-PCL-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 03/09 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       750-00-PREPARA-DETALHE-DANFE          SECTION.
      *----------------------------------------------*

           MOVE '750-00-PREPARA-DETALHE-DANFE' TO WS35-AUX-TS.    
                
           MOVE 'BPIS'                       TO CB0002-DRE-CD-STM.      
           MOVE CB0001-RRE-DTC-GRC           TO CB0002-DRE-DTC-GRC.      
           MOVE WQ01-DOF-IMPOR-NUMERO        TO CB0002-DRE-ID-PRCP.      
           MOVE SF0001-PTD-ID-PTC-DSP        TO CB0002-DRE-CD-SQN-DCT.      
                
           MOVE SPACES                       TO
                                             CB0002-DRE-ID-PRCP-PTD-LIT.

           PERFORM 170-00-DEFINE-VIAS-ORDENACAO.

           IF WS01-ID-VIA  EQUAL  2
                IF WS36-CD-MERC-DST  EQUAL  'D'  AND
                   WS36-FASE-FTRM  EQUAL  '2'
                     MOVE '97'               TO WS01-CD-SQN-PJL-NF
                ELSE
                     MOVE '99'               TO WS01-CD-SQN-PJL-NF
                END-IF
           ELSE
           IF WS01-ID-VIA  EQUAL  3
                MOVE '99'                    TO WS01-CD-SQN-PJL-NF
           END-IF.

           MOVE WS01-CD-SQN-PJL-NF           TO CB0002-DRE-CD-SQN-PJL.

       750-99-PREPARA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 10/00 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       755-00-PREPARA-DETALHE-PTD            SECTION.
      *----------------------------------------------*

           MOVE '755-00-PREPARA-DETALHE-PTD' TO WS35-AUX-TS. 
                
           MOVE 'BPIS'                       TO CB0002-DRE-CD-STM.      
           MOVE CB0001-RRE-DTC-GRC           TO CB0002-DRE-DTC-GRC.      
      *    MOVE WQ01-DOF-IMPOR-NUMERO        TO CB0002-DRE-ID-PRCP.
           MOVE WQ01-DOF-IMPOR-PROTOCOLO     TO CB0002-DRE-ID-PRCP.
           MOVE SF0001-PTD-ID-PTC-DSP        TO CB0002-DRE-CD-SQN-DCT.      
                
           MOVE 'PROTOCOL'                   TO 
                                             CB0002-DRE-ID-PRCP-PTD-LIT.      

           IF WS01-NUM-VIAS-PTD  EQUAL  1
                MOVE WS01-CD-SQN-PJL-PTD     TO CB0002-DRE-CD-SQN-PJL
           ELSE
           IF WS01-NUM-VIAS-PTD  EQUAL  3  AND
              WS36-CD-MERC-DST  EQUAL  'D'  AND
              WS36-FASE-FTRM  EQUAL  '2'
                MOVE '96'                    TO CB0002-DRE-CD-SQN-PJL
           ELSE
                ADD 1                        TO WS01-CD-SQN-PJL-PTD-N
                MOVE WS01-CD-SQN-PJL-PTD     TO CB0002-DRE-CD-SQN-PJL
                SUBTRACT 1                   FROM WS01-CD-SQN-PJL-PTD-N
           END-IF.

       755-99-PREPARA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 10/00 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       756-00-PREPARA-DETALHE-INST           SECTION.
      *----------------------------------------------*

           MOVE '756-00-PREPARA-DETALHE-INST' TO WS35-AUX-TS. 

           MOVE 'BPIS'                       TO CB0002-DRE-CD-STM.      
           MOVE CB0001-RRE-DTC-GRC           TO CB0002-DRE-DTC-GRC.      
           MOVE WQ01-DOF-IMPOR-NUMERO        TO CB0002-DRE-ID-PRCP.      
           MOVE SF0001-PTD-ID-PTC-DSP        TO CB0002-DRE-CD-SQN-DCT.      
                
           MOVE 'INSTRUCA'                   TO 
                                             CB0002-DRE-ID-PRCP-PTD-LIT.      

           PERFORM 170-00-DEFINE-VIAS-ORDENACAO.

           MOVE WS01-CD-SQN-PJL-INST         TO CB0002-DRE-CD-SQN-PJL.

       756-99-PREPARA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 06/06 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       757-00-PREPARA-DETALHE-PCK-LST        SECTION.
      *----------------------------------------------*

           MOVE '757-00-PREPARA-DETALHE-PCK-LST'
                                             TO WS35-AUX-TS.   
                
           MOVE 'BPIS'                       TO CB0002-DRE-CD-STM.      
           MOVE CB0001-RRE-DTC-GRC           TO CB0002-DRE-DTC-GRC.      
           MOVE WQ01-DOF-IMPOR-NUMERO        TO CB0002-DRE-ID-PRCP.      
           MOVE SF0001-PTD-ID-PTC-DSP        TO CB0002-DRE-CD-SQN-DCT.      
                
           MOVE 'PACKLIST'                   TO 
                                             CB0002-DRE-ID-PRCP-PTD-LIT.      

           IF WS01-NUM-VIAS-VOL  EQUAL  1
                MOVE 1                       TO WS01-IND-PJL-PKLST-AUX
           ELSE
           IF WS01-NUM-VIAS-VOL  EQUAL  2
                IF WS36-CD-MERC-DST  EQUAL  'E'  AND
                   (SF0002-ITD-CD-MOD-TRSP  EQUAL  '1'  OR
                    SF0002-ITD-CD-MOD-TRSP  EQUAL  '2'  OR
                    SF0002-ITD-CD-MOD-TRSP  EQUAL  '3')
                     MOVE 21                 TO WS01-IND-PJL-PKLST-AUX
                ELSE
                     MOVE 3                  TO WS01-IND-PJL-PKLST-AUX
                END-IF
           ELSE
           IF WS01-NUM-VIAS-VOL  EQUAL  3
                MOVE 5                       TO WS01-IND-PJL-PKLST-AUX
           ELSE
                MOVE 7                       TO WS01-IND-PJL-PKLST-AUX.

           ADD WS01-IND-PJL-PKLST-AUX        TO WS01-CD-SQN-PJL-PKLST-N.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.
           SUBTRACT WS01-IND-PJL-PKLST-AUX   FROM
                                                WS01-CD-SQN-PJL-PKLST-N.
      
       757-99-PREPARA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 10/00 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       760-00-PREPARA-RESUMO-DANFE           SECTION.
      *----------------------------------------------*

           MOVE '760-00-PREPARA-RESUMO-DANFE' TO WS35-AUX-TS.   

           MOVE 'BPIS'                      TO CB0001-RRE-CD-STM.      
           MOVE WQ01-DOF-IMPOR-NUMERO       TO CB0001-RRE-ID-PRCP.      
           MOVE SF0001-PTD-ID-PTC-DSP       TO CB0001-RRE-CD-SQN-DCT.      
                
           MOVE SF0001-PTD-CD-T-REC         TO CB0001-RRE-ID-AUX-IMPS-1.      
           MOVE SF0001-PTD-ID-MTZ           TO CB0001-RRE-ID-AUX-IMPS-2.      
           MOVE SF0001-PTD-ID-CLI           TO CB0001-RRE-ID-AUX-IMPS-3.      
           MOVE SF0001-PTD-ID-PTC-DSP       TO CB0001-RRE-ID-AUX-IMPS-4.      

           MOVE CC0001-NUMERO               TO CB0001-RRE-ID-AUX-IMPS-5.      
           MOVE ZEROS                       TO WI01-RRE-ID-AUX-IMPS-5.      

           MOVE 'DANFE DE PECAS'            TO CB0001-RRE-ID-REL.

           MOVE WS01-IMPRESSORA-LASER       TO CB0001-RRE-ID-IMPR.      

       760-99-PREPARA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 10/00 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       765-00-PREPARA-RESUMO-PTD             SECTION.
      *----------------------------------------------*

           MOVE '765-00-PREPARA-RESUMO-PTD'  TO WS35-AUX-TS.    

           MOVE 'BPIS'                       TO CB0001-RRE-CD-STM.      
      *    MOVE WQ01-DOF-IMPOR-NUMERO        TO CB0001-RRE-ID-PRCP.
           MOVE WQ01-DOF-IMPOR-PROTOCOLO     TO CB0001-RRE-ID-PRCP.
                
           MOVE 'PROTOCOL'                   TO 
                                             CB0001-RRE-ID-PRCP-PTD-LIT.      

           MOVE SF0001-PTD-CD-T-REC         TO CB0001-RRE-ID-AUX-IMPS-1.      
           MOVE SF0001-PTD-ID-MTZ           TO CB0001-RRE-ID-AUX-IMPS-2.      
           MOVE SF0001-PTD-ID-CLI           TO CB0001-RRE-ID-AUX-IMPS-3.      
           MOVE SF0001-PTD-ID-PTC-DSP       TO CB0001-RRE-ID-AUX-IMPS-4.      

           MOVE SPACES                      TO CB0001-RRE-ID-AUX-IMPS-5.      
           MOVE -1                          TO WI01-RRE-ID-AUX-IMPS-5.      

           MOVE 'PROTOCOLO DE DESPACHO DE PECAS'
                                            TO CB0001-RRE-ID-REL.      

           MOVE WS01-IMPRESSORA-LASER       TO CB0001-RRE-ID-IMPR.      

       765-99-PREPARA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 10/00 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       766-00-PREPARA-RESUMO-INST            SECTION.
      *----------------------------------------------*

           MOVE '766-00-PREPARA-RESUMO-INST' TO WS35-AUX-TS.   

           MOVE 'BPIS'                       TO CB0001-RRE-CD-STM.      
           MOVE WQ01-DOF-IMPOR-NUMERO        TO CB0001-RRE-ID-PRCP.      
                
           MOVE 'INSTRUCA'                   TO 
                                             CB0001-RRE-ID-PRCP-PTD-LIT.      

           MOVE SF0001-PTD-CD-T-REC         TO CB0001-RRE-ID-AUX-IMPS-1.      
           MOVE SF0001-PTD-ID-MTZ           TO CB0001-RRE-ID-AUX-IMPS-2.      
           MOVE SF0001-PTD-ID-CLI           TO CB0001-RRE-ID-AUX-IMPS-3.      
           MOVE SF0001-PTD-ID-PTC-DSP       TO CB0001-RRE-ID-AUX-IMPS-4.      

           MOVE SPACES                      TO CB0001-RRE-ID-AUX-IMPS-5.      
           MOVE -1                          TO WI01-RRE-ID-AUX-IMPS-5.      

           MOVE 'INSTRUCOES ESPECIAIS'      TO CB0001-RRE-ID-REL.      

           MOVE WS01-IMPRESSORA-LASER       TO CB0001-RRE-ID-IMPR.      

       766-99-PREPARA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 06/06 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       767-00-PREPARA-RESUMO-PCK-LST         SECTION.
      *----------------------------------------------*

           MOVE '767-00-PREPARA-RESUMO-PCK-LST'
                                             TO WS35-AUX-TS. 

           MOVE 'BPIS'                       TO CB0001-RRE-CD-STM.      
           MOVE WQ01-DOF-IMPOR-NUMERO        TO CB0001-RRE-ID-PRCP.      
                
           MOVE 'PACKLIST'                   TO 
                                             CB0001-RRE-ID-PRCP-PTD-LIT.      

           MOVE SF0001-PTD-CD-T-REC         TO CB0001-RRE-ID-AUX-IMPS-1.      
           MOVE SF0001-PTD-ID-MTZ           TO CB0001-RRE-ID-AUX-IMPS-2.      
           MOVE SF0001-PTD-ID-CLI           TO CB0001-RRE-ID-AUX-IMPS-3.      
           MOVE SF0001-PTD-ID-PTC-DSP       TO CB0001-RRE-ID-AUX-IMPS-4.      

           MOVE SPACES                      TO CB0001-RRE-ID-AUX-IMPS-5.      
           MOVE -1                          TO WI01-RRE-ID-AUX-IMPS-5.      

           MOVE 'PACKING LIST DE PECAS'
                                            TO CB0001-RRE-ID-REL.      

           MOVE WS01-IMPRESSORA-LASER       TO CB0001-RRE-ID-IMPR.

       767-99-PREPARA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 10/00 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       770-00-TROCA-PONTO-CORPO              SECTION.
      *----------------------------------------------*

           MOVE '770-00-TROCA-PONTO-CORPO'   TO WS35-AUX-TS.
                
           INSPECT WM01-PRECO-TOTAL-M        CONVERTING '.' TO '!'.
           INSPECT WM01-PRECO-TOTAL-M        CONVERTING ',' TO '.'.
           INSPECT WM01-PRECO-TOTAL-M        CONVERTING '!' TO ','.

           INSPECT WM01-VL-AJUSTE-PRECO-TOTAL-M CONVERTING '.' TO '!'.
           INSPECT WM01-VL-AJUSTE-PRECO-TOTAL-M CONVERTING ',' TO '.'.
           INSPECT WM01-VL-AJUSTE-PRECO-TOTAL-M CONVERTING '!' TO ','.

           INSPECT WM01-VL-FRETE             CONVERTING '.' TO '!'.
           INSPECT WM01-VL-FRETE             CONVERTING ',' TO '.'.
           INSPECT WM01-VL-FRETE             CONVERTING '!' TO ','.

           INSPECT WM01-VL-OUTRAS-DESPESAS   CONVERTING '.' TO '!'.
           INSPECT WM01-VL-OUTRAS-DESPESAS   CONVERTING ',' TO '.'.
           INSPECT WM01-VL-OUTRAS-DESPESAS   CONVERTING '!' TO ','.

           INSPECT WM01-VL-SEGURO            CONVERTING '.' TO '!'.
           INSPECT WM01-VL-SEGURO            CONVERTING ',' TO '.'.
           INSPECT WM01-VL-SEGURO            CONVERTING '!' TO ','.

           INSPECT WM01-VL-MANAUS-A          CONVERTING '.' TO '!'.
           INSPECT WM01-VL-MANAUS-A          CONVERTING ',' TO '.'.
           INSPECT WM01-VL-MANAUS-A          CONVERTING '!' TO ','.

           INSPECT WM01-VL-MANAUS-B          CONVERTING '.' TO '!'.
           INSPECT WM01-VL-MANAUS-B          CONVERTING ',' TO '.'.
           INSPECT WM01-VL-MANAUS-B          CONVERTING '!' TO ','.

           INSPECT WM01-VL-MANAUS-C          CONVERTING '.' TO '!'.
           INSPECT WM01-VL-MANAUS-C          CONVERTING ',' TO '.'.
           INSPECT WM01-VL-MANAUS-C          CONVERTING '!' TO ','.

           INSPECT WM01-VL-MANAUS-D          CONVERTING '.' TO '!'.
           INSPECT WM01-VL-MANAUS-D          CONVERTING ',' TO '.'.
           INSPECT WM01-VL-MANAUS-D          CONVERTING '!' TO ','.

           INSPECT WM01-VL-TOTAL-BASE-ICMS   CONVERTING '.' TO '!'.
           INSPECT WM01-VL-TOTAL-BASE-ICMS   CONVERTING ',' TO '.'.
           INSPECT WM01-VL-TOTAL-BASE-ICMS   CONVERTING '!' TO ','.

           INSPECT WM01-VL-TOTAL-BASE-STF    CONVERTING '.' TO '!'.
           INSPECT WM01-VL-TOTAL-BASE-STF    CONVERTING ',' TO '.'.
           INSPECT WM01-VL-TOTAL-BASE-STF    CONVERTING '!' TO ','.

           INSPECT WM01-VL-TOTAL-CONTABIL    CONVERTING '.' TO '!'.
           INSPECT WM01-VL-TOTAL-CONTABIL    CONVERTING ',' TO '.'.
           INSPECT WM01-VL-TOTAL-CONTABIL    CONVERTING '!' TO ','.

           INSPECT WM01-VL-TOTAL-ICMS        CONVERTING '.' TO '!'.
           INSPECT WM01-VL-TOTAL-ICMS        CONVERTING ',' TO '.'.
           INSPECT WM01-VL-TOTAL-ICMS        CONVERTING '!' TO ','.

           INSPECT WM01-VL-TOTAL-IPI         CONVERTING '.' TO '!'.
           INSPECT WM01-VL-TOTAL-IPI         CONVERTING ',' TO '.'.
           INSPECT WM01-VL-TOTAL-IPI         CONVERTING '!' TO ','.

           INSPECT WM01-VL-TOTAL-STF         CONVERTING '.' TO '!'.
           INSPECT WM01-VL-TOTAL-STF         CONVERTING ',' TO '.'.
           INSPECT WM01-VL-TOTAL-STF         CONVERTING '!' TO ','.

           INSPECT WM01-PESO-BRUTO-KG        CONVERTING '.' TO '!'.
           INSPECT WM01-PESO-BRUTO-KG        CONVERTING ',' TO '.'.
           INSPECT WM01-PESO-BRUTO-KG        CONVERTING '!' TO ','.

           INSPECT WM01-PESO-LIQUIDO-KG      CONVERTING '.' TO '!'.
           INSPECT WM01-PESO-LIQUIDO-KG      CONVERTING ',' TO '.'.
           INSPECT WM01-PESO-LIQUIDO-KG      CONVERTING '!' TO ','.

       770-99-TROCA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 10/00 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       780-00-TROCA-PONTO-DETALHE            SECTION.
      *----------------------------------------------*

           MOVE '780-00-TROCA-PONTO-DETALHE' TO WS35-AUX-TS.      
                
           INSPECT CC0002-PRECO-UNITARIO     CONVERTING '.' TO '!'.
           INSPECT CC0002-PRECO-UNITARIO     CONVERTING ',' TO '.'.
           INSPECT CC0002-PRECO-UNITARIO     CONVERTING '!' TO ','.

           INSPECT WM01-ALIQ-ICMS            CONVERTING '.' TO '!'.
           INSPECT WM01-ALIQ-ICMS            CONVERTING ',' TO '.'.
           INSPECT WM01-ALIQ-ICMS            CONVERTING '!' TO ','.

           INSPECT WM01-ALIQ-IPI             CONVERTING '.' TO '!'.
           INSPECT WM01-ALIQ-IPI             CONVERTING ',' TO '.'.
           INSPECT WM01-ALIQ-IPI             CONVERTING '!' TO ','.

           INSPECT WM01-PRECO-TOTAL          CONVERTING '.' TO '!'.
           INSPECT WM01-PRECO-TOTAL          CONVERTING ',' TO '.'.
           INSPECT WM01-PRECO-TOTAL          CONVERTING '!' TO ','.

           INSPECT WM01-VL-IPI               CONVERTING '.' TO '!'.
           INSPECT WM01-VL-IPI               CONVERTING ',' TO '.'.
           INSPECT WM01-VL-IPI               CONVERTING '!' TO ','.

           INSPECT WM01-VL-BASE-ICMS         CONVERTING '.' TO '!'.
           INSPECT WM01-VL-BASE-ICMS         CONVERTING ',' TO '.'.
           INSPECT WM01-VL-BASE-ICMS         CONVERTING '!' TO ','.
           
           INSPECT WM01-VL-ICMS              CONVERTING '.' TO '!'.
           INSPECT WM01-VL-ICMS              CONVERTING ',' TO '.'.
           INSPECT WM01-VL-ICMS              CONVERTING '!' TO ','.

           INSPECT WM01-VL-BASE-ICMS-STF     CONVERTING '.' TO '!'.
           INSPECT WM01-VL-BASE-ICMS-STF     CONVERTING ',' TO '.'.
           INSPECT WM01-VL-BASE-ICMS-STF     CONVERTING '!' TO ','.
           
           INSPECT WM01-VL-ICMS-STF          CONVERTING '.' TO '!'.
           INSPECT WM01-VL-ICMS-STF          CONVERTING ',' TO '.'.
           INSPECT WM01-VL-ICMS-STF          CONVERTING '!' TO ','.

       780-99-TROCA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 10/00 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       790-00-MONTA-LOG-NF-TOTAL             SECTION.
      *----------------------------------------------*

           MOVE '790-00-MONTA-LOG-NF-TOTAL'  TO WS35-AUX-TS.

           MOVE '01'                         TO ACB5022-CD-ACES.
           MOVE ZEROS                        TO ACB5022-CD-RETR-ECI
                                                ACB5022-CD-RETR-ACES.
           MOVE '03'                         TO ACB50221-CD-ACES-MQ.
           MOVE 00005                        TO ACB50221-ID-FILA-MQ.            
           MOVE ZEROS                        TO ACB50221-CD-RETR-MQ 
                                                ACB50221-CD-COMP
                                                ACB50221-CD-RSON.
           MOVE SPACES                       TO ACB50221-ID-MSG-PRC.

           MOVE SF0002-ITD-DTC-SEL-FTRM      TO WS35-ID-CORR-ID-LIT-SC.
           MOVE CC0001-NUMERO-CTB-5          TO WS35-ID-CORR-ID-ALF-SC.
           INSPECT WS35-ID-CORREL-ID         CONVERTING SPACES TO ZEROS.
           MOVE WS35-ID-CORREL-ID            TO ACB50221-ID-MSG-AUX.

           MOVE MQ01-ARE-CNT-FILA            TO ACB50221-ARE-CNT-FILA.

       790-10-MONTA-LOG.

           MOVE SPACES                       TO ST8001-ST80014.   

           MOVE '20'                         TO ST80014-CD-ACES.
           MOVE ST0001-CD-FBR                TO ST80014-CD-FBR.
           MOVE SF0001-PTD-CD-T-REC          TO ST80014-CD-T-REC.      
           MOVE SF0001-PTD-CD-T-MTZ          TO ST80014-CD-T-MTZ.

           EXEC SQL SELECT A.ITD_CD_T_REC,
                           A.ITD_CD_MOD_TRSP,
                           A.ITD_ID_ETIQ_REC,
                           TO_CHAR(A.ITD_DTC_NF,'DDMMYYYY'),
                           TO_CHAR(A.ITD_DTC_NF,'HH24MISS'),
                           A.ITD_CD_SUFR,
                           LTRIM(TO_CHAR(A.ITD_ID_NF,'000000000')),
                           A.ITD_CD_NF,
                           A.ITD_CD_T_PGT,
                           A.ITD_ID_NF,
                           TO_CHAR(A.ITD_DTC_NF,'YYYYMMDDHH24MISS'),
                           A.ITD_FTR_EXP,
                           TO_CHAR(A.ITD_NF_TIMESTAMP,
                                           'YYYY-MM-DD-HH24.MI.SS.FF6'),
                           A.ITD_RATE_US,
                           A.ITD_RATE_PGT,
                           B.TIP_Q_DIA_PGT,
                           C.CD_CLI_ESP
                    INTO   :SF0002-ITD-CD-T-REC,
                           :SF0002-ITD-CD-MOD-TRSP-LOG,
                           :SF0002-ITD-ID-ETIQ-REC-LOG,
                           :SF0002-ITD-DTC-NF-LOG,
                           :SF0002-ITD-HOR-NF-LOG,
                           :SF0002-ITD-CD-SUFR-LOG,
                           :SF0002-ITD-ID-NF-LOG  :WI01-ID-NF,
                           :SF0002-ITD-CD-NF-LOG,
                           :SF0002-ITD-CD-T-PGT-LOG,
                           :SF0007-CTB-ID-NF,
                           :SF0007-CTB-DTC-NF,
                           :SF0002-ITD-FTR-EXP-LOG,
                           :SF0002-ITD-NF-TIMESTAMP,
                           :SF0002-ITD-RATE-US,
                           :SF0002-ITD-RATE-PGT,
                           :SF0020-TIP-Q-DIA-PGT,
                           :ST0001-CD-CLI-ESP  :WI01-CD-CLI-ESP
                    FROM   H1SF.ITD_ITMFATURADO A,
                           H1SF.TIP_PAGAMENTO B,
                           H1ST.CONTROLE_VOLUME C
                   WHERE   A.ITD_CD_T_PGT = B.TIP_CD_T_PGT
                   AND     A.ITD_CD_T_MTZ = C.CD_T_MTZ
                   AND     A.ITD_ID_MTZ   = C.ID_MTZ
                   AND     A.ITD_ID_CLI   = C.ID_CLI
                   AND     A.ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                   AND     A.ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                   AND     A.ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                   AND     A.ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                   AND     A.ITD_ID_NF        = :CC0001-NUMERO
                   AND     ROWNUM = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - LOG. SYNC. - ITD-ITMFATURADO  NF: ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE CC0001-NUMERO           TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.

           EXEC SQL SELECT A.CD_CLS_PDD,
                           A.ID_CLI_RLCD
                    INTO   :ST0003-CD-CLS-PDD,
                           :ST0003-ID-CLI-RLCD  :WI01-ID-CLI-RLCD
                    FROM   H1ST.RECOLHIMENTO A,
                           H1ST.ITEM_RECOLHIMENTO B
                   WHERE  A.CD_T_REC    = B.CD_T_REC
                     AND  A.CD_T_MTZ    = B.CD_T_MTZ
                     AND  A.ID_MTZ      = B.ID_MTZ
                     AND  A.ID_CLI      = B.ID_CLI
                     AND  A.CD_SIT_ATND = B.CD_SIT_ATND
                     AND  A.ID_PDD      = B.ID_PDD
                     AND  A.ID_PSO      = B.ID_PSO
                     AND  B.ID_ETIQ_REC = :SF0002-ITD-ID-ETIQ-REC-LOG
                     AND  ROWNUM = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - LOG. SYNC. - RECOL.  ETIQ-REC: ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE SF0002-ITD-ID-ETIQ-REC-LOG  TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.  

           IF WI01-ID-CLI-RLCD  GREATER  -1
                EXEC SQL SELECT ID_MTZ
                         INTO   :ST0008-ID-MTZ
                         FROM   H1ST.CONTROLE_VOLUME
                         WHERE  ID_CLI = :ST0003-ID-CLI-RLCD
                         AND    ROWNUM = 1
                     END-EXEC
                MOVE ST0008-ID-MTZ           TO ST80014-ID-MTZ
                MOVE ST0003-ID-CLI-RLCD      TO ST80014-ID-CLI
           ELSE
                MOVE SF0001-PTD-ID-MTZ       TO ST80014-ID-MTZ
                MOVE SF0001-PTD-ID-CLI       TO ST80014-ID-CLI.

           IF WI01-ID-NF            EQUAL  -1          OR
              SF0002-ITD-ID-NF-LOG  EQUAL  LOW-VALUES  OR
              SF0002-ITD-ID-NF-LOG  EQUAL  SPACES      OR
              SF0002-ITD-ID-NF-LOG  EQUAL  ZEROS 
                MOVE '*** ERRO - NF COM PROBLEMAS (PFN) NF: ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE CC0001-NUMERO           TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.
                
           IF WI01-CD-CLI-ESP  EQUAL  -1
                MOVE SPACES                  TO ST0001-CD-CLI-ESP.

           MOVE ST0001-CD-CLI-ESP            TO ST80014-CD-CLI-ESP.

           IF SF0005-SFT-IC-FTRM-TRGD  EQUAL  'S'
                IF WS36-FASE-FTRM  EQUAL  '1'
                     MOVE 'T'                TO ST80014-CD-T-OPRC-FTRM
                ELSE
                     MOVE 'V'                TO ST80014-CD-T-OPRC-FTRM
                END-IF
           ELSE
                MOVE 'P'                     TO ST80014-CD-T-OPRC-FTRM.

           MOVE SF0002-ITD-CD-MOD-TRSP-LOG   TO ST80014-CD-MOD-TRSP.

           EXEC SQL SELECT SUM(ITD_V_FRT),
                           SUM(ITD_V_TX_SERV),
                           SUM(ITD_V_SUR_CHRG),
                           SUM(ITD_V_ADC_IPI),
                           SUM(ITD_V_CAS_RMAN_ODA),
                           SUM(ITD_V_CAS_RMAN_CMIS2)
                    INTO   :WQ01-TTL-V-FRT,
                           :WQ01-TTL-V-TX-SERV,
                           :WQ01-TTL-V-SUR-CHRG,
                           :WQ01-TTL-V-ADC-IPI,
                           :WQ01-TTL-V-CAS-RMAN-ODA,
                           :WQ01-TTL-V-CAS-RMAN-CMIS2
                    FROM   H1SF.ITD_ITMFATURADO
                   WHERE   ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                     AND   ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                     AND   ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                     AND   ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                     AND   ITD_ID_NF        = :CC0001-NUMERO
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - LOG. SYNC. - SUM ITMFATURADO  NF: ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE CC0001-NUMERO           TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.

           INSPECT WQ01-TTL-V-FRT            CONVERTING SPACES TO ZEROS.
           INSPECT WQ01-TTL-V-TX-SERV        CONVERTING SPACES TO ZEROS.
           INSPECT WQ01-TTL-V-SUR-CHRG       CONVERTING SPACES TO ZEROS.
           INSPECT WQ01-TTL-V-ADC-IPI        CONVERTING SPACES TO ZEROS.
           INSPECT WQ01-TTL-V-CAS-RMAN-ODA   CONVERTING SPACES TO ZEROS.
           INSPECT WQ01-TTL-V-CAS-RMAN-CMIS2 CONVERTING SPACES TO ZEROS.

           IF WI01-PTD-CD-TRSR  GREATER  -1
                EXEC SQL AT CCPR
                         SELECT RAZAO_SOCIAL
                         INTO   :CC0005-RAZAO-SOCIAL-E
                                            :WI01-RAZAO-SOCIAL
                         FROM   B8CC.COR_PESSOA_VIGENTE
                         WHERE  PFJ_CODIGO = :SF0001-PTD-CD-TRSR
                     END-EXEC

                IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                     MOVE '*** ERRO - LOG. SYNC. - TRANSP.  CODIGO: ==>'
                                             TO WS35-MSG-ERRO-LIT
                     MOVE SF0001-PTD-CD-TRSR TO WS35-MSG-ERRO-VAR
                     MOVE WS35-MSG-ERRO      TO ACB5010-MSG-ERRO
                     MOVE 'H1SF0033'         TO WS35-ID-PGM
                     PERFORM 900-00-REGISTRA-ERRO-TRNS
                END-IF
           ELSE
                MOVE SPACES                  TO CC0005-RAZAO-SOCIAL-E
                MOVE -1                      TO WI01-RAZAO-SOCIAL.

           MOVE ST0003-CD-CLS-PDD            TO ST80014-CD-CLS-PDD.
           MOVE SF0001-PTD-CD-MERC-DST       TO ST80014-CD-MERC-DST.
           MOVE SF0002-ITD-CD-NF-LOG         TO ST80014-CD-NF.      
           MOVE CC0001-SERIE-SUBSERIE-3      TO ST80014-CD-SRIE-NF.
           MOVE SF0002-ITD-ID-NF-LOG         TO ST80014-ID-NF.      
           INSPECT ST80014-ID-NF             CONVERTING SPACES TO ZEROS.

           IF ST0001-CD-REGR-FTRM  EQUAL  'M'  AND
              ST0005-TXT-SUB-HDR-NF  GREATER  SPACES
                INSPECT ST0005-TXT-SUB-HDR-NF
                                             CONVERTING SPACES TO ZEROS
                MOVE ST0005-TXT-SUB-HDR-NF   TO WS01-ID-NF-CPLM-AUX
                MOVE ZEROS                   TO WS01-ID-NF-CPLM-AUX-P1
                MOVE WS01-ID-NF-CPLM-AUX     TO ST80014-ID-NF-CMPL
           ELSE
           IF ST0001-CD-REGR-FTRM  EQUAL  'K'  AND
              ST0005-ID-NF-ORIG-CMIS2  GREATER  SPACES
                INSPECT ST0005-ID-NF-ORIG-CMIS2
                                             CONVERTING SPACES TO ZEROS
                MOVE ST0005-ID-NF-ORIG-CMIS2 TO WS01-ID-NF-CPLM-AUX
                MOVE WS01-ID-NF-CPLM-AUX     TO ST80014-ID-NF-CMPL
           ELSE
                MOVE ZEROS                   TO ST80014-ID-NF-CMPL
           END-IF.
           
           MOVE SF0002-ITD-DTC-NF-LOG        TO ST80014-DTC-NF.      
           MOVE SF0002-ITD-HOR-NF-LOG        TO ST80014-HR-NF.
           MOVE SF0002-ITD-NF-TIMESTAMP      TO ST80014-ID-TIME-STMP.

           EXEC SQL SELECT 1
                    FROM   H1SF.LMN_LOJAMANAUS
                    WHERE  LMN_ID_CLI  = :WQ01-ID-CLI-AUX  AND
                           ROWNUM = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE SPACES                  TO ST80014-CD-RPAR-FISC
           ELSE      
                MOVE '010-010-34'            TO ST80014-CD-RPAR-FISC.      

           MOVE SF0002-ITD-CD-SUFR-LOG       TO ST80014-CD-SUFR.
           MOVE CC0004-UF-CODIGO             TO ST80014-CD-UF.      

           PERFORM 600-00-VERIFICA-DELTA.
           MOVE WS01-CD-T-DSCT-CAMP-AUX      TO ST80014-CD-T-DSCT-CAMP.

           EXEC SQL SELECT 1
                    FROM   H1SF.ITD_ITMFATURADO MA
                   WHERE   MA.ITD_ID_NF  = :CC0001-NUMERO
                     AND   EXISTS (SELECT 1 
                                       FROM H1ST.ITEM_RECOLHIMENTO MB
                                      WHERE MB.ID_ETIQ_REC =
                                            MA.ITD_ID_ETIQ_REC
                                        AND (MB.NM_FNT_ATND = 'NAC' OR
                                             MB.NM_FNT_ATND = 'RMN')
                                        AND ROWNUM = 1)
                     AND   ROWNUM = 1 
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '01'                    TO ST80014-CD-DIZR-NF
           ELSE      
                MOVE SPACES                  TO ST80014-CD-DIZR-NF.      

           MOVE SF0002-ITD-CD-T-PGT-LOG      TO ST80014-CD-T-PGT.      

           PERFORM 150-00-PESQUISA-INCENTIVO.
           MOVE WS31-CHV-INC-OK              TO ST80014-CD-INCT-ICMS.

           MOVE SF0001-PTD-CD-TRSR           TO ST80014-CD-TRSR.      
           MOVE CC0005-RAZAO-SOCIAL-E        TO ST80014-NM-TRSR.      
           MOVE SF0001-PTD-ID-PTC-DSP        TO ST80014-ID-PTC-DSP.

           INSPECT SF0002-ITD-FTR-EXP-LOG    CONVERTING SPACES TO ZEROS.
           MOVE SF0002-ITD-FTR-EXP-LOG       TO ST80014-ID-FTR-EXP.

           INSPECT SF0002-ITD-RATE-US        CONVERTING SPACES TO ZEROS.
           MOVE SF0002-ITD-RATE-US           TO WS01-RATE-US.
           MOVE WS01-RATE-US                 TO ST80014-ID-RATE-US.

           INSPECT CC0002-ALIQ-ICMS-LOG      CONVERTING SPACES TO ZEROS.
           MOVE CC0002-ALIQ-ICMS-LOG-5       TO ST80014-ID-PERC-ICMS.      

           MOVE ZEROS                        TO 
                                            ST80014-ID-PERC-COMS-VNDR.      
           MOVE ZEROS                        TO ST80014-ID-PERC-DSCT.      
           MOVE CC0001-PESO-BRUTO-KG-LOG     TO 
                                            ST80014-V-TTL-PESO-BRT-NF-R.
           IF WS36-CD-MERC-DST  EQUAL  'E'
                MOVE CC0001-VL-OUTRAS-DESPESAS-LOG
                                             TO ST80014-V-TTL-SERV-NF-R
           ELSE
                MOVE WQ01-TTL-V-TX-SERV      TO ST80014-V-TTL-SERV-NF
                MOVE WQ01-TTL-V-SUR-CHRG     TO 
                                              ST80014-V-TTL-SUR-CHRG-NF.
                                              
           MOVE WQ01-TTL-V-ADC-IPI          TO ST80014-V-TTL-ADC-IPI-NF.
           MOVE WQ01-TTL-V-CAS-RMAN-ODA      TO ST80014-V-TTL-CASC-NF.
           MOVE WQ01-TTL-V-CAS-RMAN-CMIS2    TO ST80014-V-TTL-CMI2-NF.

           IF WS36-CD-MERC-DST  EQUAL  'E'  OR
              CB0004-CD-T-PRD  EQUAL  'C'
                MOVE CC0001-VL-FRETE-LOG     TO ST80014-V-TTL-FRT-NF-R
                MOVE CC0001-VL-SEGURO-LOG    TO ST80014-V-TTL-SEG-NF-R
           ELSE
                MOVE WQ01-TTL-V-FRT          TO ST80014-V-TTL-FRT-NF
                MOVE ZEROS                   TO ST80014-V-TTL-SEG-NF.

           IF WS36-CD-MERC-DST  EQUAL  'E'
                MOVE CC0001-VL-AJUSTE-PRECO-TOTAL-M
                                             TO ST80014-V-TTL-DSCT-NF-R
                MOVE ZEROS                   TO 
                                              ST80014-V-TTL-DSCT-CAMP-R
           ELSE
                MOVE ZEROS                   TO ST80014-V-TTL-DSCT-NF-R
                MOVE CC0001-VL-DESCONTO-LOG  TO 
                                              ST80014-V-TTL-DSCT-CAMP-R.

           MOVE CC0001-PRECO-TOTAL-M-LOG     TO ST80014-V-TTL-MRCD-NF-R.      
           MOVE CC0001-VL-TOTAL-BASE-ICMS-LOG
                                             TO 
                                            ST80014-V-TTL-BS-ICMS-NF-R.      
           MOVE CC0001-VL-TOTAL-BASE-STF-LOG TO 
                                           ST80014-V-TTL-BS-ICMS-SUBS-R.      
           MOVE CC0001-PRECO-TOTAL-M-LOG     TO 
                                              ST80014-V-TTL-BS-IPI-NF-R.      

           MOVE CC0001-VL-TOTAL-STF-LOG      TO WS01-VL-TOTAL-ST.                                            

           MOVE CC0001-VL-TOTAL-FCP-ST       TO WS01-VL-TOTAL-FCP-ST.

           ADD  WS01-VL-TOTAL-FCP-ST         TO WS01-VL-TOTAL-ST.
                                                    
           MOVE WS01-VL-TOTAL-ST             TO
                                              ST80014-V-TTL-ICMS-SUBS-R.
           MOVE CC0001-VL-TOTAL-ICMS-LOG     TO ST80014-V-TTL-ICMS-NF-R.
           MOVE CC0001-VL-TOTAL-IPI-LOG      TO ST80014-V-TTL-IPI-NF-R.
           MOVE CC0001-VL-TOTAL-CONTABIL-LOG TO ST80014-V-TTL-FTRD-NF-R.
           MOVE CC0001-VL-TOTAL-PIS-PASEP-LOG
                                             TO ST80014-V-TTL-PIS-NF-R.
           MOVE CC0001-VL-TOTAL-COFINS-LOG   TO
                                              ST80014-V-TTL-COFINS-NF-R.

           MOVE 'BPIS'                       TO ST80014-ID-LGON-FUNC.      

           IF WS01-TERMO-SPPP  EQUAL  'S'
                MOVE ST0005-CD-PGT-SPPP      TO ST80014-CD-PGT-SPPP      
           ELSE
                MOVE SPACES                  TO ST80014-CD-PGT-SPPP.

           MOVE CB0004-CD-T-PRD              TO ST80014-CD-T-PRD. 
           
           IF CC0002-IC-NF-TRBT EQUAL 'N'  
                MOVE 'S'                     TO ST80014-IC-NF-TRBT
           ELSE
                MOVE 'N'                     TO ST80014-IC-NF-TRBT.
               
       790-50-DANFE-REMESSA.

           MOVE SPACES                       TO ST80014-CT-ICM-CR 
                                                ST80014-CT-ICM-DEB 
                                                ST80014-CT-IPI-CR 
                                                ST80014-CT-IPI-DEB. 
           
           IF ST0001-CD-REGR-DCT  NOT EQUAL  'B'  
                GO                           TO 790-60-CONTA-ITENS.

           IF ST0001-CD-REGR-FTRM  NOT EQUAL  'C'  
                GO                           TO 790-60-CONTA-ITENS.

           EXEC SQL SELECT TIT_CT_ICM_CR,
                           TIT_CT_ICM_DEB,
                           TIT_CT_IPI_CR,
                           TIT_CT_IPI_DEB
                    INTO   :WQ01-CT-ICM-CR     :WI01-CT-ICM-CR,
                           :WQ01-CT-ICM-DEB    :WI01-CT-ICM-DEB,
                           :WQ01-CT-IPI-CR     :WI01-CT-IPI-CR,
                           :WQ01-CT-IPI-DEB    :WI01-CT-IPI-DEB
                    FROM   H1SF.SN_TRS_TRI
                   WHERE  TRS_CD_TRSC = 25
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - CONTA CONTABIL INEX.- H1SF.SN_TRS_TRI'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.               

           MOVE WQ01-CT-ICM-CR               TO ST80014-CT-ICM-CR. 
           MOVE WQ01-CT-ICM-DEB              TO ST80014-CT-ICM-DEB. 
           MOVE WQ01-CT-IPI-CR               TO ST80014-CT-IPI-CR. 
           MOVE WQ01-CT-IPI-DEB              TO ST80014-CT-IPI-DEB. 
           
           PERFORM 840-00-GERA-LANCAMENTOS-CT.

       790-60-CONTA-ITENS.

           EXEC SQL SELECT MAX(ITD_CD_SEQ_ITM)
                    INTO   :WQ01-MAX-ITEM
                    FROM   H1SF.ITD_ITMFATURADO
                   WHERE  ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                     AND  ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                     AND  ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                     AND  ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                     AND  ITD_ID_NF        = :CC0001-NUMERO
                END-EXEC.

           INSPECT WQ01-MAX-ITEM             CONVERTING SPACES TO ZEROS.
           MOVE WQ01-MAX-ITEM-4              TO ST80014-Q-ITM-NF.

           MOVE WS01-NFE-LOCALIZADOR         TO ST80014-NFE-LCLR.
           INSPECT SF0002-ITD-RATE-PGT       CONVERTING SPACES TO ZEROS.
           MOVE SF0002-ITD-RATE-PGT          TO ST80014-ID-RATE-PGT.
           INSPECT SF0020-TIP-Q-DIA-PGT      CONVERTING SPACES TO ZEROS.
           MOVE SF0020-TIP-Q-DIA-PGT         TO ST80014-Q-DIA-PGT.
           
       790-99-MONTA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 10/00 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       791-00-MONTA-LOG-NF-ITEM              SECTION.
      *----------------------------------------------*

           MOVE '791-00-MONTA-LOG-NF-ITEM'   TO WS35-AUX-TS.  

           MOVE '01'                         TO ACB5022-CD-ACES.
           MOVE ZEROS                        TO ACB5022-CD-RETR-ECI
                                                ACB5022-CD-RETR-ACES.
           MOVE '03'                         TO ACB50221-CD-ACES-MQ.
           MOVE 00005                        TO ACB50221-ID-FILA-MQ.            
           MOVE ZEROS                        TO ACB50221-CD-RETR-MQ 
                                                ACB50221-CD-COMP
                                                ACB50221-CD-RSON.
           MOVE SPACES                       TO ACB50221-ID-MSG-PRC.

           MOVE SF0002-ITD-DTC-SEL-FTRM      TO WS35-ID-CORR-ID-LIT-SC.
           MOVE CC0001-NUMERO-CTB-5          TO WS35-ID-CORR-ID-ALF-SC.
           INSPECT WS35-ID-CORREL-ID         CONVERTING SPACES TO ZEROS.
           MOVE WS35-ID-CORREL-ID            TO ACB50221-ID-MSG-AUX.

           MOVE MQ01-ARE-CNT-FILA            TO ACB50221-ARE-CNT-FILA.

       791-10-MONTA-LOG.

           MOVE SPACES                       TO ST8001-ST80014.   

           MOVE '21'                         TO ST80014-CD-ACES.

           EXEC SQL SELECT A.ITD_ID_VOL,
                           A.ITD_ID_PDD,
                           A.ITD_ID_PECA,
                           A.ITD_ID_ETIQ_REC,
                           A.ITD_ID_ETIQ_ACND,
                           A.ITD_Q_PECA_FTRD,
                           LTRIM(TO_CHAR(A.ITD_Q_PECA_FTRD,
                                                         '0000000V00')),
                           A.ITD_V_FRT,
                           A.ITD_PERC_TX_SERV,
                           A.ITD_PERC_SUR_CHRG,
                           A.ITD_V_TX_SERV,
                           A.ITD_V_SUR_CHRG,
                           A.ITD_PERC_DSCT,
                           TO_CHAR((DECODE(B.CD_T_PGM,'DELT',
                                   A.ITD_V_DSCT_ESP,
                                   A.ITD_V_DSCT_ESP*A.ITD_Q_PECA_FTRD)
                                                  /10000),'9999999V99'),
                           A.ITD_ID_ITM_DE,
                           LTRIM(TO_CHAR(A.ITD_ID_NF,'000000000')),
                           A.ITD_V_ADC_IPI,
                           A.ITD_PESO_LQD_PECA,
                           A.ITD_PESO_BRT_PECA,
                           A.ITD_ID_PRFL,
                           A.ITD_V_CAS_RMAN_ODA,
                           A.ITD_V_CAS_RMAN_CMIS2,
                           A.ITD_ID_CASC_CBL,
                           A.ITD_PREC_US_DN_CORE,
                           A.ITD_PREC_US_IC_CORE,
                           A.ITD_V_US_RT_FRT,
                           A.ITD_V_US_RT_SGR,
                           A.ITD_V_US_RT_ODA,
                           A.ITD_V_AI_CHRG_API,
                           A.ITD_V_EMG_CHRG_API,
                           A.ITD_V_MKT_DISC_API,
                           TRIM(A.ITD_ID_FTR_API),
                           NVL(A.ITD_V_US_ARED_CES_ODA,0),
                           A.ITD_V_SUR_CHRG_API,
                           B.CD_SIT_ATND,
                           B.ID_PDD,
                           B.ID_PSO,
                           B.ID_SQN_ATND_ITEM,
                           B.ID_SQN_OCR_FNT,
                           TO_CHAR(B.DTC_ATND_PECA, 'DDMMYYYY'),
                           B.ID_PECA_PDD,
                           B.CD_GR_PECA,
                           B.CD_FNT_SPR,
                           B.CD_FNT_SPR_ANTG,
                           B.CD_FNT_ATND,
                           B.CD_T_PREC_FTRM,
                           B.CD_PREC_FRME_FTRM,
                           B.ID_LCAC_ETQG_CLI,
                           B.CD_T_PGM,
                           B.CD_PGT_SPPP,
                           B.CD_NUM_PGM,
                           B.ID_SQN_MTG,
                           B.NM_FNT_ATND,
                           B.CD_PFO,
                           B.TXT_SUB_HDR,
                           B.ID_CCR,
                           B.ID_CCR_VRS,
                           B.ID_CCR_NUM_LNH,
                           B.ID_SQN_ITEM_PDD,
                           B.PREC_UNT_INFD,
                           B.ID_LOTE_FTRM_CBL,
                           B.IC_NACZ_ICPN_BT
                    INTO   :SF0002-ITD-ID-VOL-LOG,
                           :SF0002-ITD-ID-PDD-LOG,
                           :SF0002-ITD-ID-PECA-LOG,
                           :SF0002-ITD-ID-ETIQ-REC-LOG,
                           :SF0002-ITD-ID-ETIQ-ACND-LOG,
                           :SF0002-ITD-Q-PECA-FTRD,
                           :SF0002-ITD-Q-PECA-FTRD-CTB,
                           :SF0002-ITD-V-FRT,
                           :SF0002-ITD-PERC-TX-SERV,
                           :SF0002-ITD-PERC-SUR-CHRG,
                           :SF0002-ITD-V-TX-SERV,
                           :SF0002-ITD-V-SUR-CHRG,
                           :SF0002-ITD-PERC-DSCT,
                           :WQ01-DESCONTO-ITEM-LOG :WI01-DESCONTO,
                           :SF0002-ITD-ID-ITM-DE  :WI01-ITD-ID-ITM-DE,
                           :SF0002-ITD-ID-NF-LOG  :WI01-ID-NF,
                           :SF0002-ITD-V-ADC-IPI,
                           :SF0002-ITD-PESO-LQD-PECA,
                           :SF0002-ITD-PESO-BRT-PECA,
                           :SF0002-ITD-ID-PRFL,
                           :SF0002-ITD-V-CAS-RMAN-ODA,
                           :SF0002-ITD-V-CAS-RMAN-CMIS2,
                           :SF0002-ITD-ID-CASC-CBL 
                                                 :WI01-ITD-ID-CASC-CBL,
                           :SF0002-ITD-PREC-US-DN-CORE,
                           :SF0002-ITD-PREC-US-IC-CORE,
                           :SF0002-ITD-V-US-RT-FRT,
                           :SF0002-ITD-V-US-RT-SGR,
                           :SF0002-ITD-V-US-RT-ODA,
                           :SF0002-ITD-V-AI-CHRG-API,
                           :SF0002-ITD-V-EMG-CHRG-API,
                           :SF0002-ITD-V-MKT-DISC-API,
                           :SF0002-ITD-ID-FTR-API-LOG
                                                 :WI01-ID-FTR-API-LOG,
                           :SF0002-ITD-V-US-ARED-CES-ODA,
                           :SF0002-ITD-V-SUR-CHRG-API,
                           :ST0005-CD-SIT-ATND,
                           :ST0005-ID-PDD,
                           :ST0005-ID-PSO,
                           :ST0005-ID-SQN-ATND-ITEM,
                           :ST0005-ID-SQN-OCR-FNT,
                           :ST0005-DTC-ATND-PECA,
                           :ST0005-ID-PECA-PDD,
                           :ST0005-CD-GR-PECA,
                           :ST0005-CD-FNT-SPR,
                           :ST0005-CD-FNT-SPR-ANTG 
                                                 :WI01-CD-FNT-SPR-ANTG,
                           :ST0005-CD-FNT-ATND,
                           :ST0005-CD-T-PREC-FTRM,
                           :ST0005-CD-PREC-FRME-FTRM,
                           :ST0005-ID-LCAC-ETQG-CLI 
                                                 :WI01-ID-LCAC-ETQG-CLI,
                           :ST0005-CD-T-PGM      :WI01-CD-T-PGM,
                           :ST0005-CD-PGT-SPPP   :WI01-CD-PGT-SPPP,
                           :ST0005-CD-NUM-PGM    :WI01-CD-NUM-PGM,
                           :ST0005-ID-SQN-MTG    :WI01-ID-SQN-MTG,
                           :ST0005-NM-FNT-ATND,
                           :ST0005-CD-PFO        :WI01-CD-PFO,
                           :ST0005-TXT-SUB-HDR   :WI01-TXT-SUB-HDR,
                           :ST0005-ID-CCR        :WI01-ID-CCR,
                           :ST0005-ID-CCR-VRS    :WI01-ID-CCR-VRS,
                           :ST0005-ID-CCR-NUM-LNH :WI01-ID-CCR-NUM-LNH,
                           :ST0005-ID-SQN-ITEM-PDD,
                           :ST0005-PREC-UNT-INFD,
                           :ST0005-ID-LOTE-FTRM-CBL
                                                 :WI01-ID-LOTE-FTRM-CBL,
                           :ST0005-IC-NACZ-ICPN-BT
                                                 :WI01-IC-NACZ-ICPN-BT
                    FROM   H1SF.ITD_ITMFATURADO A,
                           H1ST.ITEM_RECOLHIMENTO B
                   WHERE  A.ITD_ID_ETIQ_REC  = B.ID_ETIQ_REC
                     AND  A.ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                     AND  A.ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                     AND  A.ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                     AND  A.ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                     AND  A.ITD_ID_NF        = :CC0001-NUMERO
                     AND  A.ITD_CD_SEQ_ITM   = :CC0002-IDF-NUM
                     AND  ROWNUM = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - LOG. SYNC. - ITD-ITMFAT. ITEM NF: ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE CC0001-NUMERO           TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM                
                PERFORM 900-00-REGISTRA-ERRO-TRNS.               

           IF WI01-ID-NF            EQUAL  -1          OR
              SF0002-ITD-ID-NF-LOG  EQUAL  LOW-VALUES  OR
              SF0002-ITD-ID-NF-LOG  EQUAL  SPACES      OR
              SF0002-ITD-ID-NF-LOG  EQUAL  ZEROS 
                MOVE '*** ERRO - NF COM PROBLEMAS (PFN) NF-I: ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE CC0001-NUMERO           TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.

           EXEC SQL SELECT CD_T_ACND
                    INTO   :ST0004-CD-T-ACND
                    FROM   H1ST.VOLUME_RECOLHIMENTO
                   WHERE  ID_VOL = :SF0002-ITD-ID-VOL-LOG
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - LOG. SYNC. - VOL. RECOL. VOLUME: ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE SF0002-ITD-ID-VOL-LOG   TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.               

           INSPECT SF0002-ITD-ID-ETIQ-REC-LOG
                                             CONVERTING SPACES TO ZEROS.

           INSPECT SF0002-ITD-PESO-LQD-PECA  CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-PESO-BRT-PECA  CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-ID-PRFL        CONVERTING SPACES TO ZEROS.
           
           INSPECT SF0002-ITD-PREC-US-DN-CORE
                                             CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-PREC-US-IC-CORE
                                             CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-V-US-RT-FRT    CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-V-US-RT-SGR    CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-V-US-RT-ODA    CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-V-AI-CHRG-API  CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-V-EMG-CHRG-API CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-V-MKT-DISC-API CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-V-US-ARED-CES-ODA
                                             CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-V-SUR-CHRG-API CONVERTING SPACES TO ZEROS.
           INSPECT ST0005-PREC-UNT-INFD      CONVERTING SPACES TO ZEROS.
           
           EXEC SQL SELECT SPP_ID_CT_CTBL
                      INTO :SF0008-SPP-ID-CT-CTBL  :WI01-SPP-ID-CT-CTBL
                      FROM H1SF.SPP_PROGRAMAS
                     WHERE SPP_CD_T_PGM   = RTRIM(:ST0005-CD-T-PGM)
                       AND SPP_CD_NUM_PGM = :ST0005-CD-NUM-PGM
                       AND ROWNUM = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE SPACES                  TO SF0008-SPP-ID-CT-CTBL
           ELSE
                IF WI01-SPP-ID-CT-CTBL  NOT GREATER  -1
                     MOVE SPACES             TO SF0008-SPP-ID-CT-CTBL.
                     
           IF ST0005-CD-T-PGM  EQUAL  'DELT'
                MOVE 3                       TO SF0008-SPP-ID-CT-CTBL.

           EXEC SQL SELECT A.CD_DSPS_PDD,
                           A.CD_STM_ATND,
                           A.CD_MOD_TRSP_IMP,
                           A.ID_REF_CLI
                    INTO   :ST0003-CD-DSPS-PDD,
                           :ST0003-CD-STM-ATND,
                           :ST0003-CD-MOD-TRSP-IMP 
                                                :WI01-CD-MOD-TRSP-IMP,
                           :ST0003-ID-REF-CLI
                    FROM   H1ST.RECOLHIMENTO A,
                           H1ST.ITEM_RECOLHIMENTO B
                    WHERE  A.CD_T_REC    = B.CD_T_REC
                    AND    A.CD_T_MTZ    = B.CD_T_MTZ
                    AND    A.ID_MTZ      = B.ID_MTZ
                    AND    A.ID_CLI      = B.ID_CLI
                    AND    A.CD_SIT_ATND = B.CD_SIT_ATND
                    AND    A.ID_PDD      = B.ID_PDD
                    AND    A.ID_PSO      = B.ID_PSO
                    AND    B.ID_ETIQ_REC = :SF0002-ITD-ID-ETIQ-REC-LOG
                    AND    ROWNUM = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - LOG. SYNC. - RECOL. PDD: ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE ST0005-ID-PDD           TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.               

           IF WI01-CD-MOD-TRSP-IMP  NOT GREATER  -1
                MOVE SPACES                  TO ST0003-CD-MOD-TRSP-IMP.      

           IF WI01-ID-LCAC-ETQG-CLI  NOT GREATER  -1
                MOVE SPACES                  TO ST0005-ID-LCAC-ETQG-CLI.

           EXEC SQL SELECT PREC_US_DN_PPM_UNIT
                    INTO   :SR0004-PREC-US-DN-PPM-UNIT
                    FROM   H1SR.PECA
                   WHERE   ID_PECA  = :SF0002-ITD-ID-PECA-LOG
                     AND   ROWNUM = 1
                END-EXEC.

           INSPECT SF0002-ITD-ID-ETIQ-ACND-LOG
                                             CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-Q-PECA-FTRD    CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-V-FRT          CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-PERC-TX-SERV   CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-PERC-SUR-CHRG  CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-V-TX-SERV      CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-V-SUR-CHRG     CONVERTING SPACES TO ZEROS.
           INSPECT ST0004-CD-T-ACND          CONVERTING SPACES TO ZEROS.
           INSPECT ST0005-ID-PSO             CONVERTING SPACES TO ZEROS.
           INSPECT ST0005-ID-SQN-OCR-FNT     CONVERTING SPACES TO ZEROS.
           INSPECT ST0005-ID-SQN-ATND-ITEM   CONVERTING SPACES TO ZEROS.
           INSPECT CC0002-IDF-NUM            CONVERTING SPACES TO ZEROS.
           INSPECT CC0002-ALIQ-ICMS-LOG      CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-PERC-DSCT      CONVERTING SPACES TO ZEROS.
           INSPECT ST0005-ID-SQN-MTG         CONVERTING SPACES TO ZEROS.
           INSPECT SR0004-PREC-US-DN-PPM-UNIT
                                             CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-V-ADC-IPI      CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-V-CAS-RMAN-ODA CONVERTING SPACES TO ZEROS.
           INSPECT SF0002-ITD-V-CAS-RMAN-CMIS2
                                             CONVERTING SPACES TO ZEROS.

           MOVE ST0001-CD-FBR              TO ST80014-CD-FBR-I.
           MOVE CC0001-SERIE-SUBSERIE-3    TO ST80014-CD-SRIE-NF-I.
           MOVE SF0002-ITD-ID-NF-LOG       TO ST80014-ID-NF-I.      
           INSPECT ST80014-ID-NF-I         CONVERTING SPACES TO ZEROS.

           MOVE ST0004-CD-T-ACND           TO ST80014-CD-T-ACND.
           MOVE SF0002-ITD-ID-VOL-LOG      TO ST80014-ID-VOL.
           MOVE SF0002-ITD-ID-PDD-LOG      TO ST80014-ID-PDD.           
           MOVE ST0005-ID-PSO              TO ST80014-ID-PSO.           
           MOVE ST0003-CD-DSPS-PDD         TO ST80014-CD-DSPS-PDD.
           MOVE ST0003-CD-STM-ATND         TO ST80014-CD-STM-ATND.
           MOVE ST0003-CD-MOD-TRSP-IMP     TO ST80014-CD-MOD-TRSP-IMP.
           MOVE ST0005-DTC-ATND-PECA       TO ST80014-DTC-ATND-PECA.
           MOVE ST0005-ID-PECA-PDD         TO ST80014-ID-PECA-PDD.  
           MOVE 'AA'                       TO ST80014-CD-T-PECA-PDD.
           MOVE SF0002-ITD-ID-PECA-LOG     TO ST80014-ID-PECA-ATND.
           MOVE 'AA'                       TO ST80014-CD-T-PECA-ATND.
           MOVE SF0002-ITD-Q-PECA-FTRD     TO ST80014-Q-PECA-FTRD
                                              WS01-Q-PECA-AUX.      

           MOVE CC0002-IDF-TEXTO-COMPLEMENTAR
                                        TO WS01-TEXTO-COMPLEMENTAR-EMIF.

      *    MOVE WS01-TXT-PESO-BRT-EMIF      TO WS01-PESO-BRT-EMIF.
      *    MOVE WS01-PESO-BRT-EMIF-INT      TO WS01-PESO-BRT-EMIF-N-I.
      *    MOVE WS01-PESO-BRT-EMIF-DEC      TO WS01-PESO-BRT-EMIF-N-D.

           MOVE WQ01-PESO-BRT-EMIF-UNIT     TO WS01-PESO-BRT-EMIF-NUM.

           INSPECT WS01-PESO-BRT-EMIF-NUM-R CONVERTING SPACES TO ZEROS.

           COMPUTE WS01-PESO-AUX ROUNDED =  WS01-PESO-BRT-EMIF-NUM * 
                                            WS01-Q-PECA-AUX.

           MOVE WS01-PESO-AUX           TO ST80014-PESO-UNIT-TOT-R.

           INSPECT CC0002-NBM-CODIGO       CONVERTING SPACES TO ZEROS.
           MOVE CC0002-NBM-CODIGO          TO ST80014-ID-CLSF-FSCL.
           MOVE SF0002-ITD-ID-ETIQ-REC-LOG TO ST80014-ID-ETIQ-REC.
           MOVE SF0002-ITD-ID-ETIQ-ACND-LOG 
                                           TO ST80014-ID-ETIQ-ACND.
           MOVE ST0005-CD-SIT-ATND         TO ST80014-CD-SIT-ATND.
           MOVE ST0005-CD-FNT-ATND         TO ST80014-CD-FNT-ATND.
           IF ST0005-IC-NACZ-ICPN-BT  EQUAL  'S'
                MOVE 'Y305'                TO ST80014-CD-FNT-ATND-ORIG
           ELSE
                MOVE ST0005-CD-FNT-ATND    TO ST80014-CD-FNT-ATND-ORIG.
           INSPECT CC0002-CFOP-CODIGO      CONVERTING SPACES TO ZEROS.
           MOVE CC0002-CFOP-CODIGO         TO ST80014-CD-CFOP.
           MOVE ST0005-CD-GR-PECA          TO ST80014-CD-GR-PECA.      
           MOVE ST0005-CD-FNT-SPR          TO ST80014-CD-FNT-SPR.
           MOVE ST0005-CD-FNT-SPR-ANTG     TO ST80014-CD-FNT-SPR-ANTG.
           MOVE ST0005-ID-SQN-ATND-ITEM    TO ST80014-ID-SQN-ATND-ITEM.
           MOVE ST0005-ID-SQN-OCR-FNT      TO ST80014-ID-SQN-OCR-FNT.  
           MOVE ST0005-CD-T-PREC-FTRM      TO ST80014-CD-T-PREC-FTRM.
           MOVE ST0005-CD-PREC-FRME-FTRM   TO ST80014-CD-PREC-FRME-FTRM.
           MOVE SF0008-SPP-ID-CT-CTBL      TO ST80014-ID-CT-CTBL.
           MOVE ST0005-ID-LCAC-ETQG-CLI    TO ST80014-ID-LCAC-ETQG-CLI.
              
           IF ST0001-CD-REGR-FTRM  EQUAL  'K'
              MOVE ST0005-TXT-SUB-HDR      TO WS01-TXT-SUB-HDR
              MOVE WS01-TXT-INFR-ADIC      TO ST80014-TXT-INFR-ADIC
           ELSE
                MOVE ST0003-ID-REF-CLI     TO ST80014-TXT-INFR-ADIC.

           INSPECT CC0002-ALIQ-IPI-LOG     CONVERTING SPACES TO ZEROS.
           MOVE CC0002-ALIQ-IPI-LOG-5      TO ST80014-ID-PERC-IPI.
           MOVE CC0002-ALIQ-ICMS-LOG-5     TO 
                                            ST80014-ID-PERC-ICMS-ITEM.
           MOVE SF0002-ITD-PERC-TX-SERV    TO ST80014-ID-PERC-SERV.
           MOVE SF0002-ITD-PERC-SUR-CHRG   TO ST80014-ID-PERC-SUR-CHRG.
           MOVE SF0002-ITD-PERC-DSCT       TO ST80014-ID-PERC-DSCT-ITEM.
           MOVE CC0002-PRECO-UNITARIO-LOG  TO
                                             ST80014-PREC-FTRD-UNT-EMIF.
           MOVE CC0002-VL-FISCAL           TO ST80014-V-TTL-FSCL-ITM.
           MOVE SF0002-ITD-V-TX-SERV-9     TO ST80014-V-TTL-SERV-ITEM.
           MOVE SF0002-ITD-V-SUR-CHRG-9    TO 
                                            ST80014-V-TTL-SUR-CHRG-ITEM.
           MOVE SF0002-ITD-V-ADC-IPI-9     TO ST80014-V-TTL-ADC-IPI-ITM.
           
           MOVE WM01-VL-IPI-LOG            TO ST80014-V-TTL-IPI-ITEM.
           MOVE SF0002-ITD-V-FRT-9         TO ST80014-V-TTL-FRT-ITEM.
      *    MOVE CC0002-DESCONTO-ITEM-LOG   TO ST80014-V-TTL-DESC-ITEM.
           MOVE WQ01-DESCONTO-ITEM-LOG     TO ST80014-V-TTL-DESC-ITEM.
           MOVE CC0002-VL-TRIBUTAVEL-ICMS  TO
                                             ST80014-V-TTL-BS-ICMS-ITEM.
           MOVE CC0002-VL-ICMS             TO ST80014-V-TTL-ICMS-ITEM.
           MOVE CC0002-VL-IMPOSTO-PIS      TO ST80014-V-TTL-PIS-ITEM.
           MOVE CC0002-VL-IMPOSTO-COFINS   TO ST80014-V-TTL-COFINS-ITEM.
           MOVE SR0004-PREC-US-DN-PPM-UNIT TO ST80014-PREC-DN-PPM-ITEM.
           MOVE CC0002-VL-TRIBUTAVEL-STF   TO
                                             ST80014-V-TTL-BS-ICMS-SBSC.
           MOVE CC0002-VL-STF-CTB            TO WS01-VL-STF-CTB.
      
           MOVE WS01-VL-STF-CTB-R            TO WS01-VL-ICMS-ST.

           MOVE CC0002-VL-ICMS-FCPST         TO WS01-VL-ICMS-FCPST.

           ADD  WS01-VL-ICMS-FCPST-R       TO WS01-VL-ICMS-ST.
                                             
           MOVE WS01-VL-ICMS-ST            TO ST80014-V-TTL-ICMS-SBSC-R.
           MOVE CC0002-FAT-BASE-CALC-STF   TO ST80014-V-FTOR-SBSC.
           MOVE CC0002-IDF-NUM             TO ST80014-ID-SQN-ITM.
           MOVE ST0005-ID-SQN-MTG          TO ST80014-ID-SQN-MTG.
           MOVE CC0002-OM-CODIGO           TO ST80014-CD-OM.
           MOVE CC0002-STC-CODIGO          TO ST80014-CD-STC.
           MOVE ST0005-CD-PFO              TO ST80014-CD-PFO.
           INSPECT CC0002-VL-ALIQ-PIS      CONVERTING SPACES TO ZEROS.
           MOVE CC0002-VL-ALIQ-PIS-5       TO ST80014-ID-PERC-PIS.
           INSPECT CC0002-VL-ALIQ-COFINS   CONVERTING SPACES TO ZEROS.
           MOVE CC0002-VL-ALIQ-COFINS-5    TO ST80014-ID-PERC-COFINS.
           MOVE CC0002-VL-BASE-STT         TO ST80014-V-TTL-BS-STT-ITM.

           MOVE CC0002-NOP-COD-1           TO WS01-NOP-AUX-COD-1.
           MOVE CC0002-NOP-COD-2           TO WS01-NOP-AUX-COD-2.
           MOVE WS01-NOP-AUX               TO ST80014-CD-NOP.

           MOVE CC0002-VL-PIS-ST           TO ST80014-V-TTL-PIS-ST-ITM.
           MOVE CC0002-VL-COFINS-ST        TO ST80014-V-TTL-COF-ST-ITM.
           MOVE SF0002-ITD-ID-PRFL         TO ST80014-ID-PRFL.
           INSPECT ST80014-ID-PRFL         CONVERTING SPACES TO ZEROS.

           IF WI01-ID-CCR  GREATER  -1
                MOVE ST0005-ID-CCR         TO ST80014-ID-CCR
           ELSE
                MOVE SPACES                TO ST80014-ID-CCR.
                
           IF WI01-ID-CCR-VRS  GREATER  -1
                MOVE ST0005-ID-CCR-VRS     TO ST80014-ID-CCR-VRS
           ELSE
                MOVE SPACES                TO ST80014-ID-CCR-VRS.
                
           IF WI01-ID-CCR-NUM-LNH  GREATER  -1
                MOVE ST0005-ID-CCR-NUM-LNH TO ST80014-ID-CCR-NUM-LNH
           ELSE
                MOVE SPACES                TO ST80014-ID-CCR-NUM-LNH.
                
           IF WI01-ITD-ID-CASC-CBL  GREATER  -1
                MOVE SF0002-ITD-ID-CASC-CBL
                                           TO ST80014-ID-CASC-CBL
           ELSE
                MOVE SPACES                TO ST80014-ID-CASC-CBL.

           MOVE SF0002-ITD-V-RMAN-ODA-9    TO ST80014-V-TTL-CASC-ITEM.
           MOVE SF0002-ITD-V-RMAN-CMIS2-9  TO ST80014-V-TTL-CMIS-ITEM.
           
           MOVE ST0005-PREC-UNT-INFD       TO ST80014-PREC-UNT-INFD.
           
           IF WI01-ID-LOTE-FTRM-CBL  GREATER  -1
                MOVE ST0005-ID-LOTE-FTRM-CBL
                                           TO ST80014-ID-LOTE-FTRM-CBL
           ELSE
                MOVE SPACES                TO ST80014-ID-LOTE-FTRM-CBL.

           MOVE CC0002-STA-CODIGO          TO ST80014-CD-SIT-TRIB-PIS.
           MOVE CC0002-STN-CODIGO          TO ST80014-CD-SIT-TRIB-COF.

       791-99-MONTA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 10/00 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       795-00-MONTA-LOG-PROTOCOLO            SECTION.
      *----------------------------------------------*

           MOVE '795-00-MONTA-LOG-PROTOCOLO' TO WS35-AUX-TS.

           MOVE '01'                         TO ACB5022-CD-ACES.
           MOVE ZEROS                        TO ACB5022-CD-RETR-ECI
                                                ACB5022-CD-RETR-ACES.
           MOVE '03'                         TO ACB50221-CD-ACES-MQ.
           MOVE 00005                        TO ACB50221-ID-FILA-MQ.            
           MOVE ZEROS                        TO ACB50221-CD-RETR-MQ 
                                                ACB50221-CD-COMP
                                                ACB50221-CD-RSON.
           MOVE SPACES                       TO ACB50221-ID-MSG-PRC
                                                ACB50221-ID-MSG-AUX.

           MOVE SPACES                       TO ST8001-ST80015.    

           MOVE '11'                         TO ST80015-CD-ACES.
           MOVE SF0001-PTD-CD-T-REC          TO ST80015-CD-T-REC.      
           MOVE SF0001-PTD-CD-T-MTZ          TO ST80015-CD-T-MTZ.      

           EXEC SQL SELECT A.ITD_CD_MOD_TRSP,
                           B.ID_CLI_RLCD
                    INTO   :SF0002-ITD-CD-MOD-TRSP-LOG,
                           :ST0005-ID-CLI-RLCD  :WI01-ID-CLI-RLCD
                    FROM   H1SF.ITD_ITMFATURADO A,
                           H1ST.ITEM_RECOLHIMENTO B
                   WHERE  A.ITD_ID_ETIQ_REC  = B.ID_ETIQ_REC
                     AND  A.ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                     AND  A.ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                     AND  A.ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                     AND  A.ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                     AND  A.ITD_ID_NF        = :CC0001-NUMERO
                     AND  ROWNUM = 1
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - LOG. SYNC. - ITD-ITMFATURADO PTD: ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE CC0001-NUMERO           TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.               

           IF WI01-ID-CLI-RLCD  GREATER  -1
                EXEC SQL SELECT ID_MTZ
                         INTO   :ST0008-ID-MTZ
                         FROM   H1ST.CONTROLE_VOLUME
                         WHERE  ID_CLI = :ST0005-ID-CLI-RLCD
                         AND    ROWNUM = 1
                     END-EXEC
                MOVE ST0008-ID-MTZ           TO ST80015-ID-MTZ
                MOVE ST0005-ID-CLI-RLCD      TO ST80015-ID-CLI
           ELSE
                MOVE SF0001-PTD-ID-MTZ       TO ST80015-ID-MTZ
                MOVE SF0001-PTD-ID-CLI       TO ST80015-ID-CLI.

           MOVE SF0002-ITD-CD-MOD-TRSP-LOG   TO ST80015-CD-MOD-TRSP.      

           EXEC SQL DECLARE CSR_SEL_795  CURSOR FOR       
                    SELECT ITD_ID_VOL,
                           ITD_FTR_EXP
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST  = :WQ02-CD-MERC-DST   AND
                           ITD_DTC_SEL_FTRM = :WQ02-DTC-SEL-FTRM  AND
                           ITD_LGON_FUNC    = :WQ02-LGON-FUNC     AND
                           ITD_ID_CLI       = :WQ01-ID-CLI-AUX    AND
                           ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                      AND  ITD_ID_NF        = :CC0001-NUMERO
                END-EXEC.
              

           EXEC SQL OPEN   CSR_SEL_795 
                END-EXEC. 
                
           EXEC SQL FETCH  CSR_SEL_795
                    INTO   :WQ03-ID-VOL,
                           :SF0002-ITD-FTR-EXP-LOG
                END-EXEC.

           EXEC SQL CLOSE  CSR_SEL_795
                END-EXEC.               

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - LOG. SYNC. - VOL ITD AGRP DATA: ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE SF0001-PTD-ID-PTC-DSP   TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.

           EXEC SQL SELECT SFT_ID_AGRP
                    INTO   :SF0005-SFT-ID-AGRP  :WI01-SFT-ID-AGRP
                    FROM   H1SF.SFT_SELECAO_FTRM
                    WHERE  SFT_CD_MERC_DST  = :WQ02-CD-MERC-DST   AND
                           SFT_DTC_SEL_FTRM = :WQ02-DTC-SEL-FTRM  AND
                           SFT_LGON_FUNC    = :WQ02-LGON-FUNC     AND
                           SFT_ID_CLI       = :WQ01-ID-CLI-AUX    AND
                           SFT_ID_VOL       = :WQ03-ID-VOL
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - LOG. SYNC. - AGRP. SELECAO  DATA: ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WQ02-DTC-SEL-FTRM       TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.               

           INSPECT SF0005-SFT-ID-AGRP        CONVERTING SPACES TO ZEROS.

           MOVE SF0005-SFT-ID-AGRP           TO ST80015-ID-AGRP.      

           MOVE SF0001-PTD-ID-PTC-DSP        TO ST80015-ID-PTC-DSP.      
           INSPECT SF0002-ITD-FTR-EXP-LOG    CONVERTING SPACES TO ZEROS.
           MOVE SF0002-ITD-FTR-EXP-LOG       TO ST80015-ID-FTR-EXP.      

           IF SF0001-PTD-CD-PGT-FRT  EQUAL  '1'
                MOVE 'R'                     TO ST80015-CD-PGT-FRT
           ELSE      
                MOVE 'D'                     TO ST80015-CD-PGT-FRT.

           MOVE SF0001-PTD-CD-TRSR           TO ST80015-CD-TRSR.      
 
           MOVE CC0005-RAZAO-SOCIAL-E        TO ST80015-NM-TRSR.      

           INSPECT SF0001-PTD-Q-TTL-VOL-LOG  CONVERTING SPACES TO ZEROS.
           MOVE SF0001-PTD-Q-TTL-VOL-LOG     TO ST80015-Q-VOL-PTC-DSP.      

           MOVE SF0001-PTD-PESO-TTL-LQD-LOG  TO 
                                               ST80015-V-TTL-PESO-LQD-R.      
           MOVE SF0001-PTD-PESO-TTL-EMB-LOG  TO 
                                               ST80015-V-TTL-PESO-EMB-R.      
           MOVE SF0001-PTD-PESO-TTL-BRT-LOG  TO 
                                               ST80015-V-TTL-PESO-BRT-R.      
           MOVE SF0001-PTD-V-TTL-MRCD-LOG    TO 
                                               ST80015-V-TTL-MRCD-DSP-R.      

           MOVE 'BPIS'                       TO ST80015-ID-LGON-FUNC.      

           IF WS36-FASE-FTRM  EQUAL  '1'  AND
              ST0001-CD-REGR-FTRM  NOT EQUAL  'N'
                MOVE SF0001-PTD-CD-T-REC     TO ACB50221-CHV-PRAD
                MOVE 167                     TO ACB50221-TAM-MSG
                MOVE ST8001-ST80015          TO ACB50221-TXT-MSG
                PERFORM 555-00-GRAVA-MENSAGEM-MQ.

       795-99-MONTA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 03/09 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       800-00-DESCARREGA-VIAS-DANFE          SECTION.
      *----------------------------------------------*

           MOVE '800-00-DESCARREGA-VIAS-DANFE' TO WS35-AUX-TS.

       800-10-ATUALIZA-CAMPOS.

           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.

           ADD 1                             TO WS01-ID-VIA.

           MOVE ZEROS                        TO WS32-IND-VIAS.

       800-20-GRAVA-LIN-DET.

           PERFORM 805-00-GRAVA-TAB-DANFE  UNTIL
                           WS32-IND-VIAS  EQUAL  WS32-IND-IMPR.

       800-99-DESCARREGA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 03/09 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       805-00-GRAVA-TAB-DANFE                SECTION.
      *----------------------------------------------*

           MOVE '805-00-GRAVA-TAB-DANFE'     TO WS35-AUX-TS.  
                
       805-10-SOMA-IND.

           ADD 1                             TO WS32-IND-VIAS.
           
       805-15-TESTA-BANDEJA.

           MOVE WS01-LIN-IMPR(WS32-IND-VIAS) TO WS01-PCL.
 
           MOVE WS01-PCL                     TO WQ01-TESTE-AUX.

       805-20-TESTA-PRIMEIRA-PAG.
 
           EXEC SQL SELECT 1
                    FROM   DUAL
                   WHERE   :WQ01-TESTE-AUX  LIKE  '%&f4005y2x%'
                     AND   ROWNUM = 1 
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                          TO 805-20-TESTA-SEGUNDA-PAG.

           IF CC0001-NFE-CONTINGENCIA  EQUAL  'S'  OR
              CC0001-NFE-COD-SITUACAO  EQUAL  'SYN027'
                MOVE 2                      TO WS01-QTDE-VIA-DANFE
           ELSE
                IF WS36-CD-MERC-DST  EQUAL  'D'  AND
                   WS36-FASE-FTRM  EQUAL  '2'
                     MOVE 2                 TO WS01-QTDE-VIA-DANFE
                ELSE
                     MOVE 1                 TO WS01-QTDE-VIA-DANFE
                END-IF.

           IF (CC0001-NFE-CONTINGENCIA  EQUAL  'S'  OR
               CC0001-NFE-COD-SITUACAO  EQUAL  'SYN027')  AND
              (WS01-ID-VIA  EQUAL  1  OR
               WS01-ID-VIA  EQUAL  2)
                MOVE 'E&l0S&l9H&f4005y2x&u600D*p0x0Y'
                                              TO WS01-PCL
           ELSE
                MOVE 'E&l0S&l1H&f4005y2x&u600D*p0x0Y'
                                              TO WS01-PCL.

      *    IF WS01-ID-VIA  EQUAL  1
      *         IF CC0001-NFE-CONTINGENCIA  EQUAL  'S'
      *              MOVE 'E&l0S&l20H&f4005y2x&u600D*p0x0Y'
      *                                      TO WS01-PCL
      *         ELSE
      *              MOVE 'E&l0S&l1H&f4005y2x&u600D*p0x0Y'
      *                                      TO WS01-PCL
      *         END-IF
      *    ELSE
      *    IF WS01-ID-VIA  EQUAL  2
      *         IF CC0001-NFE-CONTINGENCIA  EQUAL  'S'
      *              MOVE 'E&l0S&l20H&f4005y2x&u600D*p0x0Y'
      *                                      TO WS01-PCL
      *         ELSE
      *              MOVE 'E&l0S&l1H&f4005y2x&u600D*p0x0Y'
      *                                      TO WS01-PCL
      *         END-IF
      *    ELSE
      *    IF WS01-ID-VIA  EQUAL  3
      *         MOVE 'E&l0S&l1H&f4005y2x&u600D*p0x0Y'
      *                                      TO WS01-PCL
      *    ELSE
      *         MOVE 'E&l0S&l1H&f4005y2x&u600D*p0x0Y'
      *                                      TO WS01-PCL.

           MOVE WS01-PCL                     TO WS01-LIN-IMPR
                                                (WS32-IND-VIAS).
 
           GO                                TO 805-60-GRAVA-LIN-DET.

       805-20-TESTA-SEGUNDA-PAG.
 
           EXEC SQL SELECT 1
                    FROM   DUAL
                   WHERE   :WQ01-TESTE-AUX  LIKE  '%&f4007y2x%'
                     AND   ROWNUM = 1 
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                           TO 805-40-TESTA-VIAS-NUM.

           IF CC0001-NFE-CONTINGENCIA  EQUAL  'S'  OR
              CC0001-NFE-COD-SITUACAO  EQUAL  'SYN027'
                MOVE 2                       TO WS01-QTDE-VIA-DANFE
           ELSE
                IF WS36-CD-MERC-DST  EQUAL  'D'  AND
                   WS36-FASE-FTRM  EQUAL  '2'
                     MOVE 2                  TO WS01-QTDE-VIA-DANFE
                ELSE
                     MOVE 1                  TO WS01-QTDE-VIA-DANFE
                END-IF.

           IF (CC0001-NFE-CONTINGENCIA  EQUAL  'S'  OR
               CC0001-NFE-COD-SITUACAO  EQUAL  'SYN027')  AND
              (WS01-ID-VIA  EQUAL  1  OR
               WS01-ID-VIA  EQUAL  2)
                MOVE 'E&l9H&f4007y2x&u600D*p0x0Y'
                                              TO WS01-PCL
           ELSE
                MOVE 'E&l1H&f4007y2x&u600D*p0x0Y'
                                              TO WS01-PCL.

      *    IF WS01-ID-VIA  EQUAL  1
      *         IF CC0001-NFE-CONTINGENCIA  EQUAL  'S'
      *              MOVE 'E&l20H&f4007y2x&u600D*p0x0Y'
      *                                      TO WS01-PCL
      *         ELSE
      *              MOVE 'E&l1H&f4007y2x&u600D*p0x0Y'
      *                                      TO WS01-PCL
      *         END-IF
      *    ELSE
      *    IF WS01-ID-VIA  EQUAL  2
      *         IF CC0001-NFE-CONTINGENCIA  EQUAL  'S'
      *              MOVE 'E&l20H&f4007y2x&u600D*p0x0Y'
      *                                      TO WS01-PCL
      *         ELSE
      *              MOVE 'E&l1H&f4007y2x&u600D*p0x0Y'
      *                                      TO WS01-PCL
      *         END-IF
      *    ELSE
      *    IF WS01-ID-VIA  EQUAL  3
      *         MOVE 'E&l1H&f4007y2x&u600D*p0x0Y'
      *                                      TO WS01-PCL
      *    ELSE
      *         MOVE 'E&l1H&f4007y2x&u600D*p0x0Y'
      *                                      TO WS01-PCL.

           MOVE WS01-PCL                     TO WS01-LIN-IMPR
                                                (WS32-IND-VIAS).
 
           GO                                TO 805-60-GRAVA-LIN-DET.

       805-40-TESTA-VIAS-NUM.

           MOVE WS01-LIN-IMPR(WS32-IND-VIAS) TO WS01-PCL.
 
           IF NOT (WS01-PCL-DADOS  =  '1a Via'  OR
                                   =  '2a Via'  OR
                                   =  '3a Via')
                GO                           TO 805-50-TESTA-VIAS-DEST.

           IF WS01-ID-VIA  EQUAL  1
                MOVE '1a Via'                  TO WS01-PCL-DADOS
           ELSE
           IF WS01-ID-VIA  EQUAL  2
                MOVE '2a Via'                  TO WS01-PCL-DADOS
           ELSE
           IF WS01-ID-VIA  EQUAL  3
                MOVE '3a Via'                  TO WS01-PCL-DADOS
           ELSE
                MOVE '4a Via'                  TO WS01-PCL-DADOS.

           MOVE WS01-PCL                     TO WS01-LIN-IMPR
                                                (WS32-IND-VIAS).
 
           GO                                TO 805-60-GRAVA-LIN-DET.

       805-50-TESTA-VIAS-DEST.

           MOVE WS01-LIN-IMPR(WS32-IND-VIAS) TO WS01-PCL.
 
           IF NOT (WS01-PCL-DADOS  =  'Destinatario'    OR
                                   =  'Arquivo Fiscal'  OR
                                   =  'Fisco Destino')
                GO                           TO 805-60-GRAVA-LIN-DET.

           IF WS01-ID-VIA  EQUAL  1
                MOVE 'Destinatario'          TO WS01-PCL-DADOS
           ELSE
           IF WS01-ID-VIA  EQUAL  2
                MOVE 'Arquivo Fiscal'        TO WS01-PCL-DADOS
           ELSE
           IF WS01-ID-VIA  EQUAL  3
                MOVE 'Fisco Destino'         TO WS01-PCL-DADOS
           ELSE
                MOVE 'Fisco Origem'          TO WS01-PCL-DADOS.

           MOVE WS01-PCL                     TO WS01-LIN-IMPR
                                                (WS32-IND-VIAS).
 
       805-60-GRAVA-LIN-DET.

           PERFORM 170-00-DEFINE-VIAS-ORDENACAO.

           IF WS01-ID-VIA  EQUAL  2
                IF WS36-CD-MERC-DST  EQUAL  'D'  AND
                   WS36-FASE-FTRM  EQUAL  '2'
                     MOVE '97'               TO WS01-CD-SQN-PJL-NF
                ELSE
                     MOVE '99'               TO WS01-CD-SQN-PJL-NF
                END-IF
           ELSE
           IF WS01-ID-VIA  EQUAL  3
                MOVE '99'                    TO WS01-CD-SQN-PJL-NF
           END-IF.

           MOVE WS01-CD-SQN-PJL-NF           TO CB0002-DRE-CD-SQN-PJL.

           MOVE WS01-LIN-IMPR(WS32-IND-VIAS) TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       805-99-GRAVA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 10/00 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       810-00-DESCARREGA-VIAS-PTD            SECTION.
      *----------------------------------------------*

           MOVE '810-00-DESCARREGA-VIAS-PTD' TO WS35-AUX-TS.

           IF WS01-NUM-VIAS-PTD  EQUAL  3  AND
              WS36-CD-MERC-DST  EQUAL  'D'  AND
              WS36-FASE-FTRM  EQUAL  '2'
                MOVE '96'                    TO CB0002-DRE-CD-SQN-PJL
           ELSE
                ADD 1                        TO WS01-CD-SQN-PJL-PTD-N.
                MOVE WS01-CD-SQN-PJL-PTD     TO CB0002-DRE-CD-SQN-PJL.
                SUBTRACT 1                   FROM WS01-CD-SQN-PJL-PTD-N.

       810-10-ATUALIZA-CAMPOS.

           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.

           ADD 1                             TO WS01-NUM-VIAS-PTD.

           MOVE ZEROS                        TO WS32-IND-VIAS.

       810-20-GRAVA-LIN-DET.

           PERFORM 815-00-GRAVA-TAB-PTD  UNTIL
                          WS32-IND-VIAS  EQUAL  WS32-IND-IMPR.

       810-99-DESCARREGA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 10/00 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       815-00-GRAVA-TAB-PTD                  SECTION.
      *----------------------------------------------*

           MOVE '815-00-GRAVA-TAB-PTD'       TO WS35-AUX-TS. 

       815-10-SOMA-IND.

           ADD 1                             TO WS32-IND-VIAS.

       815-40-GRAVA-LIN-DET.

           IF WS01-NUM-VIAS-PTD  EQUAL  1
                MOVE WS01-CD-SQN-PJL-PTD     TO CB0002-DRE-CD-SQN-PJL
           ELSE
           IF WS01-NUM-VIAS-PTD  EQUAL  3  AND
              WS36-CD-MERC-DST  EQUAL  'D'  AND
              WS36-FASE-FTRM  EQUAL  '2'
                MOVE '96'                    TO CB0002-DRE-CD-SQN-PJL
           ELSE
                ADD 1                        TO WS01-CD-SQN-PJL-PTD-N
                MOVE WS01-CD-SQN-PJL-PTD     TO CB0002-DRE-CD-SQN-PJL
                SUBTRACT 1                   FROM WS01-CD-SQN-PJL-PTD-N
           END-IF.

           MOVE WS01-LIN-IMPR(WS32-IND-VIAS) TO WS01-LINHA-IMPR-AUX.

           PERFORM 545-00-GRAVA-DETALHE-REL.

       815-99-GRAVA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 06/06 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       820-00-DESCARREGA-VIAS-PCK-LST        SECTION.
      *----------------------------------------------*

           MOVE '820-00-DESCARREGA-VIAS-PCK-LST'
                                             TO WS35-AUX-TS.

       820-10-ATUALIZA-CAMPOS.

           MOVE 'N'                          TO WS31-CHV-CARREGA-TAB.

           ADD 1                             TO WS01-NUM-VIAS-VOL.

           MOVE ZEROS                        TO WS32-IND-VIAS.
           
       820-20-GRAVA-LIN-DET.

           PERFORM 825-00-GRAVA-TAB-PCK-LST  UNTIL
                          WS32-IND-VIAS  EQUAL  WS32-IND-IMPR.

       820-99-DESCARREGA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 06/06 *
      *                                                                *
      *  PREPARACAO.                                                   *  
      *----------------------------------------------------------------*
      
       825-00-GRAVA-TAB-PCK-LST              SECTION.
      *----------------------------------------------*

           MOVE '825-00-GRAVA-TAB-PCK-LST'   TO WS35-AUX-TS.  

       825-10-SOMA-IND.

           ADD 1                             TO WS32-IND-VIAS.
           
       825-40-GRAVA-LIN-DET.

           IF WS01-NUM-VIAS-VOL  EQUAL  1
                MOVE 1                       TO WS01-IND-PJL-PKLST-AUX
           ELSE
           IF WS01-NUM-VIAS-VOL  EQUAL  2
                IF WS36-CD-MERC-DST  EQUAL  'E'  AND
                   (SF0002-ITD-CD-MOD-TRSP  EQUAL  '1'  OR
                    SF0002-ITD-CD-MOD-TRSP  EQUAL  '2'  OR
                    SF0002-ITD-CD-MOD-TRSP  EQUAL  '3')
                     MOVE 21                 TO WS01-IND-PJL-PKLST-AUX
                ELSE
                     MOVE 3                  TO WS01-IND-PJL-PKLST-AUX
                END-IF
           ELSE
           IF WS01-NUM-VIAS-VOL  EQUAL  3
                MOVE 5                       TO WS01-IND-PJL-PKLST-AUX
           ELSE
                MOVE 7                       TO WS01-IND-PJL-PKLST-AUX.

           ADD WS01-IND-PJL-PKLST-AUX        TO WS01-CD-SQN-PJL-PKLST-N.
           MOVE WS01-CD-SQN-PJL-PKLST        TO CB0002-DRE-CD-SQN-PJL.


           SUBTRACT WS01-IND-PJL-PKLST-AUX   FROM
                                                WS01-CD-SQN-PJL-PKLST-N.

           MOVE WS01-LIN-IMPR(WS32-IND-VIAS) TO WS01-LINHA-IMPR-AUX.

           PERFORM 545-00-GRAVA-DETALHE-REL.

       825-99-GRAVA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               COC 05/11 *
      *                                                                *
      *  INTERFACE PARA SAP - DADOS DA FATURA DE EXPORTACAO.           *
      *----------------------------------------------------------------*

       830-00-INTERFACE-SAP-DADOS-EXP        SECTION.
      *----------------------------------------------*

           MOVE '830-00-INTERFACE-SAP-DADOS-EXP'
                                             TO  WS35-AUX-TS.

           EXEC SQL SELECT  FTE_CD_T_DE
                    INTO    :SF0018-FTE-CD-T-DE    :WI01-FTE-CD-T-DE
                    FROM    H1SF.FTE_FATURAS_TRSP_EXP
                    WHERE   FTE_FTR_EXP = :SF0002-ITD-FTR-EXP
                END-EXEC.

      ******************************************************************
      ******************************************************************
      ******************************************************************
      *  INCLUIR A INSTRUCAO GO TO ABAIXO PARA NAO ENVIAR INTERFACE    *
      *  SAP CONTAS A RECEBER SEM A ATUALIZACAO DO DUE                 *
      *  SICRONIZAR ALTERACAO COM PROGRAMA H1SF0037 ROTINA             *
      *  140-00-FINALIZA-FASE-FTRM                                     *
      ******************************************************************
      ******************************************************************
      ******************************************************************
      *    IF SF0018-FTE-CD-T-DE  EQUAL  'DUE'
      *         GO                           TO 830-99-INTERFACE-EXIT.
           
           MOVE '10'                         TO WX03-CD-ACES.
           MOVE ZEROS                        TO WX03-CD-RETR-ECI
                                                WX03-CD-RETR-ACES.
           MOVE SF0002-ITD-FTR-EXP           TO WX03-FTR-EXP.
           
           INSPECT WX03-FTR-EXP              CONVERTING SPACES TO ZEROS.
                
           PERFORM 582-00-EMITE-LINK-H1SF5049.

           IF WX03-CD-RETR-ECI  NOT EQUAL  ZEROS  OR
              WX03-CD-RETR-ACES NOT EQUAL  ZEROS
                MOVE '*** ERRO - GRAVACAO INTERFACE SAP: ==>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WX03-CD-ACES            TO WS35-CD-ACES-ERRO
                MOVE WX03-CD-RETR-ECI        TO WS35-CD-ERRO-ECI
                MOVE WX03-CD-RETR-ACES       TO WS35-CD-ERRO-ACES
                MOVE SF0002-ITD-FTR-EXP      TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF5049'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.   

      *    EXEC SQL SELECT  E.SUP_CD_FORN_SPR,
      *                     B.SHT_CD_CLI,
      *                     B.SHT_NM_CLI,
      *                     B.SHT_END_CLI,
      *                     B.SHT_CID_CLI,
      *                     B.SHT_UF_CLI,
      *                     REPLACE(B.SHT_CD_CEP,'-',''),
      *                     B.SHT_PAIS_CLI,
      *                     B.SHT_CD_FBR,
      *                     B.SHT_CD_VAT,
      *                     B.SHT_ID_VAT,
      *                     C.CON_CD_CSG,
      *                     C.CON_NM_CSG,
      *                     C.CON_END_CSG,
      *                     C.CON_CID_CSG,
      *                     C.CON_UF_CSG,
      *                     REPLACE(C.CON_CD_CEP,'-',''),
      *                     C.CON_PAIS_CSG,
      *                     C.CON_CD_FBR,
      *                     C.CON_CD_VAT,
      *                     C.CON_ID_VAT,
      *                     D.IMP_CD_IMPT,
      *                     D.IMP_NM_IMPT,
      *                     D.IMP_END_IMPT,
      *                     D.IMP_CID_IMPT,
      *                     D.IMP_UF_IMPT,
      *                     REPLACE(D.IMP_CD_CEP,'-',''),
      *                     D.IMP_SL_PAIS,
      *                     D.IMP_T_MERC_DST,
      *                     D.IMP_CD_FBR,
      *                     D.IMP_CD_VAT,
      *                     D.IMP_ID_VAT,
      *                     REPLACE(A.FTE_ID_DE,'-',''),
      *                     A.FTE_CD_TRM_PGT,
      *                     A.FTE_DTC_SD_FBR,
      *                     DECODE(A.FTE_CD_MOD_TRSP,'A','A',
      *                                                 'M','S','R','T')
      *             INTO    :SF0019-SUP-CD-FORN-SPR,
      *                     :SF0013-SHT-CD-CLI,
      *                     :SF0013-SHT-NM-CLI,   
      *                     :SF0013-SHT-END-CLI    :WI01-SHT-END-CLI,
      *                     :SF0013-SHT-CID-CLI    :WI01-SHT-CID-CLI,
      *                     :SF0013-SHT-UF-CLI     :WI01-SHT-UF-CLI,
      *                     :SF0013-SHT-CD-CEP     :WI01-SHT-CD-CEP,
      *                     :SF0013-SHT-PAIS-CLI   :WI01-SHT-PAIS-CLI,
      *                     :SF0013-SHT-CD-FBR     :WI01-SHT-CD-FBR,
      *                     :SF0013-SHT-CD-VAT     :WI01-SHT-CD-VAT,
      *                     :SF0013-SHT-ID-VAT     :WI01-SHT-ID-VAT,
      *                     :SF0014-CON-CD-CSG,
      *                     :SF0014-CON-NM-CSG,
      *                     :SF0014-CON-END-CSG    :WI01-CON-END-CSG,
      *                     :SF0014-CON-CID-CSG    :WI01-CON-CID-CSG,
      *                     :SF0014-CON-UF-CSG     :WI01-CON-UF-CSG,
      *                     :SF0014-CON-CD-CEP     :WI01-CON-CD-CEP,
      *                     :SF0014-CON-PAIS-CSG   :WI01-CON-PAIS-CSG,
      *                     :SF0014-CON-CD-FBR     :WI01-CON-CD-FBR,
      *                     :SF0014-CON-CD-VAT     :WI01-CON-CD-VAT,
      *                     :SF0014-CON-ID-VAT     :WI01-CON-ID-VAT,
      *                     :SF0012-IMP-CD-IMPT,
      *                     :SF0012-IMP-NM-IMPT,
      *                     :SF0012-IMP-END-IMPT,
      *                     :SF0012-IMP-CID-IMPT,
      *                     :SF0012-IMP-UF-IMPT    :WI01-IMP-UF-IMPT,
      *                     :SF0012-IMP-CD-CEP     :WI01-IMP-CD-CEP,
      *                     :SF0012-IMP-SL-PAIS,
      *                     :SF0012-IMP-T-MERC-DST :WI01-IMP-T-MERC-DST,
      *                     :SF0012-IMP-CD-FBR     :WI01-IMP-CD-FBR,
      *                     :SF0012-IMP-CD-VAT     :WI01-IMP-CD-VAT,
      *                     :SF0012-IMP-ID-VAT     :WI01-IMP-ID-VAT,
      *                     :SF0018-FTE-ID-DE      :WI01-FTE-ID-DE,
      *                     :SF0018-FTE-CD-TRM-PGT :WI01-FTE-CD-TRM-PGT,
      *                     :SF0018-FTE-DTC-SD-FBR :WI01-FTE-DTC-SD-FBR,
      *                     :SF0018-FTE-CD-MOD-TRSP
      *             FROM    H1SF.FTE_FATURAS_TRSP_EXP A,
      *                     H1SF.SHT_SHIP_TO B,
      *                     H1SF.CON_CONSIGNATARIO C,
      *                     H1SF.IMP_IMPORTADOR D,
      *                     H1SF.SUP_FORNECEDOR E
      *             WHERE   A.FTE_CD_CLI  = B.SHT_CD_CLI
      *             AND     A.FTE_CD_CSG  = C.CON_CD_CSG
      *             AND     A.FTE_CD_IMPT = D.IMP_CD_IMPT
      *             AND     DECODE(SUBSTR(LTRIM(TO_CHAR(
      *                            A.FTE_FTR_EXP,'0000000')),1,1),
      *                            '5','Y309','4','Y305','2','Y304',
      *                            '1','Y303','0','Y305') 
      *                                   = E.SUP_CD_FNT_ATND
      *             AND     A.FTE_FTR_EXP = :SF0002-ITD-FTR-EXP
      *         END-EXEC.
      *
      *    IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
      *         MOVE '*** ERRO - DADOS DA FAT. EXP. NAO ENCONTRADO ===>'
      *                                      TO WS35-MSG-ERRO-LIT
      *         MOVE SPACES                  TO WS35-MSG-ERRO-VAR
      *         MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
      *         MOVE 'H1SF0033'              TO WS35-ID-PGM
      *         PERFORM 900-00-REGISTRA-ERRO-TRNS.               
      *
      *    EXEC SQL SELECT TO_CHAR(SYSDATE,'DDMMYYYY')
      *             INTO   :WQ01-SYSDATE-8
      *             FROM   DUAL
      *             WHERE  ROWNUM = 1
      *         END-EXEC.
      *
      *    MOVE SPACES                       TO ST8001-ST8001D.
      *
      *    MOVE '23'                         TO ST8001D-CD-ACES.
      *    MOVE 'UN'                         TO ST8001D-CD-FBR.
      *    MOVE SF0018-FTE-CD-MOD-TRSP       TO ST8001D-CD-MOD-TRSP.
      *    MOVE SF0002-ITD-FTR-EXP           TO ST8001D-ID-FTR-EXP.
      *    MOVE SF0018-FTE-ID-DE             TO ST8001D-ID-RE.
      *    MOVE SF0019-SUP-CD-FORN-SPR       TO ST8001D-ID-FRN-SPR.
      *    MOVE 'SE'                         TO ST8001D-CD-IDT-CBCL.
      *    MOVE CC0008-RAZAO-SOCIAL-E        TO ST8001D-NM-CBCL.
      *    MOVE 'E8143P0'                    TO ST8001D-CD-ENTD-CBCL.
      *    MOVE CC0008-ENDERECO-EI           TO ST8001D-ID-END-CBCL.
      *    MOVE CC0008-MUN-NOME-UF-E         TO ST8001D-ID-CID-CBCL.
      *    MOVE CC0008-UF-E                  TO ST8001D-CD-UF-CBCL.
      *    MOVE CC0008-CEP-E                 TO ST8001D-ID-CEP-CBCL.
      *    MOVE 'BR'                         TO ST8001D-CD-PAIS-CBCL.
      *    MOVE SPACES                       TO ST8001D-CD-VAT-CBCL.
      *    MOVE SPACES                       TO ST8001D-ID-VAT-CBCL.
      *    MOVE 'UN'                         TO ST8001D-CD-FBR-CBCL.
      *    MOVE 'ST'                         TO ST8001D-CD-IDT-CLI.
      *    MOVE SF0013-SHT-NM-CLI            TO ST8001D-NM-CLI.
      *    MOVE SF0013-SHT-CD-CLI            TO ST8001D-CD-ENTD-CLI.
      *    MOVE SF0013-SHT-END-CLI           TO ST8001D-ID-END-CLI.
      *    MOVE SF0013-SHT-CID-CLI           TO ST8001D-ID-CID-CLI.
      *    MOVE SF0013-SHT-UF-CLI            TO ST8001D-CD-UF-CLI.
      *    MOVE SF0013-SHT-CD-CEP            TO ST8001D-ID-CEP-CLI.
      *    MOVE SF0013-SHT-PAIS-CLI          TO ST8001D-CD-PAIS-CLI.
      *    MOVE SF0013-SHT-CD-VAT            TO ST8001D-CD-VAT-CLI.
      *    MOVE SF0013-SHT-ID-VAT            TO ST8001D-ID-VAT-CLI.
      *    MOVE SF0013-SHT-CD-FBR            TO ST8001D-CD-FBR-CLI.
      *    MOVE 'BY'                         TO ST8001D-CD-IDT-CSG.
      *    MOVE SF0014-CON-NM-CSG            TO ST8001D-NM-CSG.
      *    MOVE SF0014-CON-CD-CSG            TO ST8001D-CD-ENTD-CSG.
      *    MOVE SF0014-CON-END-CSG           TO ST8001D-ID-END-CSG.
      *    MOVE SF0014-CON-CID-CSG           TO ST8001D-ID-CID-CSG.
      *    MOVE SF0014-CON-UF-CSG            TO ST8001D-CD-UF-CSG.
      *    MOVE SF0014-CON-CD-CEP            TO ST8001D-ID-CEP-CSG.
      *    MOVE SF0014-CON-PAIS-CSG          TO ST8001D-CD-PAIS-CSG.
      *    MOVE SF0014-CON-CD-VAT            TO ST8001D-CD-VAT-CSG.
      *    MOVE SF0014-CON-ID-VAT            TO ST8001D-ID-VAT-CSG.
      *    MOVE SF0014-CON-CD-FBR            TO ST8001D-CD-FBR-CSG.
      *    MOVE 'IC'                         TO ST8001D-CD-IDT-ENTD.
      *    MOVE SF0012-IMP-NM-IMPT           TO ST8001D-NM-IMPT.
      *    MOVE SF0012-IMP-CD-IMPT           TO ST8001D-CD-ENTD-IMPT.
      *    MOVE SF0012-IMP-END-IMPT          TO ST8001D-ID-END-IMPT.
      *    MOVE SF0012-IMP-CID-IMPT          TO ST8001D-ID-CID-IMPT.
      *    MOVE SF0012-IMP-UF-IMPT           TO ST8001D-CD-UF-IMPT.
      *    MOVE SF0012-IMP-CD-CEP            TO ST8001D-ID-CEP-IMPT.
      *    MOVE SF0012-IMP-SL-PAIS           TO ST8001D-CD-PAIS-IMPT.
      *    MOVE SF0012-IMP-CD-VAT            TO ST8001D-CD-VAT-IMPT.
      *    MOVE SF0012-IMP-ID-VAT            TO ST8001D-ID-VAT-IMPT.
      *    MOVE SF0012-IMP-CD-FBR            TO ST8001D-CD-FBR-IMPT.
      *    MOVE SF0018-FTE-CD-TRM-PGT        TO ST8001D-CD-TRM-PGT.
      *    MOVE SF0018-FTE-DTC-SD-FBR        TO ST8001D-DTC-SD-FBR.
      *    MOVE WQ01-SYSDATE-8               TO ST0001D-DTC-GRC.
      *
      *    MOVE '01'                         TO ACB5022-CD-ACES.
      *    MOVE ZEROS                        TO ACB5022-CD-RETR-ECI
      *                                         ACB5022-CD-RETR-ACES.
      *    MOVE '03'                         TO ACB50221-CD-ACES-MQ.
      *    MOVE 00005                        TO ACB50221-ID-FILA-MQ.
      *    MOVE ZEROS                        TO ACB50221-CD-RETR-MQ 
      *                                         ACB50221-CD-COMP
      *                                         ACB50221-CD-RSON.
      *    MOVE SPACES                       TO ACB50221-ID-MSG-PRC.
      *
      *    MOVE 'RES-DANFE'                  TO ACB50221-CHV-PRAD.
      *    MOVE 851                          TO ACB50221-TAM-MSG.
      *    MOVE ST8001-ST8001D               TO ACB50221-TXT-MSG.
      *    PERFORM 555-00-GRAVA-MENSAGEM-MQ.

       830-99-INTERFACE-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *               === ROTINA DE ACESSO ===               ACA 05/03 *
      *                                                                *
      *  EFETUA SQL PARA GERAR LANCAMENTOS CONTABEIS.                  *
      *----------------------------------------------------------------*

       840-00-GERA-LANCAMENTOS-CT            SECTION.
      *----------------------------------------------*

           MOVE '840-00-GERA-LANCAMENTOS-CT' TO  WS35-AUX-TS.

       840-10-MOVE-ICMS.

           EXEC SQL SELECT TO_CHAR(:CC0001-VL-TOTAL-ICMS-LOG,
                                   '9999999999V99')
                    INTO   :SF0007-CTB-V-LCTO-CTB
                    FROM   DUAL
                   WHERE   ROWNUM = 1 
                END-EXEC.

           MOVE 'ICMS'                       TO SF0007-CTB-DS-CT.

           MOVE 'C'                          TO SF0007-CTB-CD-T-CT.
           MOVE WQ01-CT-ICM-CR               TO SF0007-CTB-ID-CT.

           PERFORM 542-00-GRAVA-LANCAMENTOS-CT.

           MOVE 'D'                          TO SF0007-CTB-CD-T-CT.
           MOVE WQ01-CT-ICM-DEB              TO SF0007-CTB-ID-CT.

           PERFORM 542-00-GRAVA-LANCAMENTOS-CT.

       840-20-MOVE-IPI.

           EXEC SQL SELECT TO_CHAR(:CC0001-VL-TOTAL-IPI-LOG,
                                   '9999999999V99')
                    INTO   :SF0007-CTB-V-LCTO-CTB
                    FROM   DUAL
                   WHERE   ROWNUM = 1 
                END-EXEC.

           MOVE 'IPI'                        TO SF0007-CTB-DS-CT.

           MOVE 'C'                          TO SF0007-CTB-CD-T-CT.
           MOVE WQ01-CT-IPI-CR               TO SF0007-CTB-ID-CT.

           PERFORM 542-00-GRAVA-LANCAMENTOS-CT.

           MOVE 'D'                          TO SF0007-CTB-CD-T-CT.
           MOVE WQ01-CT-IPI-DEB              TO SF0007-CTB-ID-CT.

           PERFORM 542-00-GRAVA-LANCAMENTOS-CT.

       840-99-GERA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 10/03 *
      *                                                                *
      *  CONTABILIZACAO DO DANFE - ITEM.                               *
      *----------------------------------------------------------------*
      
       845-00-CONTABILIZA-ITEM               SECTION.
      *----------------------------------------------*

           MOVE '845-00-CONTABILIZA-ITEM'    TO WS35-AUX-TS.

       845-10-RECUPERA-ITEM-RCBM.

           PERFORM 532-00-RECUPERA-ITEM-RCBM.

       845-20-CARREGA-CAMPOS.

           MOVE '01'                         TO ACB5022-CD-ACES.
           MOVE ZEROS                        TO ACB5022-CD-RETR-ECI
                                                ACB5022-CD-RETR-ACES.
           MOVE '03'                         TO ACB50221-CD-ACES-MQ.
           MOVE 00013                        TO ACB50221-ID-FILA-MQ.
           MOVE ZEROS                        TO ACB50221-CD-RETR-MQ 
                                                ACB50221-CD-COMP
                                                ACB50221-CD-RSON.
           MOVE SPACES                       TO ACB50221-ID-MSG-PRC
                                                ACB50221-ID-MSG-AUX.

           MOVE SPACES                       TO RRBMQ008-ITEM-NF.    

           MOVE SF0002-ITD-DTC-SEL-FTRM      TO WS35-ID-CORR-ID-LIT-SC.
           MOVE CC0001-NUMERO-CTB-5          TO WS35-ID-CORR-ID-ALF-SC.
           INSPECT WS35-ID-CORREL-ID         CONVERTING SPACES TO ZEROS.
           MOVE WS35-ID-CORREL-ID            TO ACB50221-ID-MSG-AUX.

           MOVE CC0001-DH-EMISSAO-I-SEC      TO WS01-CD-RR-CTB-SEC.    
           MOVE 'D6'                         TO WS01-CD-RR-CTB-LIT.    
           MOVE CC0001-NUMERO-CTB            TO WS01-CD-RR-CTB-NF.    
           MOVE WS01-CD-RR-CTB               TO RRBMQ008-CD-RR.

           MOVE 'NFD'                        TO RRBMQ008-CD-T-NF.
           MOVE CC0001-NUMERO-CTB-6          TO RRBMQ008-CD-NF.
           MOVE SR0003-ID-FRN                TO RRBMQ008-CD-FRN.

           MOVE CC0004-CPF-CGC               TO WS01-CGC-EMIF-ORIG.
           MOVE WS01-CGC-EMIF-O-1            TO WS01-CGC-EMIF-D-1.
           MOVE WS01-CGC-EMIF-O-2            TO WS01-CGC-EMIF-D-2.
           MOVE WS01-CGC-EMIF-O-3            TO WS01-CGC-EMIF-D-3.
           MOVE WS01-CGC-EMIF-O-4            TO WS01-CGC-EMIF-D-4.
           MOVE WS01-CGC-EMIF-O-5            TO WS01-CGC-EMIF-D-5.
           MOVE WS01-CGC-EMIF-DEST           TO RRBMQ008-CD-CGC-CPF.

           MOVE CC0002-IDF-NUM               TO RRBMQ008-CD-SQN-NF.
           MOVE SPACES                       TO RRBMQ008-CD-PDD.
           MOVE SF0002-ITD-ID-PECA-LOG       TO RRBMQ008-CD-PECA.
           MOVE SPACES                       TO RRBMQ008-CD-MAT.
           MOVE SPACES                       TO RRBMQ008-CD-TRFC-NUM.
           MOVE SPACES                       TO RRBMQ008-CD-STA-TRBT.
           MOVE CC0002-NBM-CODIGO            TO RRBMQ008-CD-NCM.
           MOVE CC0002-ALIQ-IPI-LOG          TO RRBMQ008-PERC-IPI.
           MOVE CC0002-ALIQ-ICMS-LOG         TO RRBMQ008-PERC-ICMS.
           MOVE ZEROS                        TO RRBMQ008-PERC-TRBT-ICMS.
           MOVE '1'                          TO RRBMQ008-CD-FNT.
           MOVE WQ01-NOP-CODIGO-AUX          TO RRBMQ008-CD-T-OPRC.
           MOVE '2'                          TO RRBMQ008-CD-OPRC.
           MOVE WQ01-NOP-CODIGO-AUX          TO RRBMQ008-CD-NOP.
           MOVE CC0002-CFOP-CODIGO           TO RRBMQ008-CD-CFOP.
           MOVE CT0001-CD-AUX-ICM            TO RRBMQ008-CD-AUX(1:1).
           MOVE CT0001-CD-AUX-IPI            TO RRBMQ008-CD-AUX(2:1).
           MOVE 'SF'                         TO RRBMQ008-CD-RQS.
           MOVE 'SF'                         TO RRBMQ008-CD-CPRR.
           MOVE SPACES                       TO RRBMQ008-CD-RSF.
           MOVE 'UM'                         TO RRBMQ008-CD-UND-MDA.
           MOVE SPACES                       TO RRBMQ008-CD-UMC.
           MOVE SF0002-ITD-Q-PECA-FTRD-CTB   TO RRBMQ008-QT-FTRD
                                                RRBMQ008-QT-FTRD-CVT
                                                RRBMQ008-QT-RCBD.

           MOVE WS01-PESO-BRT-EMIF-NUM-R     TO WS01-PESO-CTB-PESO.
           MOVE WS01-PESO-CTB                TO RRBMQ008-VL-PESO-LQD
                                                RRBMQ008-VL-PESO-BRT.

           MOVE CC0002-PRECO-UNITARIO-CTB    TO RRBMQ008-V-PREC-UNT.
           MOVE CC0002-PRECO-TOTAL-CTB-1     TO RRBMQ008-V-PREC-TTL.
           MOVE CC0002-VL-BASE-IPI           TO RRBMQ008-V-BS-IPI.
           MOVE CC0002-VL-BASE-ICMS          TO RRBMQ008-V-BS-ICMS.
           MOVE CC0002-VL-TRIBUTAVEL-STF     TO RRBMQ008-V-BS-ICMS-SBSC.
           MOVE CC0002-VL-IPI-CTB            TO RRBMQ008-V-IPI.
           MOVE CC0002-VL-ICMS-CTB           TO RRBMQ008-V-ICMS.
           MOVE CC0002-VL-STF-CTB            TO RRBMQ008-V-ICMS-SBSC.
           MOVE CC0002-PRECO-TOTAL-CTB-2     TO RRBMQ008-V-TTL-PRD.
           MOVE CC0002-NBM-CODIGO            TO RRBMQ008-CD-NCM-PDD.
           MOVE CC0002-ALIQ-IPI-CTB          TO RRBMQ008-PERC-IPI-PDD.
           MOVE CC0002-PRECO-UNITARIO-CTB    TO RRBMQ008-V-PREC-UNT-PDD.
           MOVE SPACES                       TO RRBMQ008-CD-NCM-COR.
           MOVE ZEROS                        TO RRBMQ008-PERC-IPI-COR.
           MOVE ZEROS                        TO RRBMQ008-PERC-ICMS-COR.
           MOVE ZEROS                        TO RRBMQ008-QT-COR.
           MOVE ZEROS                        TO RRBMQ008-QT-DVL.
           MOVE ZEROS                        TO RRBMQ008-V-PREC-UNT-COR.
           MOVE ZEROS                        TO RRBMQ008-V-IPI-COR.
           MOVE ZEROS                        TO RRBMQ008-V-ICMS-COR.

           EXEC SQL SELECT NM_PECA_PRTG
                    INTO   :WQ01-NM-PECA-PRTG   :WI01-NM-PECA-PRTG
                    FROM   H1SR.PECA
                    WHERE  ID_PECA = :SF0002-ITD-ID-PECA-LOG
                END-EXEC.

           MOVE WQ01-NM-PECA-PRTG            TO RRBMQ008-TXT-DESC-MAT.
           MOVE CT0001-DEB-CD-CT             TO RRBMQ008-CD-CT.
           MOVE CT0001-DEB-CD-SUB1           TO RRBMQ008-CD-SUB1.
           MOVE CT0001-DEB-CD-SUB2           TO RRBMQ008-CD-SUB2.
           MOVE ZEROS                        TO RRBMQ008-CD-SEC.
           MOVE SPACES                       TO RRBMQ008-CD-DET-CT.
           MOVE SR0003-ID-NF-CTB             TO RRBMQ008-CD-DCT-NF-ORIG.
           MOVE CC0002-IDF-NUM-CTB           TO RRBMQ008-CD-SQN-NF-ORIG.
           INSPECT RRBMQ008-CD-SQN-NF-ORIG   CONVERTING SPACES TO ZEROS.
           MOVE SPACES                       TO RRBMQ008-CD-T-CPL.
           MOVE SPACES                       TO RRBMQ008-TXT-DESC-CPL.
           MOVE ST0005-CD-GR-PECA            TO RRBMQ008-CD-GR-PECA.
           MOVE SPACES                       TO RRBMQ008-CD-ALTC-TCN.
           MOVE ZEROS                        TO RRBMQ008-CD-ADRP.
           MOVE ZEROS                        TO RRBMQ008-CD-RRDM.
           MOVE ZEROS                        TO RRBMQ008-CD-AC.
           MOVE ZEROS                        TO RRBMQ008-CD-CWO.
           MOVE ZEROS                        TO RRBMQ008-CD-CEN-CST.
           MOVE SPACES                       TO RRBMQ008-CD-ATV-FIXO.
           MOVE ZEROS                        TO RRBMQ008-CD-PRJ.
           MOVE SPACES                    TO RRBMQ008-TXT-DESC-ATV-FIXO.
           MOVE SPACES                       TO RRBMQ008-CD-PDD-MQN.
           MOVE SPACES                       TO RRBMQ008-CD-T-AC.
           MOVE SPACES                      TO RRBMQ008-CD-SRIE-NF-ORIG.
           MOVE SPACES                       TO RRBMQ008-DT-EMS-NF-ORIG.
           MOVE ZEROS                        TO RRBMQ008-CD-NF-FRN.
           MOVE SPACES                       TO RRBMQ008-CD-SRIE-NF-FRN.
           MOVE SPACES                       TO RRBMQ008-DT-EMS-NF-FRN.
           MOVE SPACES                       TO RRBMQ008-CD-T-DST-ITEM.

           ADD 1                             TO WS01-CONT-ITEM-CTB.

           MOVE SPACES                       TO ACB50221-CHV-PRAD.     
           MOVE 932                          TO ACB50221-TAM-MSG.
           MOVE RRBMQ008-ITEM-NF             TO ACB50221-TXT-MSG.
           
           PERFORM 555-00-GRAVA-MENSAGEM-MQ.

       845-99-CONTABILIZA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 10/03 *
      *                                                                *
      *  CONTABILIZACAO DA DANFE - HEADER.                             *
      *----------------------------------------------------------------*
      
       850-00-CONTABILIZA-DANFE              SECTION.
      *----------------------------------------------*

           MOVE '850-00-CONTABILIZA-DANFE'   TO WS35-AUX-TS.

       850-10-RECUPERA-ITEM-RCBM.

           PERFORM 532-00-RECUPERA-ITEM-RCBM.

       850-20-CARREGA-CAMPOS.

           MOVE '01'                         TO ACB5022-CD-ACES.
           MOVE ZEROS                        TO ACB5022-CD-RETR-ECI
                                                ACB5022-CD-RETR-ACES.
           MOVE '03'                         TO ACB50221-CD-ACES-MQ.
           MOVE 00012                        TO ACB50221-ID-FILA-MQ.
           MOVE ZEROS                        TO ACB50221-CD-RETR-MQ 
                                                ACB50221-CD-COMP
                                                ACB50221-CD-RSON.
           MOVE SPACES                       TO ACB50221-ID-MSG-PRC
                                                ACB50221-ID-MSG-AUX.

           MOVE SPACES                       TO RRBMQ010-NOTA-FISCAL.   

           MOVE SF0002-ITD-DTC-SEL-FTRM      TO WS35-ID-CORR-ID-LIT-SC.
           MOVE CC0001-NUMERO-CTB-5          TO WS35-ID-CORR-ID-ALF-SC.
           INSPECT WS35-ID-CORREL-ID         CONVERTING SPACES TO ZEROS.
           MOVE WS35-ID-CORREL-ID            TO ACB50221-ID-MSG-AUX.

           MOVE CC0001-DH-EMISSAO-I-SEC      TO WS01-CD-RR-CTB-SEC.    
           MOVE 'D6'                         TO WS01-CD-RR-CTB-LIT.    
           MOVE CC0001-NUMERO-CTB            TO WS01-CD-RR-CTB-NF.    
           MOVE WS01-CD-RR-CTB               TO RRBMQ010-CD-RR.
           MOVE 'NFD'                        TO RRBMQ010-CD-T-NF.
           MOVE CC0001-NUMERO-CTB-6          TO RRBMQ010-CD-NF.
           MOVE SR0003-ID-FRN                TO RRBMQ010-CD-FRN.
           MOVE WS01-CGC-EMIF-DEST           TO RRBMQ010-CD-CGC-CPF.
           MOVE SPACES                       TO RRBMQ010-CD-MTZ-FRN.
           MOVE 'D6'                         TO RRBMQ010-CD-SRIE-NF.
           MOVE 'S'                          TO RRBMQ010-CD-T-MVTO.
           MOVE SPACES                       TO RRBMQ010-CD-FTR.
           MOVE 'F'                          TO RRBMQ010-CD-T-PGT.
           MOVE CC0001-DH-EMISSAO-I          TO RRBMQ010-DT-EMS.
           MOVE SPACES                       TO RRBMQ010-DT-VCMT.
           MOVE CC0001-DH-EMISSAO-I          TO RRBMQ010-DT-RCBM.
           MOVE SPACES                       TO RRBMQ010-DT-CTB.
           MOVE CT0001-DEB-CD-CT             TO RRBMQ010-CD-CT.
           MOVE CT0001-DEB-CD-SUB1           TO RRBMQ010-CD-SUB1.
           MOVE CT0001-DEB-CD-SUB2           TO RRBMQ010-CD-SUB2.
           MOVE ZEROS                        TO RRBMQ010-CD-SEC.
           MOVE SR0003-ID-FRN-CT             TO RRBMQ010-CD-DET-CT.
           MOVE CC0001-VL-TOTAL-BASE-IPI-CTB TO RRBMQ010-V-BS-IPI.
           MOVE CC0001-VL-TOTAL-BASE-ICMS-CTB TO RRBMQ010-V-BS-ICMS.
           MOVE CC0001-VL-TOTAL-BASE-STF-CTB TO RRBMQ010-V-BS-ICMS-SBSC.
           MOVE  ZEROS                       TO RRBMQ010-V-BS-IRRF. 
           MOVE  ZEROS                       TO RRBMQ010-V-BS-INSS. 
           MOVE CC0001-VL-TOTAL-BASE-ISS-CTB TO RRBMQ010-V-BS-ISS.
           MOVE CC0001-VL-TOTAL-IPI-CTB      TO RRBMQ010-V-IPI.
           MOVE CC0001-VL-TOTAL-ICMS-CTB     TO RRBMQ010-V-ICMS.
           MOVE CC0001-VL-TOTAL-STF-CTB      TO RRBMQ010-V-ICMS-SBSC.
           MOVE CC0001-VL-TOTAL-IRRF-CTB     TO RRBMQ010-V-IRRF.
           MOVE SPACES                       TO RRBMQ010-CD-RTN-IRRF.
           MOVE ZEROS                        TO RRBMQ010-V-INSS.
           MOVE ZEROS                        TO RRBMQ010-V-ISS.
           MOVE CC0001-VL-FRETE-CTB          TO RRBMQ010-V-FRT.
           MOVE CC0001-VL-SEGURO-CTB         TO RRBMQ010-V-SGR.
           MOVE CC0001-VL-OUTRAS-DESPESAS-CTB TO RRBMQ010-V-OT-DESP.
           MOVE ZEROS                        TO RRBMQ010-V-DSCT.
           MOVE ZEROS                        TO RRBMQ010-V-AJTE.
           MOVE CC0001-PRECO-TOTAL-M-CTB     TO RRBMQ010-V-TTL-PRD.
           MOVE CC0001-VL-TOTAL-CONTABIL-CTB TO RRBMQ010-V-TTL-NF.
           MOVE SPACES                      TO RRBMQ010-CD-CGC-CPF-TRSR.
           MOVE SPACES                     TO RRBMQ010-CD-INSC-EST-TRSR.
           MOVE SPACES                      TO RRBMQ010-NM-TRSR.
           MOVE SPACES                      TO RRBMQ010-NM-END-TRSR.
           MOVE SPACES                      TO RRBMQ010-NM-CID-TRSR.
           MOVE SPACES                      TO RRBMQ010-CD-UF-TRSR.
           MOVE SPACES                      TO RRBMQ010-CD-PL-VEIC-TRSR.
           MOVE SPACES                    TO RRBMQ010-CD-UF-PL-VEI-TRSR.
           MOVE SPACES                      TO RRBMQ010-IC-RSP-FRT.
           MOVE ZEROS                       TO RRBMQ010-VL-PESO-LQD.
           MOVE ZEROS                       TO RRBMQ010-VL-PESO-BRT.
           MOVE ZEROS                       TO RRBMQ010-QT-VOL.
           MOVE SPACES                      TO RRBMQ010-CD-UND-MDA-VOL.
           MOVE SPACES                      TO RRBMQ010-CD-MRC-VOL.
           MOVE SPACES                      TO RRBMQ010-CD-VOL.
           MOVE SPACES                      TO RRBMQ010-TXT-OBS.

           EXEC SQL SELECT TO_CHAR(SYSDATE,'YYYY/MM/DD'),
                           TO_CHAR(SYSDATE,'YYYYMMDD')
                    INTO   :WQ01-SYSDATE,
                           :WQ01-SYSDATE-8-I
                    FROM   DUAL
                    WHERE  ROWNUM = 1
                END-EXEC.
 
           MOVE WQ01-SYSDATE                 TO RRBMQ010-DT-INCL.
           MOVE 'BPIS'                     TO RRBMQ010-CD-LGON-USR-INCL.
           MOVE SPACES                       TO RRBMQ010-DT-ALTC.
           MOVE SPACES                     TO RRBMQ010-CD-LGON-USR-ALTC.
           MOVE 'SF'                         TO RRBMQ010-CD-STM-ORGM.
           MOVE 'I'                          TO RRBMQ010-CD-INS.
           MOVE 'L'                          TO RRBMQ010-CD-STA-NF
           MOVE SPACES                       TO RRBMQ010-NM-USR-INCL
           MOVE ZEROS                       TO RRBMQ010-CD-RML-USR-INCL.
           MOVE ZEROS                       TO RRBMQ010-CD-SEC-USR-INCL.
           MOVE '00'                         TO RRBMQ010-IC-EDI.
           MOVE SPACES                       TO RRBMQ010-CD-CTT.
           MOVE SR0003-CD-FBR                TO RRBMQ010-CD-FBR.
           MOVE WS01-CONT-ITEM-CTB           TO RRBMQ010-TTL-ITEM-NF.

           MOVE ZEROS                        TO WS01-CONT-ITEM-CTB.

           MOVE SPACES                       TO ACB50221-CHV-PRAD.     
           MOVE 1376                         TO ACB50221-TAM-MSG.
           MOVE RRBMQ010-NOTA-FISCAL         TO ACB50221-TXT-MSG.
           
           PERFORM 555-00-GRAVA-MENSAGEM-MQ.

       850-99-CONTABILIZA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 11/03 *
      *                                                                *
      *  INTERFACE PARA CME - ITEM.                                    *  
      *----------------------------------------------------------------*
      
       855-00-INTERFACE-CME-ITEM             SECTION.
      *----------------------------------------------*

           MOVE '855-00-INTERFACE-CME-ITEM'  TO WS35-AUX-TS.

       855-10-CARREGA-CAMPOS.

           MOVE '01'                         TO ACB5022-CD-ACES.
           MOVE ZEROS                        TO ACB5022-CD-RETR-ECI
                                                ACB5022-CD-RETR-ACES.
           MOVE '03'                         TO ACB50221-CD-ACES-MQ.
           MOVE 00045                        TO ACB50221-ID-FILA-MQ.
           MOVE ZEROS                        TO ACB50221-CD-RETR-MQ 
                                                ACB50221-CD-COMP
                                                ACB50221-CD-RSON.
           MOVE SPACES                       TO ACB50221-ID-MSG-PRC.

           MOVE SF0002-ITD-DTC-SEL-FTRM      TO WS35-ID-CORR-ID-LIT-SC.
           MOVE CC0001-NUMERO-CTB-5          TO WS35-ID-CORR-ID-ALF-SC.
           INSPECT WS35-ID-CORREL-ID         CONVERTING SPACES TO ZEROS.
           MOVE WS35-ID-CORREL-ID            TO ACB50221-ID-MSG-AUX.

           MOVE SPACES                       TO SF8003-SF80032.    

           MOVE '02'                         TO SF80032-CD-ACES.
           MOVE CC0001-NUMERO-CTB-6          TO SF80032-CD-NF.
           MOVE ST0006-ID-FRN                TO SF80032-CD-FRN.
           MOVE 'NFS'                        TO SF80032-CD-T-MVTO.
           MOVE CC0002-IDF-NUM-4             TO SF80032-CD-SQN-ITM.

           MOVE CC0002-PRECO-UNITARIO-CME    TO WS01-VALOR-AUX-14-4.
           MOVE WS01-VALOR-AUX-14-4-R        TO SF80032-V-PREC-UNIT.

           MOVE SF0002-ITD-ID-PECA-LOG       TO SF80032-CD-PRD.
           MOVE SF0002-ITD-ID-PDD-LOG        TO SF80032-CD-PDD.

           MOVE CC0002-ALIQ-ICMS-LOG         TO WS01-VALOR-AUX-4-2.
           MOVE WS01-VALOR-AUX-4-2-R         TO SF80032-PERC-ICMS.

           MOVE CC0002-ALIQ-IPI-LOG          TO WS01-VALOR-AUX-4-2.
           MOVE WS01-VALOR-AUX-4-2-R         TO SF80032-PERC-IPI.

           MOVE CC0002-VL-ICMS-CME           TO WS01-VALOR-AUX-16-2.
           MOVE WS01-VALOR-AUX-16-2-R        TO SF80032-V-ICMS.

           MOVE CC0002-VL-IPI-CME            TO WS01-VALOR-AUX-16-2.
           MOVE WS01-VALOR-AUX-16-2-R        TO SF80032-V-IPI.

           MOVE SF0002-ITD-Q-PECA-FTRD       TO SF80032-QT-FTRD.
           MOVE SF0002-ITD-Q-PECA-FTRD       TO SF80032-QT-SLD.
           MOVE ZEROS                        TO SF80032-QT-DPV.
           MOVE SPACES                       TO SF80032-CD-NF-RTRN
                                                SF80032-CD-FRN-RTRN
                                                SF80032-CD-T-MVTO-RTRN.

           MOVE 'A'                          TO SF80032-CD-STA-INF.
                
           MOVE ZEROS                        TO SF80032-QT-AJTE.
           MOVE CC0001-DH-EMISSAO-BARRA      TO SF80032-DT-EMS.
           MOVE SPACES                       TO SF80032-DS-HST-AJTE
                                                SF80032-DT-AJTE.
           MOVE 'UM'                         TO SF80032-CD-UND-MDA.
           MOVE SPACES                       TO SF80032-TXT-CPLM.

           MOVE '04'                         TO ACB50221-CHV-PRAD.     
           MOVE 896                          TO ACB50221-TAM-MSG.
           MOVE SF8003-SF80032               TO ACB50221-TXT-MSG.
           
           PERFORM 555-00-GRAVA-MENSAGEM-MQ.

       855-99-INTERFACE-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 11/03 *
      *                                                                *
      *  INTERFACE PARA CME - DANFE.                                   *
      *----------------------------------------------------------------*
      
       860-00-INTERFACE-CME-DANFE            SECTION.
      *----------------------------------------------*

           MOVE '860-00-INTERFACE-CME-DANFE' TO WS35-AUX-TS.
                
       860-10-CARREGA-CAMPOS.

           MOVE '01'                         TO ACB5022-CD-ACES.
           MOVE ZEROS                        TO ACB5022-CD-RETR-ECI
                                                ACB5022-CD-RETR-ACES.
           MOVE '03'                         TO ACB50221-CD-ACES-MQ.
           MOVE 00045                        TO ACB50221-ID-FILA-MQ.
           MOVE ZEROS                        TO ACB50221-CD-RETR-MQ 
                                                ACB50221-CD-COMP
                                                ACB50221-CD-RSON.
           MOVE SPACES                       TO ACB50221-ID-MSG-PRC.

           MOVE SF0002-ITD-DTC-SEL-FTRM      TO WS35-ID-CORR-ID-LIT-SC.
           MOVE CC0001-NUMERO-CTB-5          TO WS35-ID-CORR-ID-ALF-SC.
           INSPECT WS35-ID-CORREL-ID         CONVERTING SPACES TO ZEROS.
           MOVE WS35-ID-CORREL-ID            TO ACB50221-ID-MSG-AUX.

           MOVE SPACES                       TO SF8003-SF80031.    

           MOVE '01'                         TO SF80031-CD-ACES.
           MOVE ST0001-CD-FBR                TO SF80031-CD-FBR.
           MOVE CC0001-NUMERO-CTB-6          TO SF80031-CD-NF.
           MOVE ST0006-ID-FRN                TO SF80031-CD-FRN.
           MOVE 'NFS'                        TO SF80031-CD-T-MVTO.
           MOVE 'NF'                         TO SF80031-CD-T-NF.
           MOVE CC0001-NOP-CODIGO            TO SF80031-CD-NOP.
           MOVE SF0001-PTD-LGON-FUNC         TO SF80031-CD-LGON-USR.
           MOVE CC0001-SERIE-SUBSERIE-3      TO SF80031-CD-SRIE.
           MOVE 'M'                          TO SF80031-CD-T-MAT.
           MOVE 'A'                          TO SF80031-CD-STA-NF.
           MOVE SPACES                       TO SF80031-DT-PRR.
           MOVE CC0001-DH-EMISSAO-BARRA      TO SF80031-DT-EMS.
           MOVE SPACES                       TO SF80031-DT-RMS
                                                SF80031-DT-VCMT.

           EXEC SQL SELECT TO_CHAR(SYSDATE,'YYYY/MM/DD'),
                           TO_CHAR(SYSDATE,'YYYYMMDD')
                    INTO   :WQ01-SYSDATE,
                           :WQ01-SYSDATE-8-I
                    FROM   DUAL
                    WHERE  ROWNUM = 1
                END-EXEC.
 
           MOVE WQ01-SYSDATE-8-I             TO SF80031-DT-INCL
                                                SF80031-DT-ATUA.

           MOVE '08'                         TO ACB50221-CHV-PRAD.     
           MOVE 107                          TO ACB50221-TAM-MSG.
           MOVE SF8003-SF80031               TO ACB50221-TXT-MSG.
           
           PERFORM 555-00-GRAVA-MENSAGEM-MQ.

       860-99-INTERFACE-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 01/04 *
      *                                                                *
      *  INTERFACE PARA DEA - ITEM.                                    *  
      *----------------------------------------------------------------*
      
       865-00-INTERFACE-DEA-ITEM             SECTION.
      *----------------------------------------------*

           MOVE '865-00-INTERFACE-DEA-ITEM'  TO WS35-AUX-TS.

           IF SF0005-SFT-CD-T-REC EQUAL 'XX'
                GO                           TO 865-99-INTERFACE-EXIT.

       865-10-IDENTIFICA-INTERFACE.

           MOVE 'CBL'                       TO SE0001-IDE-NM-EMP.
           IF WS36-CD-MERC-DST  EQUAL  'D'
                IF SF0005-SFT-IC-FTRM-TRGD  NOT EQUAL  'S'
                     MOVE 'NOTA_FISCAL_DE_VENDA_DOM'
                                            TO SE0001-IDE-ID-T-ITF
                ELSE
                     MOVE 'NOTA_FISCAL_DE_VENDA_TEF'
                                            TO SE0001-IDE-ID-T-ITF
                END-IF
           ELSE
                MOVE 'NOTA_FISCAL_DE_REEXPORTACAO'
                                            TO SE0001-IDE-ID-T-ITF.
           MOVE 'BPIS'                      TO SE0001-IDE-ID-STM-ORGM.      
           MOVE WQ01-SYSDATE-DEA            TO SE0001-IDE-DTC-GRC
                                               SE0001-IDE-DTC-ITF.      
           MOVE WS01-ID-NUM-CNT             TO SE0001-IDE-NUM-CNT.      
           MOVE WS01-ID-NUM-T-REG           TO SE0001-IDE-NUM-T-REG.
           MOVE ZEROS                       TO SE0001-IDE-NUM-SQN.      
           MOVE '*'                         TO SE0001-IDE-IC-PRC.      

       865-20-CARREGA-CAMPOS.

           EXEC SQL SELECT CD_ANLS_PECA,
                           IC_RMAN_BK
                    INTO   :WQ01-CD-ANLS-PECA,
                           :SR0004-IC-RMAN-BK :WI01-IC-RMAN-BK
                    FROM   H1SR.PECA
                    WHERE  ID_PECA = :SF0002-ITD-ID-PECA-LOG
                END-EXEC.

           INSPECT WQ01-CD-ANLS-PECA         CONVERTING SPACES TO ZEROS.

           MOVE CC0001-NUMERO-DEA            TO SE90052-ID-NF.      
           MOVE CC0001-SERIE-SUBSERIE-3      TO SE90052-CD-SRIE-NF.      
           MOVE CC0002-IDF-NUM-4             TO SE90052-ID-SQN-ITEM.

           MOVE SF0002-ITD-ID-PECA-LOG       TO ACB5035-ID-PECA.
           PERFORM 160-00-VERIFICA-SE-PECA-REMAN.

           IF ST0005-NM-FNT-ATND  EQUAL  'SBD'
                MOVE 'S'                     TO SE90052-IC-ITEM-DEA
                IF ACB5035-IC-PECA-RMAN  EQUAL  'S'  AND
                   SF0002-ITD-ID-PECA-LOG(01:03)  NOT EQUAL  '11R'  AND
                   SF0002-ITD-ID-PECA-LOG(01:03)  NOT EQUAL  '21R'  AND
                   SF0002-ITD-ID-PECA-LOG(01:03)  NOT EQUAL  '31R'
                   IF SR0004-IC-RMAN-BK  EQUAL  'S'
                        MOVE 'T'             TO SE90052-IC-ITEM-DEA 
                   ELSE
                        MOVE 'R'             TO SE90052-IC-ITEM-DEA 
                   END-IF
                ELSE
                     NEXT SENTENCE     
           ELSE
                MOVE 'N'                     TO SE90052-IC-ITEM-DEA.

           MOVE SF0002-ITD-ID-PECA-LOG       TO SE90052-ID-PECA.      
           MOVE CC0002-NBM-CODIGO-DEA        TO SE90052-ID-CLSF-FSCL.
           MOVE WS01-SIT-TRIB                TO SE90052-CD-SIT-TRBT.
           MOVE CC0002-ENTSAI-UNI-CODIGO     TO SE90052-CD-UND.
           MOVE CC0002-QTD-DEA               TO SE90052-QT-PECA-FTRD.
           MOVE CC0002-PRECO-UNITARIO-DEA    TO SE90052-V-ITEM.
           MOVE CC0002-PRECO-TOTAL-CTB-1     TO SE90052-V-TTL-ITEM.
           MOVE CC0002-ALIQ-IPI-LOG-5        TO
                                               SE90052-ID-PERC-IPI-ITEM.
           MOVE CC0002-ALIQ-ICMS-LOG-5       TO 
                                              SE90052-ID-PERC-ICMS-ITEM.

           MOVE WS01-TXT-TX-SERV             TO WS01-AUX-TX-DEA-7.
           IF WS01-AUX-TX-DEA-7-FILL2  EQUAL  ','
                MOVE WS01-AUX-TX-DEA-7-INT   TO WS01-AUX-TX-DEA-5-INT
                MOVE WS01-AUX-TX-DEA-7-DEC   TO WS01-AUX-TX-DEA-5-DEC
                INSPECT WS01-AUX-TX-DEA-5    CONVERTING SPACES TO ZEROS
                MOVE WS01-AUX-TX-DEA-5     TO SE90052-ID-PERC-SERV-ITEM
           ELSE
                MOVE ZEROS                 TO SE90052-ID-PERC-SERV-ITEM.

           MOVE WS01-TXT-PERC-DSCT           TO WS01-AUX-TX-DEA-7.
           IF WS01-AUX-TX-DEA-7-FILL2  EQUAL  ','
                MOVE WS01-AUX-TX-DEA-7-INT   TO WS01-AUX-TX-DEA-5-INT
                MOVE WS01-AUX-TX-DEA-7-DEC   TO WS01-AUX-TX-DEA-5-DEC
                INSPECT WS01-AUX-TX-DEA-5    CONVERTING SPACES TO ZEROS
                MOVE WS01-AUX-TX-DEA-5     TO SE90052-ID-PERC-DSCT-ITEM
           ELSE
                MOVE ZEROS                 TO SE90052-ID-PERC-DSCT-ITEM.

           MOVE CC0002-VL-IPI-DEA            TO SE90052-V-TTL-IPI-ITEM.
           MOVE CC0002-VL-BASE-ICMS-DEA   TO SE90052-V-TTL-BS-ICMS-ITEM.
           MOVE CC0002-VL-ICMS-DEA           TO SE90052-V-TTL-ICMS-ITEM.
           MOVE CC0002-FRETE-DEA             TO SE90052-V-TTL-FRT-ITEM.
           MOVE SF0002-ITD-V-TX-SERV         TO SE90052-V-TTL-SERV-ITEM.          
           MOVE CC0002-DESCONTO-ITEM-DEA     TO SE90052-V-TTL-DESC-ITEM.
           MOVE WS01-PESO-BRT-EMIF-NUM       TO SE90052-V-TTL-PESO-R.
           MOVE SF0002-ITD-ID-VOL-LOG        TO SE90052-ID-VOL.
           MOVE SF0002-ITD-ID-PDD-LOG        TO SE90052-ID-PDD.
           MOVE ST0005-ID-PSO                TO SE90052-ID-PSO.
           MOVE SF0002-ITD-ID-ETIQ-REC-LOG   TO SE90052-ID-ETIQ-REC.
           MOVE SF0002-ITD-ID-ETIQ-ACND-LOG  TO SE90052-ID-ETIQ-ACND.
           MOVE ST0005-CD-PFO                TO SE90052-CD-PFO.
           MOVE CC0002-CFOP-CODIGO           TO SE90052-CD-CFOP.
           MOVE CC0002-NOP-COD-1             TO WS01-NOP-AUX-COD-1.
           MOVE CC0002-NOP-COD-2             TO WS01-NOP-AUX-COD-2.
           MOVE WS01-NOP-AUX                 TO SE90052-CD-NOP.
           MOVE ST0005-ID-SQN-ITEM-PDD       TO SE90052-ID-SQN-IT-PDD.
           MOVE ST0005-ID-SQN-ATND-ITEM      TO SE90052-ID-SQN-IT-SRC.
           MOVE ST0005-ID-SQN-OCR-FNT        TO SE90052-ID-SQN-OCR-SRC.
           MOVE ZEROS                        TO SE90052-V-ITEM-API.

           IF WS36-CD-MERC-DST  EQUAL  'D'
                MOVE SE90052-TXT-MSG         TO SE0001-IDE-TXT-MSG
           ELSE
                MOVE SE90052-TXT-MSG         TO SE90252-TXT-MSG
                MOVE SF0002-ITD-ID-ITM-DE    TO SE90252-ID-ITEM-DE
                MOVE SE90252-TXT-MSG         TO SE0001-IDE-TXT-MSG.

           PERFORM 620-00-GRAVA-INTERFACE-DEA.

       865-99-INTERFACE-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           ACA 01/04 *
      *                                                                *
      *  INTERFACE PARA DEA - DANFE.                                   *
      *----------------------------------------------------------------*
      
       870-00-INTERFACE-DEA-DANFE            SECTION.
      *----------------------------------------------*

           IF SF0005-SFT-CD-T-REC EQUAL 'XX'
                GO                           TO 870-99-INTERFACE-EXIT.
           
           MOVE '870-00-INTERFACE-DEA-DANFE' TO WS35-AUX-TS.

       870-10-IDENTIFICA-INTERFACE.

           MOVE 'CBL'                       TO SE0001-IDE-NM-EMP.
           IF WS36-CD-MERC-DST  EQUAL  'D'
                IF SF0005-SFT-IC-FTRM-TRGD  NOT EQUAL  'S'
                     MOVE 'NOTA_FISCAL_DE_VENDA_DOM'
                                            TO SE0001-IDE-ID-T-ITF
                ELSE
                     MOVE 'NOTA_FISCAL_DE_VENDA_TEF'
                                            TO SE0001-IDE-ID-T-ITF
                END-IF
           ELSE
                MOVE 'NOTA_FISCAL_DE_REEXPORTACAO'
                                            TO SE0001-IDE-ID-T-ITF.
           MOVE 'BPIS'                      TO SE0001-IDE-ID-STM-ORGM.      
           MOVE WQ01-SYSDATE-DEA            TO SE0001-IDE-DTC-GRC
                                               SE0001-IDE-DTC-ITF.      
           MOVE WS01-ID-NUM-CNT             TO SE0001-IDE-NUM-CNT.      
           MOVE ZEROS                       TO SE0001-IDE-NUM-T-REG
                                               SE0001-IDE-NUM-SQN.      
           MOVE '*'                         TO SE0001-IDE-IC-PRC.      
 
       870-20-CARREGA-CAMPOS.

           MOVE CC0001-NUMERO-DEA            TO SE90051-ID-NF.      
           MOVE CC0001-SERIE-SUBSERIE-3      TO SE90051-CD-SRIE-NF.      
           INSPECT CC0001-CFOP-CODIGO-LOG    CONVERTING SPACES TO ZEROS.      
           MOVE CC0001-CFOP-CODIGO-LOG       TO SE90051-CD-CFOP.      

           MOVE CC0001-NOP-COD-1             TO WS01-NOP-AUX-COD-1.      
           MOVE CC0001-NOP-COD-2             TO WS01-NOP-AUX-COD-2.      
           MOVE WS01-NOP-AUX                 TO SE90051-CD-NOP.      

           MOVE SF0001-PTD-ID-CLI            TO SE90051-ID-CLI.      
           MOVE CC0001-DH-EMISSAO            TO SE90051-DTC-NF.      
           MOVE WS01-ID-NUM-T-REG            TO SE90051-QT-ITEM.      
           MOVE SF0002-ITD-CD-T-REC          TO SE90051-CD-T-REC.      
           MOVE SF0002-ITD-CD-MOD-TRSP-LOG   TO SE90051-CD-MOD-TRSP.      
           MOVE CC0005-RAZAO-SOCIAL          TO SE90051-NM-TRSR.      
           MOVE CC0001-PRECO-TOTAL-M-DEA     TO SE90051-V-TTL-MRCD-NF.
           MOVE CC0001-VL-TOTAL-BASE-IPI-DEA TO SE90051-V-TTL-BS-IPI-NF.
           MOVE CC0001-VL-TOTAL-IPI-DEA      TO SE90051-V-TTL-IPI-NF.
           MOVE CC0001-VL-TOTAL-BASE-ICMS-DEA
                                            TO SE90051-V-TTL-BS-ICMS-NF.
           MOVE CC0001-VL-TOTAL-ICMS-DEA     TO SE90051-V-TTL-ICMS-NF.
           MOVE CC0001-VL-TOTAL-BASE-STF-DEA
                                          TO SE90051-V-TTL-BS-ICMS-SUBS.
           MOVE CC0001-VL-TOTAL-STF-DEA      TO SE90051-V-TTL-ICMS-SUBS.
           MOVE CC0001-VL-TOTAL-CONTABIL-DEA TO SE90051-V-TTL-FTRD-NF.
           MOVE CC0001-PESO-BRUTO-KG-DEA     TO SE90051-V-TTL-PESO-NF.
           MOVE CC0001-VL-FRETE-DEA          TO SE90051-V-TTL-FRT-NF.
           MOVE CC0001-VL-OUTRAS-DESPESAS-CTB TO SE90051-V-TTL-SERV-NF.
           IF WS36-CD-MERC-DST  EQUAL  'E'
                MOVE CC0001-VL-AJUSTE-PRECO-TOTAL-M  TO 
                                              SE90051-V-TTL-DSCT-NF
           ELSE
                MOVE CC0001-VL-DESCONTO-LOG  TO SE90051-V-TTL-DSCT-NF.
           MOVE SF0002-ITD-FTR-EXP-LOG       TO SE90051-ID-FTR-EXP.
           
           IF SF0001-PTD-ID-MTZ  EQUAL  'U05A'
                MOVE 'A'                     TO SE90051-CD-S9X-ESPC
           ELSE
                MOVE SPACES                  TO SE90051-CD-S9X-ESPC.

           MOVE SE90051-TXT-MSG              TO SE0001-IDE-TXT-MSG.
           
           IF WS36-CD-MERC-DST  EQUAL  'D'
                MOVE SE90051-TXT-MSG         TO SE0001-IDE-TXT-MSG
           ELSE
                MOVE SE90051-TXT-MSG         TO SE90251-TXT-MSG
                MOVE SE90251-TXT-MSG         TO SE0001-IDE-TXT-MSG.

           PERFORM 620-00-GRAVA-INTERFACE-DEA.

       870-30-FINALIZA-INTERFACE.

           MOVE 'CBL'                       TO SE0001-IDE-NM-EMP.
           IF WS36-CD-MERC-DST  EQUAL  'D'
                IF SF0005-SFT-IC-FTRM-TRGD  NOT EQUAL  'S'
                     MOVE 'NOTA_FISCAL_DE_VENDA_DOM'
                                            TO SE0001-IDE-ID-T-ITF
                ELSE
                     MOVE 'NOTA_FISCAL_DE_VENDA_TEF'
                                            TO SE0001-IDE-ID-T-ITF
                END-IF
           ELSE
                MOVE 'NOTA_FISCAL_DE_REEXPORTACAO'
                                            TO SE0001-IDE-ID-T-ITF.
           MOVE 'BPIS'                      TO SE0001-IDE-ID-STM-ORGM.      
           MOVE WQ01-SYSDATE-DEA            TO SE0001-IDE-DTC-GRC
                                               SE0001-IDE-DTC-ITF.      
           MOVE WS01-ID-NUM-CNT             TO SE0001-IDE-NUM-CNT.      
           MOVE 999999999                   TO SE0001-IDE-NUM-T-REG
           MOVE ZEROS                       TO SE0001-IDE-NUM-SQN.
           MOVE 'N'                         TO SE0001-IDE-IC-PRC.      
 
       870-40-CARREGA-CAMPOS-FIM.

           MOVE SPACES                       TO WS01-FIM-DEA-PROCESSO.      
           MOVE 'H1SF0033'                   TO WS01-FIM-DEA-PROCESSO.      
           MOVE WQ01-SYSDATE-DEA             TO WS01-FIM-DEA-DATA.      

           MOVE SPACES                       TO SE0001-IDE-TXT-MSG.      
           MOVE WS01-FIM-INTERFACE-DEA       TO SE0001-IDE-TXT-MSG.

           PERFORM 620-00-GRAVA-INTERFACE-DEA.

       870-99-INTERFACE-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 04/06 *
      *                                                                *
      *  GRAVA LOG CAPS - FILA MQ 00111.                               *
      *----------------------------------------------------------------*
      
       875-00-MONTA-LOG-CAPS                 SECTION.
      *----------------------------------------------*

           MOVE ZEROS                        TO WS01-ID-SQN-MQ.

       875-10-RECUPERA-TOTAL.

           EXEC SQL SELECT A.SUP_CD_FORN_SPR
                    INTO   :SF0009-SUP-CD-FORN-SPR
                    FROM   H1SF.SUP_FORNECEDOR A,
                           H1ST.ITEM_RECOLHIMENTO B,
                           H1SF.ITD_ITMFATURADO C
                    WHERE  A.SUP_CD_FNT_ATND  =  B.CD_FNT_ATND
                    AND    C.ITD_ID_ETIQ_REC  =  B.ID_ETIQ_REC
                    AND    C.ITD_CD_MERC_DST  =  :WQ02-CD-MERC-DST
                    AND    C.ITD_DTC_SEL_FTRM =  :WQ02-DTC-SEL-FTRM
                    AND    C.ITD_LGON_FUNC    =  :WQ02-LGON-FUNC
                    AND    ((:WQ02-FASE-FTRM = '1'
                    AND      C.ITD_ID_NF_REF IS NULL)
                    OR      (:WQ02-FASE-FTRM = '2'
                    AND      C.ITD_ID_NF_REF IS NOT NULL))
                    AND    ROWNUM             =  1
                END-EXEC.
                
           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - SUPPLIER CODE NAO ENCONTRADO   ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WS36-ARE-RECEIVE        TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM                                                        
                PERFORM 900-00-REGISTRA-ERRO-TRNS.
                
           EXEC SQL SELECT NVL(SUM(ROUND(ITD_Q_PECA_FTRD
                                       * ((ITD_PREC_FTRD_UNT_EMIF / 100)
                                        / (ITD_RATE_US / 10000)), 2)),0)
                    INTO   :WQ01-TOTAL-SELECAO-R
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST  =  :WQ02-CD-MERC-DST
                    AND    ITD_DTC_SEL_FTRM =  :WQ02-DTC-SEL-FTRM
                    AND    ITD_LGON_FUNC    =  :WQ02-LGON-FUNC
                END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                MOVE '*** ERRO - LOG. SYNC. CAPS - ITD-ITMFAT.: ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WS36-ARE-RECEIVE        TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.
                
           EXEC SQL SELECT TO_CHAR(SYSDATE,'YYYYMMDDHH24MISS')
                    INTO   :WQ01-SYSDATE-AUX
                    FROM   DUAL
                    WHERE  ROWNUM = 1
                END-EXEC.

       875-20-RECUPERA-DETALHE.

           EXEC SQL DECLARE CSR_SEL_870  CURSOR FOR       
                    SELECT TO_CHAR(A.ITD_DTC_FTR_EXP,
                                                    'YYYYMMDDHH24MISS'),
                           A.ITD_FTR_EXP,
                           A.ITD_ID_PDD,
                           A.ITD_ID_CLI_REF,
                           A.ITD_ID_PECA,
                           A.ITD_Q_PECA_FTRD,
                           NVL(ROUND((A.ITD_PREC_FTRD_UNT_EMIF / 100)
                                      / (A.ITD_RATE_US / 10000), 5),0),
                           NVL(ROUND(A.ITD_Q_PECA_FTRD
                                     * ((A.ITD_PREC_FTRD_UNT_EMIF / 100)
                                      / (A.ITD_RATE_US / 10000)), 2),0),
                           B.NM_PECA_ING
                    FROM   H1SF.ITD_ITMFATURADO A,
                           H1SR.PECA B
                    WHERE  A.ITD_ID_PECA      =  B.ID_PECA
                    AND    A.ITD_CD_MERC_DST  =  :WQ02-CD-MERC-DST
                    AND    A.ITD_DTC_SEL_FTRM =  :WQ02-DTC-SEL-FTRM
                    AND    A.ITD_LGON_FUNC    =  :WQ02-LGON-FUNC
                END-EXEC.

           EXEC SQL OPEN   CSR_SEL_870
                END-EXEC. 
                
       875-20-LOOP-DETALHE.

           EXEC SQL FETCH  CSR_SEL_870
                    INTO   :SF0002-ITD-DTC-FTR-EXP,
                           :SF0002-ITD-FTR-EXP,
                           :SF0002-ITD-ID-PDD,
                           :SF0002-ITD-ID-CLI-REF,
                           :SF0002-ITD-ID-PECA,
                           :SF0002-ITD-Q-PECA-FTRD,
                           :WQ01-PREC-UNIT-FAT-R,
                           :WQ01-PREC-TOT-FAT-R,
                           :SR0004-NM-PECA-ING :WI01-NM-PECA-ING
                END-EXEC. 

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                          TO 875-50-FECHA-CURSOR.

       875-30-MOVIMENTA-LOG.

           MOVE SPACES                       TO SF80042-ASN-LAYOUT.

           ADD 1                             TO WS01-ID-SQN-MQ.
           MOVE WS01-ID-SQN-MQ               TO SF80042-ID-SQN.
           MOVE 'DN'                         TO SF80042-CD-T-REG.
           MOVE '02'                         TO SF80042-CD-ACES.

           MOVE 'ZQ'                         TO SF80042-RCVG-FAC-CD.
           MOVE SF0009-SUP-CD-FORN-SPR       TO SF80042-AP-BUY-SUPP-ID.
           MOVE WQ01-TOTAL-SELECAO           TO SF80042-TOT-INVC-AMT.
           MOVE 'USD'                        TO SF80042-CCY-CD.
           MOVE SPACES                       TO SF80042-MTSI-SOURCE-IND
                                                SF80042-ACCT-CC-1
                                                SF80042-ACCT-YY-1
                                                SF80042-ACCT-MMDD-1
                                                SF80042-ACCT-CC-2
                                                SF80042-ACCT-YY-2
                                                SF80042-ACCT-MMDD-2
                                             SF80042-UNFORMED-STEEL-IND.
           MOVE ZEROS                        TO SF80042-SHP-QTY.
           MOVE SPACES                       TO SF80042-INVC-BTCH-PFX.
           MOVE '9N'                         TO SF80042-INVC-BTCH-SFX.
           MOVE SPACES                       TO SF80042-FREIGHT-IND.

           MOVE SF0002-ITD-DTC-FTR-EXP       TO WS01-DTC-AUX.
           MOVE WS01-DTC-MES-AUX             TO WS01-MES-AUX.
           MOVE WS01-DTC-DIA-AUX             TO WS01-DIA-AUX.
           MOVE '20'                         TO SF80042-CAL-CC-3.
           MOVE WS01-DTC-ANO-AUX-02          TO SF80042-CAL-YY-3.
           MOVE WS01-MES-DIA-AUX             TO SF80042-CAL-MMDD-3.

           MOVE SF0002-ITD-FTR-EXP           TO SF80042-SUPP-INVC-NO-24.

           MOVE WQ01-SYSDATE-AUX             TO WS01-DTC-AUX.
           MOVE WS01-DTC-MES-AUX             TO WS01-MES-AUX.
           MOVE WS01-DTC-DIA-AUX             TO WS01-DIA-AUX.
           MOVE '20'                         TO SF80042-CAL-CC-4.
           MOVE WS01-DTC-ANO-AUX-02          TO SF80042-CAL-YY-4.
           MOVE WS01-MES-DIA-AUX             TO SF80042-CAL-MMDD-4.

           MOVE SF0002-ITD-ID-PDD            TO SF80042-SUPP-SHP-REF-1.
           MOVE SF0002-ITD-ID-CLI-REF        TO SF80042-SUPP-SHP-REF-2.
           MOVE '001'                        TO SF80042-INVC-LN-TYP.
           MOVE SPACES                       TO SF80042-PO-NO-15
                                                SF80042-PO-ITM-SEQ-NO.
           MOVE SF0002-ITD-ID-PECA           TO SF80042-CAT-ID-NO-20.

           MOVE SF0002-ITD-Q-PECA-FTRD       TO WS01-INVC-LN-BILL-QTY-5.
           INSPECT WS01-INVC-LN-BILL-QTY     CONVERTING SPACES TO ZEROS.
           MOVE WS01-INVC-LN-BILL-QTY        TO
                                               SF80042-INVC-LN-BILL-QTY.
           MOVE 3                            TO SF80042-PRC-UM-1.

           MOVE WQ01-PREC-UNIT-FAT           TO SF80042-LN-ITM-UNIT-PRC.
           MOVE SPACES                       TO SF80042-PO-RLSE-NO.
           MOVE WQ01-PREC-TOT-FAT            TO SF80042-LN-ITM-AMT.
           MOVE ZEROS                        TO SF80042-LN-ITM-CDISC-PCT
                                                SF80042-INVC-TX-CD
                                                SF80042-INVC-TX-PCT
                                                SF80042-SEQ-COUNT.
           MOVE SF0002-ITD-ID-CLI-REF        TO 
                                           SF80042-AIAG-INTERCHG-CTL-NO.
           MOVE SPACES                       TO SF80042-SUB-SEQ-NO
                                                SF80042-STATE-CITY-CODE.
           MOVE ZEROS                        TO SF80042-AP-ITM-TRD-DISC.
           MOVE SR0004-NM-PECA-ING           TO SF80042-LN-ITM-DESC.
           MOVE SPACES                       TO SF80042-ACCT-NO-FAC-CD
                                                SF80042-CTL-ACCT-NO
                                                SF80042-SUB-ACCT-NO
                                                SF80042-EXP-ACCT-NO
                                                SF80042-ACCTG-ORD-NO
                                                SF80042-ACCTG-DIST-QUAL
                                                SF80042-FILLER-1
                                                SF80042-RCD-SRC-CD
                                                SF80042-PROD-CNFGR-IND.
           MOVE ZEROS                        TO SF80042-INV-QTY
                                                SF80042-SHP-WT.
           MOVE SPACES                       TO
                                               SF80042-SHIPPING-ORDER-NO
                                                SF80042-CAT-INVC-CC
                                                SF80042-CAT-INVC-YY
                                                SF80042-CAT-INVC-BDY
                                                SF80042-AP-INVC-LN-NO
                                                SF80042-CASE-NO
                                                SF80042-INTFC-SFTWE-TYP
                                                SF80042-TRANSP-MODE
                                                SF80042-PSO-NO
                                                SF80042-FILLER-2.

       875-40-GRAVA-LOG.

           MOVE '01'                         TO ACB5022-CD-ACES.
           MOVE ZEROS                        TO ACB5022-CD-RETR-ECI
                                                ACB5022-CD-RETR-ACES.
           MOVE '03'                         TO ACB50221-CD-ACES-MQ.
           MOVE 00111                        TO ACB50221-ID-FILA-MQ.
           MOVE ZEROS                        TO ACB50221-CD-RETR-MQ
                                                ACB50221-CD-COMP
                                                ACB50221-CD-RSON.
           MOVE SPACES                       TO ACB50221-ID-MSG-PRC.
           
           MOVE SF0002-ITD-DTC-SEL-FTRM      TO WS35-ID-CORR-ID-LIT-SC.
           MOVE CC0001-NUMERO-CTB-5          TO WS35-ID-CORR-ID-ALF-SC.
           INSPECT WS35-ID-CORREL-ID         CONVERTING SPACES TO ZEROS.
           MOVE WS35-ID-CORREL-ID            TO ACB50221-ID-MSG-AUX.

           MOVE MQ01-ARE-CNT-FILA            TO ACB50221-ARE-CNT-FILA.
           MOVE SF80042-CD-T-REG             TO ACB50221-CHV-PRAD.
           MOVE 461                          TO ACB50221-TAM-MSG.
           MOVE SF80042-ASN-LAYOUT           TO ACB50221-TXT-MSG.

           PERFORM 555-00-GRAVA-MENSAGEM-MQ.
           
           GO                                TO 875-20-LOOP-DETALHE.

       875-50-FECHA-CURSOR.

           EXEC SQL CLOSE  CSR_SEL_870
                END-EXEC.
                
       875-60-LOG-START-CAPS.

           MOVE SPACES                       TO SF80042-ASN-LAYOUT.

           ADD 1                             TO WS01-ID-SQN-MQ.
           MOVE WS01-ID-SQN-MQ               TO SF80042-ID-SQN.
           
           MOVE 'ST'                         TO SF80042-CD-T-REG.
           MOVE '01'                         TO ACB5022-CD-ACES.
           MOVE ZEROS                        TO ACB5022-CD-RETR-ECI
                                                ACB5022-CD-RETR-ACES.
           MOVE '03'                         TO ACB50221-CD-ACES-MQ.
           MOVE 00111                        TO ACB50221-ID-FILA-MQ.
           MOVE ZEROS                        TO ACB50221-CD-RETR-MQ
                                                ACB50221-CD-COMP
                                                ACB50221-CD-RSON.
           MOVE SPACES                       TO ACB50221-ID-MSG-PRC.

           MOVE SF0002-ITD-DTC-SEL-FTRM      TO WS35-ID-CORR-ID-LIT-SC.
           MOVE CC0001-NUMERO-CTB-5          TO WS35-ID-CORR-ID-ALF-SC.
           INSPECT WS35-ID-CORREL-ID         CONVERTING SPACES TO ZEROS.
           MOVE WS35-ID-CORREL-ID            TO ACB50221-ID-MSG-AUX.

           MOVE MQ01-ARE-CNT-FILA            TO ACB50221-ARE-CNT-FILA.
           MOVE SF80042-CD-T-REG             TO ACB50221-CHV-PRAD.
           MOVE 461                          TO ACB50221-TAM-MSG.
           MOVE SF80042-ASN-LAYOUT           TO ACB50221-TXT-MSG.

           PERFORM 555-00-GRAVA-MENSAGEM-MQ.

       875-99-TRATA-ITEM-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 04/06 *
      *                                                                *
      *  INTERFACE PARA DE - RESUMO DA ITEM PARA S.                    *
      *----------------------------------------------------------------*
      
       880-00-INTERFACE-S-DE-ITEM            SECTION.
      *----------------------------------------------*

           MOVE '880-00-INTERFACE-S-DE-ITEM' TO WS35-AUX-TS.
           
           MOVE CC0002-QTD-DEA               TO WS01-Q-PECA-ITM-AUX.
           ADD WS01-Q-PECA-ITM-AUX           TO WS01-Q-TTL-ITEM-FAT.

           EXEC SQL SELECT :CC0002-QTD-DEA
                           * NVL(DECODE(ITD_PESO_LQD_PECA,0,
                                             ITD_PESO_BRT_PECA,
                                             ITD_PESO_LQD_PECA),0)/1000
                    INTO   :WQ01-PESO-LQD-TTL-AUX
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                    AND    ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                    AND    ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                    AND    ITD_ID_PECA      = :SF0002-ITD-ID-PECA-LOG
                    AND    ROWNUM           = 1
                END-EXEC.

       880-10-IDENTIFICA-INTERFACE.

           MOVE 'CBL'                        TO SE0001-IDE-NM-EMP.
           IF ST0001-CD-REGR-FTRM  EQUAL  'I'
                MOVE 'FATURA_S57'            TO SE0001-IDE-ID-T-ITF
                MOVE 'BPISPRA'               TO SE0001-IDE-ID-STM-ORGM
           ELSE
           IF ST0001-CD-REGR-FTRM  EQUAL  'N'
                MOVE 'FATURA_S7X'            TO SE0001-IDE-ID-T-ITF
                MOVE 'BPISREB'               TO SE0001-IDE-ID-STM-ORGM
           ELSE
                MOVE 'FATURA_S58'            TO SE0001-IDE-ID-T-ITF
                MOVE 'BPIS'                  TO SE0001-IDE-ID-STM-ORGM
           END-IF.
           MOVE WQ01-SYSDATE-S               TO SE0001-IDE-DTC-GRC
                                                SE0001-IDE-DTC-ITF.
           MOVE WS01-ID-NUM-CNT-S            TO SE0001-IDE-NUM-CNT.
           MOVE WS01-ID-NUM-T-REG-S          TO SE0001-IDE-NUM-T-REG.
           MOVE ZEROS                        TO SE0001-IDE-NUM-SQN.
           MOVE '*'                          TO SE0001-IDE-IC-PRC.      
 
       880-20-CARREGA-CAMPOS.

           INSPECT CC0002-QTD-DEA            CONVERTING SPACES TO ZEROS.

           EXEC SQL SELECT ITD_RATE_US,
                           ITD_PREC_US_API_UNT-ITD_V_FEE4_DISC_CES,
                           (ITD_PREC_US_API_UNT-
                            ITD_V_FEE4_DISC_CES)*ITD_Q_PECA_FTRD,
                           ITD_PREC_US_DN_CORE*ITD_Q_PECA_FTRD,
                           ITD_PREC_US_IC_CORE*ITD_Q_PECA_FTRD
                    INTO   :WQ01-RATE-US-ITEM,
                           :WQ01-ITD-PREC-US-API-UNT-REB,
                           :WQ01-ITD-PREC-US-API-TTL-REB,
                           :WQ01-ITD-PREC-US-DN-CORE-TTL,
                           :WQ01-ITD-PREC-US-IC-CORE-TTL
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST =  :WQ02-CD-MERC-DST
                    AND    ITD_DTC_SEL_FTRM =  :WQ02-DTC-SEL-FTRM
                    AND    ITD_LGON_FUNC =  :WQ02-LGON-FUNC
                    AND    ITD_FTR_EXP = :SF0002-ITD-FTR-EXP
                    AND    ITD_ID_ETIQ_ACND = 
                                          :SF0002-ITD-ID-ETIQ-ACND-LOG
                    AND    ITD_ID_NF        = :CC0001-NUMERO
                    AND    ITD_CD_SEQ_ITM   = :CC0002-IDF-NUM
                    AND    ROWNUM = 1
                END-EXEC.

           INSPECT WQ01-RATE-US-ITEM         CONVERTING SPACES TO ZEROS.
           INSPECT WQ01-ITD-PREC-US-API-UNT-REB
                                             CONVERTING SPACES TO ZEROS.
           INSPECT WQ01-ITD-PREC-US-API-TTL-REB
                                             CONVERTING SPACES TO ZEROS.
           INSPECT WQ01-ITD-PREC-US-DN-CORE-TTL
                                             CONVERTING SPACES TO ZEROS.
           INSPECT WQ01-ITD-PREC-US-IC-CORE-TTL
                                             CONVERTING SPACES TO ZEROS.


           MOVE WQ01-RATE-US-ITEM            TO WS01-RATE-US-ITEM.

           IF ST0001-CD-REGR-FTRM  EQUAL  'N'
                MOVE WQ01-ITD-PREC-US-API-UNT-REB TO
                                             CC0002-PRECO-UNIT-DEA-US-X
                MOVE WQ01-ITD-PREC-US-API-TTL-REB TO
                                             CC0002-PRECO-TOT-DEA-US-X
           ELSE
                COMPUTE CC0002-PRECO-TOTAL-DEA-US ROUNDED = 
                        CC0002-PRECO-TOT-DEA-N /
                                          (WS01-RATE-US-ITEM-R / 10000)

                COMPUTE CC0002-PRECO-UNITARIO-DEA-US ROUNDED = 
                        CC0002-PRECO-UNITARIO-DEA-N /
                                          (WS01-RATE-US-ITEM-R / 10000).

           MOVE SF0002-ITD-FTR-EXP           TO SE90043-ID-FTR-S57.
           INSPECT SE90043-ID-FTR-S57        CONVERTING SPACES TO ZEROS.
           MOVE SF0002-ITD-ID-PECA-LOG       TO SE90043-ID-PECA.
           MOVE CC0002-NBM-CODIGO-DEA        TO SE90043-ID-NBM.
           MOVE CC0002-QTD-DEA               TO SE90043-QT-PECA.
           MOVE CC0002-PRECO-UNIT-DEA-US-X   TO SE90043-V-ITEM.
           MOVE CC0002-PRECO-TOT-DEA-US-X    TO SE90043-V-TTL-ITEM.
           MOVE WQ01-PESO-LQD-TTL-AUX        TO SE90043-UND-PESO-R.
           MOVE SF0002-ITD-ID-VOL-LOG        TO SE90043-ID-VOL.
           MOVE SF0002-ITD-ID-ETIQ-REC-LOG   TO SE90043-ID-ETIQ-REC.
           MOVE SF0002-ITD-ID-ETIQ-ACND-LOG  TO SE90043-ID-ETIQ-ACND.
           MOVE SF0002-ITD-ID-ITM-DE         TO SE90043-ID-ITEM-DE.
           MOVE ST0005-CD-PFO                TO SE90043-CD-PFO.
           IF ST0001-CD-REGR-FTRM  EQUAL  'N'
                MOVE WQ01-ITD-PREC-US-DN-CORE-TTL
                                             TO SE90043-V-TTL-CASC
           ELSE
                MOVE WQ01-ITD-PREC-US-IC-CORE-TTL
                                             TO SE90043-V-TTL-CASC.
           MOVE SF0002-ITD-V-US-RT-FRT       TO WS01-V-TTL-FRT-9.
           MOVE WS01-V-TTL-FRT               TO SE90043-V-TTL-FRT.
           MOVE SF0002-ITD-V-US-RT-SGR       TO WS01-V-TTL-SGR-9.
           MOVE WS01-V-TTL-SGR               TO SE90043-V-TTL-SGR.

           MOVE SF0002-ITD-V-US-RT-ODA       TO WS01-V-TTL-ODA-9.
           IF ST0001-CD-REGR-FTRM  NOT EQUAL  'N'
                MOVE SF0002-ITD-V-US-ARED-CES-ODA
                                             TO WS01-V-TTL-ARED-CES-9
                ADD WS01-V-TTL-ARED-CES-9    TO WS01-V-TTL-ODA.
           MOVE WS01-V-TTL-ODA               TO SE90043-V-TTL-ODA.

           MOVE SF0002-ITD-V-AI-CHRG-API     TO WS01-V-TTL-AI.
           
      *    VERIFICAR NO SURCHARGER LONG-TERM SE USARA NO CES V-TTL-API
           
           IF ST0001-CD-REGR-FTRM  EQUAL  'N'
                EXEC SQL SELECT SUM((ITD_Q_PECA_FTRD*ITD_V_FEE1_CES)+
                                    (ITD_Q_PECA_FTRD*ITD_V_FEE2_CES)+
                                    (ITD_Q_PECA_FTRD*ITD_V_FEE3_CES))+
                                MAX(ITD_V_US_ARED_CES_ODA)
                         INTO   :WQ01-TTL-FEES-CES
                         FROM   H1SF.ITD_ITMFATURADO
                         WHERE  ITD_CD_MERC_DST =
                                               :SF0001-PTD-CD-MERC-DST
                         AND    ITD_DTC_SEL_FTRM =
                                               :SF0001-PTD-DTC-SEL-FTRM
                         AND    ITD_LGON_FUNC =
                                               :SF0001-PTD-LGON-FUNC
                     END-EXEC

                INSPECT WQ01-TTL-FEES-CES    CONVERTING SPACES TO ZEROS
                MOVE WQ01-TTL-FEES-CES       TO WS01-TTL-FEES-CES
                ADD WS01-TTL-FEES-CES        TO WS01-V-TTL-AI.

           MOVE WS01-V-TTL-AI                TO SE90043-V-TTL-AI.

           MOVE SF0002-ITD-V-EMG-CHRG-API    TO SE90043-V-TTL-EMG-CHRG.
           MOVE SF0002-ITD-V-MKT-DISC-API    TO SE90043-V-TTL-DISC.

           IF ST0001-CD-REGR-FTRM  EQUAL  'I'
                MOVE SE90043-TXT-MSG         TO SE0001-IDE-TXT-MSG
           ELSE
                MOVE SE90043-TXT-MSG         TO SE90243-TXT-MSG
                MOVE SE90243-TXT-MSG         TO SE0001-IDE-TXT-MSG.

           PERFORM 620-00-GRAVA-INTERFACE-DEA.

       880-99-INTERFACE-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 04/06 *
      *                                                                *
      *  INTERFACE PARA DE - RESUMO DA FATURA PARA S.                  *
      *----------------------------------------------------------------*
      
       885-00-INTERFACE-S-DE-FAT             SECTION.
      *----------------------------------------------*
                                             
           MOVE '885-00-INTERFACE-S-DE-FAT'  TO WS35-AUX-TS.

       885-10-IDENTIFICA-INTERFACE.

           MOVE 'CBL'                        TO SE0001-IDE-NM-EMP.
           IF ST0001-CD-REGR-FTRM  EQUAL  'I'
                MOVE 'FATURA_S57'            TO SE0001-IDE-ID-T-ITF
                MOVE 'BPISPRA'               TO SE0001-IDE-ID-STM-ORGM
           ELSE
           IF ST0001-CD-REGR-FTRM  EQUAL  'N'
                MOVE 'FATURA_S7X'            TO SE0001-IDE-ID-T-ITF
                MOVE 'BPISREB'               TO SE0001-IDE-ID-STM-ORGM
           ELSE
                MOVE 'FATURA_S58'            TO SE0001-IDE-ID-T-ITF
                MOVE 'BPIS'                  TO SE0001-IDE-ID-STM-ORGM
           END-IF.
           MOVE WQ01-SYSDATE-S               TO SE0001-IDE-DTC-GRC
                                                SE0001-IDE-DTC-ITF.
           MOVE WS01-ID-NUM-CNT-S            TO SE0001-IDE-NUM-CNT.
           MOVE ZEROS                        TO SE0001-IDE-NUM-T-REG
                                                SE0001-IDE-NUM-SQN.
           MOVE '*'                          TO SE0001-IDE-IC-PRC.      
 
       885-20-CARREGA-CAMPOS.
       
           EXEC SQL SELECT TO_CHAR(TO_DATE(:SF0001-PTD-DTC-SEL-FTRM,
                                                 'YYYYMMDDHH24MISS'),
                                                        'DD-MM-YYYY')
                    INTO   :WQ01-DT-INL-FTRM
                    FROM   DUAL
                    WHERE  ROWNUM   = 1
                END-EXEC.

           MOVE SF0002-ITD-FTR-EXP           TO SE90041-ID-FTR-S57.
           INSPECT SE90041-ID-FTR-S57        CONVERTING SPACES TO ZEROS.
           MOVE SF0001-PTD-ID-CLI            TO SE90041-ID-CLI.
           MOVE WQ01-DT-INL-FTRM             TO SE90041-DTC-EMS.
           MOVE WS01-Q-TTL-ITEM-FAT          TO SE90041-QT-ITEM.

           MOVE SF0001-PTD-CD-T-REC          TO SE90041-CD-T-REC.
           IF SF0001-PTD-CD-T-REC  EQUAL  'R1'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'RA'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'RG'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'U1'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'UA'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'UG'
                MOVE 'R1'                    TO SE90041-CD-T-REC
           ELSE
           IF SF0001-PTD-CD-T-REC  EQUAL  'R2'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'RB'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'RH'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'U2'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'UB'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'UH'
                MOVE 'R2'                    TO SE90041-CD-T-REC
           ELSE
           IF SF0001-PTD-CD-T-REC  EQUAL  'R3'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'RC'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'RI'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'U3'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'UC'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'UI'
                MOVE 'R3'                    TO SE90041-CD-T-REC
           ELSE
           IF SF0001-PTD-CD-T-REC  EQUAL  'R4'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'RD'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'RK'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'U4'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'UD'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'UK'
                MOVE 'R4'                    TO SE90041-CD-T-REC
           ELSE
           IF SF0001-PTD-CD-T-REC  EQUAL  'R5'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'RE'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'RL'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'U5'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'UE'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'UL'
                MOVE 'R5'                    TO SE90041-CD-T-REC
           ELSE
           IF SF0001-PTD-CD-T-REC  EQUAL  'R6'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'RF'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'RN'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'U6'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'UF'  OR
              SF0001-PTD-CD-T-REC  EQUAL  'UN'
                MOVE 'R6'                    TO SE90041-CD-T-REC
           END-IF.

           MOVE SF0002-ITD-CD-MOD-TRSP-LOG   TO SE90041-CD-MOD-TRSP.
           MOVE SF0002-ITD-ID-PDD-LOG        TO SE90041-ID-PDD.
           IF ST0001-CD-REGR-FTRM  EQUAL  'N'
                MOVE SF0002-ITD-ID-FTR-API-LOG
                                             TO SE90041-ID-FTR-API
           ELSE
                MOVE SPACES                  TO SE90041-ID-FTR-API.

           IF ST0001-CD-REGR-FTRM  EQUAL  'I'
                MOVE SE90041-TXT-MSG         TO SE0001-IDE-TXT-MSG
           ELSE
                MOVE SE90041-TXT-MSG         TO SE90241-TXT-MSG
                MOVE SE90241-TXT-MSG         TO SE0001-IDE-TXT-MSG.

           PERFORM 620-00-GRAVA-INTERFACE-DEA.

       885-30-FINALIZA-INTERFACE.

           MOVE 'CBL'                        TO SE0001-IDE-NM-EMP.
           IF ST0001-CD-REGR-FTRM  EQUAL  'I'
                MOVE 'FATURA_S57'            TO SE0001-IDE-ID-T-ITF
                MOVE 'BPISPRA'               TO SE0001-IDE-ID-STM-ORGM
           ELSE
           IF ST0001-CD-REGR-FTRM  EQUAL  'N'
                MOVE 'FATURA_S7X'            TO SE0001-IDE-ID-T-ITF
                MOVE 'BPISREB'               TO SE0001-IDE-ID-STM-ORGM
           ELSE
                MOVE 'FATURA_S58'            TO SE0001-IDE-ID-T-ITF
                MOVE 'BPIS'                  TO SE0001-IDE-ID-STM-ORGM
           END-IF.
           MOVE WQ01-SYSDATE-S               TO SE0001-IDE-DTC-GRC
                                                SE0001-IDE-DTC-ITF.
           MOVE WS01-ID-NUM-CNT-S            TO SE0001-IDE-NUM-CNT.
           MOVE 999999999                    TO SE0001-IDE-NUM-T-REG
           MOVE ZEROS                        TO SE0001-IDE-NUM-SQN.
           MOVE 'N'                          TO SE0001-IDE-IC-PRC.
 
       885-40-CARREGA-CAMPOS-FIM.
       
           MOVE SPACES                       TO WS01-FIM-DEA-PROCESSO.      
           MOVE 'H1SF0033'                   TO WS01-FIM-DEA-PROCESSO.      
           MOVE WQ01-SYSDATE-S               TO WS01-FIM-DEA-DATA.      

           MOVE SPACES                       TO SE0001-IDE-TXT-MSG.      
           MOVE WS01-FIM-INTERFACE-DEA       TO SE0001-IDE-TXT-MSG.

           PERFORM 620-00-GRAVA-INTERFACE-DEA.

       885-99-INTERFACE-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 05/06 *
      *                                                                *
      *  INTERFACE PARA EXPORT CONTROL - RESUMO DO ITEM.               *
      *----------------------------------------------------------------*
      
       890-00-INTERFACE-EXP-CTRL-ITM         SECTION.
      *----------------------------------------------*

           MOVE '890-00-INTERFACE-EXP-CTRL-ITM' TO WS35-AUX-TS.

           IF ST0001-CD-REGR-FTRM  NOT EQUAL  'J'
                GO                             TO 890-99-INTERFACE-EXIT.

           EXEC SQL SELECT NM_PECA_PRTG,
                           NM_PECA_ING
                    INTO   :WQ01-NM-PECA-PRTG   :WI01-NM-PECA-PRTG,
                           :WQ01-NM-PECA-ING    :WI01-NM-PECA-ING
                    FROM   H1SR.PECA
                    WHERE  ID_PECA = :SF0002-ITD-ID-PECA-LOG
                    AND    ROWNUM  = 1
                END-EXEC.

           MOVE CC0002-PRECO-UNITARIO-DEA   TO WS01-PRECO-UNIT-09-AUX-R.
           INSPECT WS01-PRECO-UNIT-09-AUX    CONVERTING SPACES TO ZEROS.
           MOVE WS01-PRECO-UNIT-09-AUX       TO WQ01-PREC-EXP-UNIT.
       
           EXEC SQL INSERT INTO H1SF.EXI_ITEM_FTR
                           (EXI_ID_FTR,
                            EXI_ID_VOL,
                            EXI_ID_PECA,
                            EXI_CD_SEQ_NF,
                            EXI_QT_PECA,
                            EXI_NM_PECA_PRTG,
                            EXI_NM_PECA_ING,
                            EXI_ID_PDD,
                            EXI_ID_PREC_RS_UNIT,
                            EXI_ID_CLSF_FSCL,
                            EXI_TTL_PESO_BRT,
                            EXI_TTL_PESO_LQD)
                           VALUES
                           (:SF0002-ITD-FTR-EXP,
                            :SF0002-ITD-ID-VOL-LOG,
                            :SF0002-ITD-ID-PECA-LOG,
                            :CC0002-IDF-NUM,
                            :SF0002-ITD-Q-PECA-FTRD,
                            :WQ01-NM-PECA-PRTG,
                            :WQ01-NM-PECA-ING,
                            :SF0002-ITD-ID-PDD-LOG,
                            :WQ01-PREC-EXP-UNIT,
                            :CC0002-NBM-CODIGO-DEA,
                            :SF0002-ITD-PESO-BRT-PECA,
                            :SF0002-ITD-PESO-LQD-PECA)
                END-EXEC.

       890-99-INTERFACE-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *             === ROTINA DE MOVIMENTACAO ===           EFJ 05/06 *
      *                                                                *
      *  INTERFACE PARA EXPORT CONTROL - TOTAL DA FATURA.              *
      *----------------------------------------------------------------*
      
       895-00-INTERFACE-EXP-CTRL-TTL         SECTION.
      *----------------------------------------------*

           MOVE '895-00-INTERFACE-EXP-CTRL-TTL' TO WS35-AUX-TS.

           IF ST0001-CD-REGR-FTRM  NOT EQUAL  'J'
                GO                              TO 895-05-GERAL-FATURA.

           IF SR0005-ID-IDM  NOT GREATER  SPACES
                EXEC SQL SELECT ID_IDM
                         INTO   :SR0005-ID-IDM :WI01-ID-IDM
                         FROM   H1SR.PRECO_FATURA_API
                         WHERE  ID_FTR = :SF0002-ITD-FTR-EXP
                         AND    ROWNUM     = 1
                     END-EXEC.

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL   OR
              SR0005-ID-IDM  NOT GREATER  SPACES  OR
              WI01-ID-IDM    EQUAL  -1
                MOVE 'E'                     TO SR0005-ID-IDM.
       
       895-05-GERAL-FATURA.
       
           IF ST0001-CD-REGR-FTRM  NOT EQUAL  'J'
                EXEC SQL UPDATE H1SF.EXG_GERAL_FTR
                         SET    EXG_TTL_RS_FTR =
                                       (SELECT SUM(ITD_Q_PECA_FTRD *
                                                ITD_PREC_FTRD_UNT_EMIF)
                                        FROM   H1SF.ITD_ITMFATURADO
                                        WHERE  ITD_CD_MERC_DST  =
                                                    :WQ02-CD-MERC-DST
                                        AND    ITD_DTC_SEL_FTRM =
                                                    :WQ02-DTC-SEL-FTRM
                                        AND    ITD_LGON_FUNC    =
                                                    :WQ02-LGON-FUNC
                                        AND    ITD_ID_NF_REF   IS NULL),
                                EXG_RATE_US =
                                       (SELECT MAX(ITD_RATE_US)
                                        FROM   H1SF.ITD_ITMFATURADO
                                        WHERE  ITD_CD_MERC_DST  =
                                                    :WQ02-CD-MERC-DST
                                        AND    ITD_DTC_SEL_FTRM =
                                                    :WQ02-DTC-SEL-FTRM
                                        AND    ITD_LGON_FUNC    =
                                                    :WQ02-LGON-FUNC
                                        AND    ITD_ID_NF_REF   IS NULL)
                         WHERE  EXG_ID_FTR IN
                                       (SELECT ITD_FTR_EXP
                                        FROM   H1SF.ITD_ITMFATURADO
                                        WHERE  ITD_CD_MERC_DST  =
                                                    :WQ02-CD-MERC-DST
                                        AND    ITD_DTC_SEL_FTRM =
                                                    :WQ02-DTC-SEL-FTRM
                                        AND    ITD_LGON_FUNC    =
                                                    :WQ02-LGON-FUNC
                                        AND    ITD_ID_NF_REF   IS NULL
                                        AND    ROWNUM           = 1)
                     END-EXEC

                GO                              TO 895-10-NF-FATURA.
       
           EXEC SQL SELECT SUM(A.LRG_VOL*A.ALT_VOL*A.CMP_VOL),
                           SUM(A.PESO_BRT_VOL)
                    INTO   :WQ01-CUB-TTL-FTR,
                           :WQ01-PESO-BRT-VOL
                    FROM   H1ST.VOLUME_RECOLHIMENTO A,
                           (SELECT DISTINCT B.ITD_ID_VOL AS VOLUME
                            FROM   H1SF.ITD_ITMFATURADO B
                            WHERE  B.ITD_CD_MERC_DST
                                                   =  :WQ02-CD-MERC-DST
                            AND    B.ITD_DTC_SEL_FTRM
                                                   =  :WQ02-DTC-SEL-FTRM
                            AND    B.ITD_LGON_FUNC
                                                   =  :WQ02-LGON-FUNC
                            AND    B.ITD_ID_NF_REF IS NULL) C
                    WHERE  A.ID_VOL = C.VOLUME
                END-EXEC.
       
           EXEC SQL INSERT INTO H1SF.EXG_GERAL_FTR
                           (EXG_ID_FTR,
                            EXG_DTC_FTR,
                            EXG_CD_IMPT,
                            EXG_ID_CLI,
                            EXG_QT_PECA,
                            EXG_TTL_RS_FTR,
                            EXG_RATE_US,
                            EXG_QT_VOL,
                            EXG_TTL_PESO_BRT,
                            EXG_TTL_PESO_LQD,
                            EXG_ID_PDD,
                            EXG_CD_MOD_TRSP,
                            EXG_TTL_CUBICA,
                            EXG_QT_TTL_ITEM)
                    SELECT ITD_FTR_EXP,
                           MAX(ITD_DTC_FTR_EXP),
                           MAX(ITD_ID_CLI_REF),
                           MAX(ITD_ID_CLI),
                           SUM(ITD_Q_PECA_FTRD),
                           SUM(ITD_Q_PECA_FTRD
                                 * ITD_PREC_FTRD_UNT_EMIF),
                           MAX(ITD_RATE_US),
                           COUNT(DISTINCT ITD_ID_VOL),
                           :WQ01-PESO-BRT-VOL,
                           NVL(SUM(ITD_Q_PECA_FTRD
                                 * ITD_PESO_LQD_PECA),0),
                           MAX(ITD_ID_PDD),
                           MAX(ITD_CD_MOD_TRSP),
                           :WQ01-CUB-TTL-FTR,
                           COUNT(ITD_ID_ETIQ_ACND)
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST  =  :WQ02-CD-MERC-DST
                    AND    ITD_DTC_SEL_FTRM =  :WQ02-DTC-SEL-FTRM
                    AND    ITD_LGON_FUNC    =  :WQ02-LGON-FUNC
                    AND    ITD_ID_NF_REF    IS NULL
                    GROUP  BY ITD_FTR_EXP
                END-EXEC.

       895-10-NF-FATURA.

           IF ST0001-CD-REGR-FTRM  NOT EQUAL  'J'
                EXEC SQL DELETE
                         FROM   H1SF.EXN_NOTAFISC_FTR
                         WHERE  EXN_ID_NF = 1
                         AND    EXN_ID_FTR IN
                                (SELECT ITD_FTR_EXP
                                 FROM   H1SF.ITD_ITMFATURADO
                                 WHERE  ITD_CD_MERC_DST  =
                                                       :WQ02-CD-MERC-DST
                                 AND    ITD_DTC_SEL_FTRM =
                                                      :WQ02-DTC-SEL-FTRM
                                 AND    ITD_LGON_FUNC    =
                                                         :WQ02-LGON-FUNC
                                 AND    ITD_ID_NF_REF   IS NULL
                                 AND    ROWNUM           = 1)
                     END-EXEC.

           EXEC SQL INSERT INTO H1SF.EXN_NOTAFISC_FTR
                           (EXN_ID_FTR,
                            EXN_ID_NF,
                            EXN_DTC_NF,
                            EXN_TTL_NF_RS,
                            EXN_TTL_NF_US)
                    SELECT ITD_FTR_EXP,
                           ITD_ID_NF,
                           TO_DATE(TO_CHAR(ITD_DTC_NF,'DDMMYYYY'),
                                                           'DDMMYYYY'),
                           SUM(ITD_Q_PECA_FTRD*ITD_PREC_FTRD_UNT_EMIF),
                           ROUND(SUM(ITD_Q_PECA_FTRD
                                      * ITD_PREC_FTRD_UNT_EMIF
                                       / (ITD_RATE_US/10000)))
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST  =  :WQ02-CD-MERC-DST
                    AND    ITD_DTC_SEL_FTRM =  :WQ02-DTC-SEL-FTRM
                    AND    ITD_LGON_FUNC    =  :WQ02-LGON-FUNC
                    AND    ITD_ID_NF_REF    IS NULL
                    GROUP  BY ITD_FTR_EXP,
                              ITD_ID_NF,
                              ITD_DTC_NF
                END-EXEC.

           IF ST0001-CD-REGR-FTRM  NOT EQUAL  'J'
                GO                             TO 895-99-INTERFACE-EXIT.

       895-15-TP-VOL-FATURA.
       
           EXEC SQL INSERT INTO H1SF.EXT_TVOLUME_FTR
                           (EXT_ID_FTR,
                            EXT_NM_ACND_PRTG,
                            EXT_QT_VOL)
                    SELECT B.ID_DCT_FSCL,
                           DECODE(:SR0005-ID-IDM,'E',
                                  C.NM_ACND_ING,C.NM_ACND_ESPN),
                           COUNT(B.ID_VOL)
                    FROM   H1ST.VOLUME_RECOLHIMENTO B,
                           H1ST.TIPO_ACONDICIONAMENTO C
                    WHERE  B.CD_T_ACND        =  C.CD_T_ACND
                    AND    B.ID_VOL IN
                                  (SELECT DISTINCT A.ITD_ID_VOL
                                   FROM   H1SF.ITD_ITMFATURADO A
                                   WHERE  A.ITD_CD_MERC_DST 
                                              =  :WQ02-CD-MERC-DST
                                   AND    A.ITD_DTC_SEL_FTRM
                                              =  :WQ02-DTC-SEL-FTRM
                                   AND    A.ITD_LGON_FUNC
                                              =  :WQ02-LGON-FUNC
                                   AND    A.ITD_ID_NF_REF IS NULL)
                    GROUP  BY B.ID_DCT_FSCL,
                              DECODE(:SR0005-ID-IDM,'E',
                                     C.NM_ACND_ING,C.NM_ACND_ESPN)
                END-EXEC.
       
       895-20-VOL-FATURA.
   
           EXEC SQL INSERT INTO H1SF.EXV_VOLUME_FTR
                           (EXV_ID_FTR,
                            EXV_ID_VOL,
                            EXV_CD_SEQ,
                            EXV_QT_VOL,
                            EXV_ID_PDD,
                            EXV_TTL_ALT,
                            EXV_TTL_LRG,
                            EXV_TTL_CMP,
                            EXV_TTL_PESO_BRT,
                            EXV_TTL_PESO_LQD)
                    SELECT A.ITD_FTR_EXP,
                           A.ITD_ID_VOL,
                           SUBSTR(A.ITD_ID_VOL,4,5),
                           1,
                           MAX(A.ITD_ID_PDD),
                           MAX(B.ALT_VOL),
                           MAX(B.LRG_VOL),
                           MAX(B.CMP_VOL),
                           MAX(B.PESO_BRT_VOL),
                           NVL(SUM(A.ITD_Q_PECA_FTRD
                                   *A.ITD_PESO_LQD_PECA),0)
                    FROM   H1SF.ITD_ITMFATURADO A,
                           H1ST.VOLUME_RECOLHIMENTO B
                    WHERE  A.ITD_ID_VOL       =  B.ID_VOL
                    AND    A.ITD_CD_MERC_DST  =  :WQ02-CD-MERC-DST
                    AND    A.ITD_DTC_SEL_FTRM =  :WQ02-DTC-SEL-FTRM
                    AND    A.ITD_LGON_FUNC    =  :WQ02-LGON-FUNC
                    AND    A.ITD_ID_NF_REF    IS NULL
                    GROUP  BY A.ITD_FTR_EXP,
                              A.ITD_ID_VOL
                END-EXEC.

       895-99-INTERFACE-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *              === ROTINA COMPLEMENTAR ===            ACA  08/00 *
      *                                                                *
      *  REGISTRA ERRO DA TRANSACAO PARA SITUACOES ANORMAIS.           *
      *----------------------------------------------------------------*

       900-00-REGISTRA-ERRO-TRNS             SECTION.
      *----------------------------------------------*
      
           EXEC CICS WRITEQ TS QUEUE ('H1SF0033')
                               FROM  (WS35-AUX-TS)
                END-EXEC.

           EXEC CICS WRITEQ TS QUEUE ('H1SF0033')
                               FROM  (SQLERRMC)
                END-EXEC.

           EXEC SQL WHENEVER      SQLERROR   CONTINUE
                END-EXEC.                                              
                                                                        
           MOVE '01'                         TO ACB5010-CD-ACES.
           MOVE 'SF33'                       TO ACB5010-ID-TRSC.
           MOVE WS35-ID-PGM                  TO ACB5010-ID-PGM.
           MOVE EIBFN                        TO ACB5010-CD-FNC.
           MOVE EIBRCODE                     TO ACB5010-CD-RETR-FNC.
           MOVE WS35-CD-ACES-ERRO            TO ACB5010-CD-ACES-ERRO.
           MOVE WS35-CD-ERRO-ECI             TO ACB5010-CD-ERRO-ECI.
           MOVE WS35-CD-ERRO-ACES            TO ACB5010-CD-ERRO-ACES.
           MOVE EIBDS                        TO ACB5010-ID-ULT-ARQ.
           IF ACB5010-MSG-ERRO  NOT GREATER  SPACES
                MOVE SPACES                  TO ACB5010-MSG-ERRO.
           IF WS35-CD-ERRO-ECI  EQUAL  '03'  AND
              ACB5010-MSG-ERRO  NOT GREATER  SPACES
                MOVE SQLERRMC                TO ACB5010-MSG-ERRO.

           PERFORM 585-00-EMITE-ROLLBACK.                     

           EXEC SQL UPDATE H1SF.MNT_MONITOR_FTRM
                    SET    MNT_DTC_ITRP = SYSDATE,
                           MNT_ID_MTV_ITRP = 'E'
                    WHERE  MNT_CD_MERC_DST  = :WQ02-CD-MERC-DST   AND
                           MNT_DTC_SEL_FTRM = :WQ02-DTC-SEL-FTRM  AND
                           MNT_LGON_FUNC    = :WQ02-LGON-FUNC
                END-EXEC.

           PERFORM 580-00-EMITE-LINK-H1CB5010.

           PERFORM 615-00-FREEMAIN-TRSC.

           PERFORM 590-00-EMITE-SYNCPOINT.

           PERFORM 595-00-EMITE-RETURN-CICS.
           GOBACK.
      
       900-99-ENCERRA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *              === ROTINA COMPLEMENTAR ===            ACA  08/00 *
      *                                                                *
      *  ALINHA CAMPO.                                                 *
      *----------------------------------------------------------------*

       910-00-TIPO-PEDIDO                    SECTION.
      *----------------------------------------------*

           MOVE ZEROS                       TO WS32-IND-ORIGEM
                                               WS32-IND-DESTINO.
 
           MOVE SPACES                      TO WS01-DESTINO.

       910-10-LOOP.

           ADD 1                            TO WS32-IND-ORIGEM.
           
           IF WS32-IND-ORIGEM  GREATER  25
                GO                          TO 910-20-CONCAT-TIPO-ATND.
                
           IF WS01-ORIGEM-TAB (WS32-IND-ORIGEM)  EQUAL  SPACES
                GO                          TO 910-20-CONCAT-TIPO-ATND.

           ADD 1                            TO WS32-IND-DESTINO.
           
           MOVE WS01-ORIGEM-TAB (WS32-IND-ORIGEM)
                                            TO WS01-DESTINO-TAB
                                               (WS32-IND-DESTINO).
           
           GO                               TO 910-10-LOOP.

       910-20-CONCAT-TIPO-ATND.

      *    IF ST0001-CD-FBR  NOT EQUAL  'UN'
      *         GO                           TO 910-99-ALINHA-EXIT.

           MOVE WS01-DESTINO                 TO WQ01-DESC-REC-AUX.

           EXEC SQL SELECT :WQ01-DESC-REC-AUX || ' - ' ||
                                              INITCAP(:ST0001-CD-T-ATND)
                    INTO   :WQ01-DESC-REC-AUX
                    FROM   DUAL
                    WHERE  UPPER(:WQ01-DESC-REC-AUX)  NOT IN
                                               ('ESTOQUE', 'EMERGENCIA')
                    AND    ROWNUM = 1
                END-EXEC.

           IF SQLCODE  NOT EQUAL  WS31-CHV-NTFD-SQL
                MOVE WQ01-DESC-REC-AUX       TO WS01-DESTINO.

           GO                                TO 910-99-ALINHA-EXIT.

       910-99-ALINHA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *              === ROTINA COMPLEMENTAR ===            ACA  08/00 *
      *                                                                *
      *  ALINHA CAMPO.                                                 *
      *----------------------------------------------------------------*

       920-00-MONTA-COD-BARRA                SECTION.
      *----------------------------------------------*

           MOVE CC0001-NFE-LOCALIZADOR      TO WS01-NFE-LOCALIZADOR-BAR.

           IF WS01-REFER-COD-BARRA  NOT NUMERIC
                MOVE '*** ERRO - CODIGO DE BARRA NAO NUMERICO  ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WS01-REFER-COD-BARRA    TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.               

           MOVE ZEROS                       TO WS32-IND-BARRA.

           MOVE ZEROS                       TO WS01-DIG-COD-BARRA
                                               WS01-CALC-DIG-COD-BARRA.
 
           MOVE 105                         TO WS01-TOT-COD-BARRA.
 
       920-10-LOOP-BARRA.

           ADD 1                            TO WS32-IND-BARRA.
           
           IF WS32-IND-BARRA  GREATER  22
                GO                          TO 920-20-CALC-DIGITO.
                
           MOVE WS01-REF-COD-BARRA(WS32-IND-BARRA)
                                            TO WS32-IND-BARRA-1.
 
           ADD 1                            TO WS32-IND-BARRA-1.
           
           MOVE WS01-CONV-BARRA-TAB (WS32-IND-BARRA-1)
                                            TO WS01-COD-BARRA-TAB
                                               (WS32-IND-BARRA).
 
           COMPUTE WS01-TOT-COD-BARRA = WS01-TOT-COD-BARRA +
                   (WS01-REF-COD-BARRA(WS32-IND-BARRA) * 
                                        WS32-IND-BARRA).

           GO                               TO 920-10-LOOP-BARRA.
      
       920-20-CALC-DIGITO.

           COMPUTE WS01-CALC-DIG-COD-BARRA = WS01-TOT-COD-BARRA / 103.

           COMPUTE WS01-DIG-COD-BARRA = WS01-TOT-COD-BARRA -
                   (WS01-CALC-DIG-COD-BARRA-INT * 103)

           ADD 1                            TO WS01-DIG-COD-BARRA.
           
           MOVE WS01-CONV-BARRA-TAB (WS01-DIG-COD-BARRA)
                                            TO WS01-CODIGO-DE-BARRA-DIG.
 
       920-30-IMPRIME-BARRA.

           PERFORM 170-00-DEFINE-VIAS-ORDENACAO.

           IF WS01-ID-VIA  EQUAL  2
                IF WS36-CD-MERC-DST  EQUAL  'D'  AND
                   WS36-FASE-FTRM  EQUAL  '2'
                     MOVE '97'               TO WS01-CD-SQN-PJL-NF
                ELSE
                     MOVE '99'               TO WS01-CD-SQN-PJL-NF
                END-IF
           ELSE
           IF WS01-ID-VIA  EQUAL  3
                MOVE '99'                    TO WS01-CD-SQN-PJL-NF
           END-IF.

           MOVE WS01-CD-SQN-PJL-NF           TO CB0002-DRE-CD-SQN-PJL.

      *    MOVE '&u300D&l+130U'            TO WS01-LINHA-IMPR-AUX.
           MOVE '(0B(s1p12.25v0s0b24576T'  TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4759'                       TO WS01-PCL-RESET-X.
           MOVE '0324'                       TO WS01-PCL-RESET-Y.
           MOVE WS01-CODIGO-DE-BARRA         TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       920-99-ALINHA-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *              === ROTINA COMPLEMENTAR ===            EFJ  10/18 *
      *                                                                *
      *  ALINHA CAMPO.                                                 *
      *----------------------------------------------------------------*

       930-00-MONTA-COD-BARRA-PRT            SECTION.
      *----------------------------------------------*

           MOVE SPACES                      TO WS01-N-LOTE-PROTOCOL-BAR.

           MOVE ZEROS                       TO WS01-ID-PTC-DSP-8.
           MOVE SF0001-PTD-ID-PTC-DSP       TO WS01-ID-PTC-DSP-7.
           INSPECT WS01-ID-PTC-DSP-8        CONVERTING SPACES TO ZEROS.

           MOVE WS01-ID-PTC-DSP-8           TO WS01-N-LOTE-PROTOCOL-BAR.

           IF WS01-REFER-COD-BARRA-PRT  NOT NUMERIC
                MOVE '*** ERRO - CODIGO DE BARRA-PRT NAO NUMERICO  ===>'
                                             TO WS35-MSG-ERRO-LIT
                MOVE WS01-REFER-COD-BARRA-PRT
                                             TO WS35-MSG-ERRO-VAR
                MOVE WS35-MSG-ERRO           TO ACB5010-MSG-ERRO
                MOVE 'H1SF0033'              TO WS35-ID-PGM
                PERFORM 900-00-REGISTRA-ERRO-TRNS.               

           MOVE ZEROS                       TO WS32-IND-BARRA-PRT.

           MOVE ZEROS                       TO WS01-DIG-COD-BARRA
                                               WS01-CALC-DIG-COD-BARRA.
 
           MOVE 105                         TO WS01-TOT-COD-BARRA.
 
       930-10-LOOP-BARRA-PRT.

           ADD 1                            TO WS32-IND-BARRA-PRT.
           
           IF WS32-IND-BARRA-PRT  GREATER  4
                GO                          TO 930-20-CALC-DIGITO.
                
           MOVE WS01-REF-COD-BARRA-PRT(WS32-IND-BARRA-PRT)
                                            TO WS32-IND-BARRA-PRT-1.
 
           ADD 1                            TO WS32-IND-BARRA-PRT-1.
           
           MOVE WS01-CONV-BARRA-TAB (WS32-IND-BARRA-PRT-1)
                                            TO WS01-COD-BARRA-PRT-TAB
                                               (WS32-IND-BARRA-PRT).
 
           COMPUTE WS01-TOT-COD-BARRA = WS01-TOT-COD-BARRA +
                   (WS01-REF-COD-BARRA-PRT(WS32-IND-BARRA-PRT) * 
                                        WS32-IND-BARRA-PRT).

           GO                               TO 930-10-LOOP-BARRA-PRT.
      
       930-20-CALC-DIGITO.

           COMPUTE WS01-CALC-DIG-COD-BARRA = WS01-TOT-COD-BARRA / 103.

           COMPUTE WS01-DIG-COD-BARRA = WS01-TOT-COD-BARRA -
                   (WS01-CALC-DIG-COD-BARRA-INT * 103)

           ADD 1                             TO WS01-DIG-COD-BARRA.
           
           MOVE WS01-CONV-BARRA-TAB(WS01-DIG-COD-BARRA)
                                        TO WS01-CODIGO-DE-BARRA-PRT-DIG.
 
       930-30-IMPRIME-BARRA-PRT.

           IF WS01-NUM-VIAS-PTD  EQUAL  1
                MOVE WS01-CD-SQN-PJL-PTD     TO CB0002-DRE-CD-SQN-PJL
           ELSE
           IF WS01-NUM-VIAS-PTD  EQUAL  3  AND
              WS36-CD-MERC-DST  EQUAL  'D'  AND
              WS36-FASE-FTRM  EQUAL  '2'
                MOVE '96'                    TO CB0002-DRE-CD-SQN-PJL
           ELSE
                ADD 1                        TO WS01-CD-SQN-PJL-PTD-N
                MOVE WS01-CD-SQN-PJL-PTD     TO CB0002-DRE-CD-SQN-PJL
                SUBTRACT 1                   FROM WS01-CD-SQN-PJL-PTD-N
           END-IF.

      *
      *    MOVE '&u300D&l+130U'            TO WS01-LINHA-IMPR-AUX.
           MOVE '(0B(s1p12.25v0s0b24576T'  TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4150'                       TO WS01-PCL-RESET-X.
           MOVE '0210'                       TO WS01-PCL-RESET-Y.
           MOVE WS01-CODIGO-DE-BARRA-PRT     TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       930-99-ALINHA-EXIT.
           EXIT.
           
      *----------------------------------------------------------------*
      *              === ROTINA COMPLEMENTAR ===            ACA  08/00 *
      *                                                                *
      *  CONVERTE UF.                                                  *
      *----------------------------------------------------------------*

       940-00-CONVERTE-UF                    SECTION.
      *----------------------------------------------*

           MOVE ZEROS                       TO WS32-IND-UF.
 
       940-10-LOOP-UF.

           ADD 1                            TO WS32-IND-UF.
           
           IF WS32-IND-UF  GREATER  29
                GO                          TO 940-99-CONVERTE-EXIT.
                
           IF CC0004-UF-CODIGO  EQUAL  WS01-UF-TAB (WS32-IND-UF)
                GO                          TO 940-99-CONVERTE-EXIT.
                
           GO                               TO 940-10-LOOP-UF.
      
       940-99-CONVERTE-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *              === ROTINA COMPLEMENTAR ===             EFJ 04/09 *
      *                                                                *
      *  MONTAGEM DE MENSAGENS LEGAIS.                                 *
      *----------------------------------------------------------------*

       950-00-MENSAGENS-LEGAIS               SECTION.
      *----------------------------------------------*

           MOVE '4167'                       TO WS01-PCL-POS-AUX.
           MOVE ZEROS                        TO WS32-IND-MSG.
           MOVE SPACES                       TO WQ01-MSG-CMPL-AUX
                                                WS01-MENSAGEM.

           EXEC SQL AT CCPR DECLARE CSR_SEL_940  CURSOR FOR
                    SELECT DISTINCT ' ' || A.TXT_MSG,
                           A.ID_MSG
                    FROM   (SELECT DISTINCT MA.MENSAGEM AS TXT_MSG,
                                   MA.ID AS ID_MSG
                            FROM   B8CC.COR_MENSAGEM MA,
                                   B8CC.COR_DOF_MSG MB
                            WHERE  MB.MSG_ID = MA.ID
                            AND    MB.DOF_SEQUENCE =
                                                 :CC0001-DOF-SEQUENCE
                            UNION ALL
                            SELECT DISTINCT MC.MENSAGEM AS TXT_MSG,
                                   MC.ID AS ID_MSG
                            FROM   B8CC.COR_MENSAGEM MC,
                                   B8CC.COR_IDF_MSG MD
                            WHERE  MD.MSG_ID = MC.ID
                            AND    MD.DOF_SEQUENCE =
                                                 :CC0001-DOF-SEQUENCE) A
                    ORDER  BY A.ID_MSG
                END-EXEC.
 
           EXEC SQL OPEN   CSR_SEL_940
                END-EXEC. 
                
       950-10-LOOP-MENSAGEM.

           EXEC SQL FETCH  CSR_SEL_940
                    INTO   :CC0006-MENSAGEM,
                           :CC0006-ID
                END-EXEC. 

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                          TO 950-20-FECHA-CURSOR.

           EXEC SQL SELECT UPPER(:CC0006-MENSAGEM-1)
                    INTO   :CC0006-MENSAGEM-1
                    FROM   DUAL
                    WHERE  ROWNUM = 1
                END-EXEC.

           EXEC SQL SELECT RTRIM(:WQ01-MSG-CMPL-AUX) ||
                                 :CC0006-MENSAGEM
                    INTO   :WQ01-MSG-CMPL-AUX
                    FROM   DUAL
                    WHERE  ROWNUM = 1
                END-EXEC.

           GO                               TO 950-10-LOOP-MENSAGEM.
    
       950-20-FECHA-CURSOR.

           EXEC SQL CLOSE  CSR_SEL_940
                END-EXEC.

           IF CC0001-NFE-CONTINGENCIA  EQUAL  'S'  OR
              CC0001-NFE-COD-SITUACAO  EQUAL  'SYN027'
                MOVE WS01-MSG-NFE-CTGC      TO WQ01-MSG-NFE-CTGC
                EXEC SQL SELECT :WQ01-MSG-NFE-CTGC ||
                                      :WQ01-MSG-CMPL-AUX
                         INTO   :WQ01-MSG-CMPL-AUX
                         FROM   DUAL
                         WHERE  ROWNUM = 1
                     END-EXEC.

           IF CC0001-NFE-COD-SITUACAO  EQUAL  'SYN077'
                MOVE CC0001-UF-CODIGO-EMITENTE
                                            TO WS01-MSG-NFE-EPEC-UF
                MOVE CC0011-DH-EVENTO       TO WS01-MSG-NFE-EPEC-DTC
                MOVE WS01-MSG-NFE-EPEC      TO WQ01-MSG-NFE-EPEC
                EXEC SQL SELECT :WQ01-MSG-NFE-EPEC ||
                                      :WQ01-MSG-CMPL-AUX
                         INTO   :WQ01-MSG-CMPL-AUX
                         FROM   DUAL
                         WHERE  ROWNUM = 1
                     END-EXEC.

           MOVE WQ01-MSG-CMPL-AUX           TO WS01-MENSAGEM.

       950-20-LOOP-MSG.

           ADD 1                            TO WS32-IND-MSG.
                
           IF WS32-IND-MSG  GREATER  10  OR
              WS01-PCL-POS-AUX-R  GREATER  4687 OR
              (WS01-MENSAGEM-TAB-P1(WS32-IND-MSG) NOT GREATER SPACES AND
               WS01-MENSAGEM-TAB-P2(WS32-IND-MSG) NOT GREATER SPACES)
                GO                          TO 950-99-MENSAGENS-EXIT.
                
           MOVE '0048'                       TO WS01-PCL-RESET-X.
           MOVE WS01-PCL-POS-AUX             TO WS01-PCL-RESET-Y.
           MOVE WS01-MENSAGEM-TAB-P1(WS32-IND-MSG)
                                             TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           MOVE '2090'                       TO WS01-PCL-RESET-X.
           MOVE WS01-PCL-POS-AUX             TO WS01-PCL-RESET-Y.
           MOVE WS01-MENSAGEM-TAB-P2(WS32-IND-MSG)
                                             TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
           
           ADD 59                           TO WS01-PCL-POS-AUX-R.
           INSPECT WS01-PCL-POS-AUX         CONVERTING SPACES TO ZEROS.

           GO                               TO 950-20-LOOP-MSG.

       950-99-MENSAGENS-EXIT.
           EXIT.

      *----------------------------------------------------------------*
      *              === ROTINA COMPLEMENTAR ===            ACA  08/00 *
      *                                                                *
      *  MONTAGEM DE INSTRUCOES ESPECIAIS.                             *
      *----------------------------------------------------------------*

       960-00-INSTRUCAO-ESPECIAL             SECTION.
      *----------------------------------------------*

           MOVE '960-00-INSTRUCOES-ESPECIAIS'
                                             TO WS35-AUX-TS.

           MOVE WS01-CD-SQN-PJL-INST         TO CB0002-DRE-CD-SQN-PJL.

           MOVE CC0002-IDF-TEXTO-COMPLEMENTAR
                                        TO WS01-TEXTO-COMPLEMENTAR-EMIF.

      *    MOVE WS01-TXT-ID-PDD-EMIF         TO WQ01-ID-PDD.
           MOVE SF0002-ITD-ID-PDD-LOG        TO WQ01-ID-PDD.

           EXEC SQL SELECT 1
                    FROM   H1ST.INSTRUCAO_ESPECIAL
                    WHERE  CD_T_MTZ = :SF0001-PTD-CD-T-MTZ
                      AND  ID_MTZ   = :WQ01-ID-MTZ-AUX
                      AND  ID_CLI   = :WQ01-ID-CLI-AUX
                      AND  ID_PDD   = :WQ01-ID-PDD
                      AND  CD_T_INS_ESP = 'INV'
                      AND  ROWNUM = 1 
                END-EXEC.
 
           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                          TO 960-99-INSTRUCOES-EXIT.

           PERFORM 756-00-PREPARA-DETALHE-INST.
           PERFORM 766-00-PREPARA-RESUMO-INST.

           PERFORM 550-00-GRAVA-RESUMO-REL.

       960-10-DEFINE-FONTE.

           MOVE 'E&l1H&f50y2X&u600D&l32D*p0x0Y'
                                             TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(19U'                      TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       960-20-DADOS.

           MOVE '(s0p17.14h0s0b4102T'       TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5250'                       TO WS01-PCL-POSICAO-X.
           MOVE '0200'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'Emitida em:'                TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(s0p17.14h0s3b4102T'       TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '5700'                       TO WS01-PCL-POSICAO-X.
           MOVE '0200'                       TO WS01-PCL-POSICAO-Y.
           MOVE SF0001-PTD-DTC-PTC-DSP       TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(s0p17.14h0s3b4102T'       TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0130'                       TO WS01-PCL-POSICAO-X.
           MOVE '0520'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'Remetente  :'               TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(s0p17.14h0s3b4102T'       TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE 520                          TO WS01-POS-ENDR-AUX.
           
           MOVE '0630'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-POS-ENDR-AUX            TO WS01-PCL-POSICAO-Y.
           MOVE CC0008-RAZAO-SOCIAL-E        TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           ADD 80                            TO WS01-POS-ENDR-AUX.
           
           MOVE '0630'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-POS-ENDR-AUX            TO WS01-PCL-POSICAO-Y.
           MOVE CC0008-ENDERECO-EI           TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           IF WI01-COMPLEMENTO  GREATER  -1
                ADD 80                       TO WS01-POS-ENDR-AUX
                MOVE '0630'                  TO WS01-PCL-POSICAO-X
                MOVE WS01-POS-ENDR-AUX       TO WS01-PCL-POSICAO-Y
                MOVE CC0008-COMPLEMENTO      TO WS01-PCL-DADOS
                MOVE WS01-PCL                TO WS01-LINHA-IMPR-AUX
                PERFORM 545-00-GRAVA-DETALHE-REL.

           ADD 80                            TO WS01-POS-ENDR-AUX.

           MOVE '0630'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-POS-ENDR-AUX            TO WS01-PCL-POSICAO-Y.
           MOVE CC0008-BAIRRO-MUN-NOME-UF-EI TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           ADD 80                            TO WS01-POS-ENDR-AUX.

           MOVE '0630'                       TO WS01-PCL-POSICAO-X.
           MOVE WS01-POS-ENDR-AUX            TO WS01-PCL-POSICAO-Y.
           MOVE CC0008-CPF-CGC-INSCR-EST-EI  TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           EXEC SQL SELECT LENGTH(:WQ01-TXT-NF-IST-ESP)
                    INTO   :WQ01-IND-NF-MAX
                    FROM   DUAL
                END-EXEC.
                
           INSPECT WQ01-IND-NF-MAX           CONVERTING SPACES TO ZEROS.
           MOVE WQ01-IND-NF-MAX              TO WS32-IND-NF-MAX.

           MOVE '0130'                       TO WS01-PCL-POSICAO-X.
           MOVE '0950'                       TO WS01-PCL-POSICAO-Y.
           IF WS32-IND-NF-MAX  GREATER  9
                MOVE 'Notas Fiscais:'        TO WS01-PCL-DADOS
           ELSE
                MOVE 'Nota Fiscal:'          TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.
       
           MOVE '(s1p10v0s3b16602T'         TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           EXEC SQL SELECT MIN(ITD_ID_NF),
                           MAX(ITD_ID_NF)
                    INTO   :WQ01-MENOR-DANFE,
                           :WQ01-MAIOR-DANFE
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                      AND  ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                      AND  ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                      AND  ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                END-EXEC.

           INSPECT WQ01-MENOR-DANFE          CONVERTING SPACES TO ZEROS.
           INSPECT WQ01-MAIOR-DANFE          CONVERTING SPACES TO ZEROS.

           MOVE '0630'                       TO WS01-PCL-POSICAO-X.
           MOVE '0960'                       TO WS01-PCL-POSICAO-Y.
           MOVE WQ01-TXT-NF-IST-ESP          TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

      *    MOVE '0630'                       TO WS01-PCL-POSICAO-X.
      *    MOVE '0960'                       TO WS01-PCL-POSICAO-Y.
      *    IF WQ01-MENOR-DANFE  EQUAL  WQ01-MAIOR-DANFE
      *         MOVE WQ01-MENOR-DANFE        TO WS01-PCL-DADOS
      *    ELSE 
      *         MOVE WQ01-MENOR-DANFE        TO WS01-DANFE-MENOR
      *         MOVE WQ01-MAIOR-DANFE        TO WS01-DANFE-MAIOR
      *         MOVE WS01-DANFES             TO WS01-PCL-DADOS.
      *    MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
      *    PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(s0p17.14h0s3b4102T'       TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3480'                       TO WS01-PCL-POSICAO-X.
           MOVE '0520'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'Destinatario:'              TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(s0p17.14h0s3b4102T'       TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4100'                       TO WS01-PCL-POSICAO-X.
           MOVE '0520'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-RAZAO-SOCIAL          TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4100'                       TO WS01-PCL-POSICAO-X.
           MOVE '0600'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-ENDERECO              TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4100'                       TO WS01-PCL-POSICAO-X.
           MOVE '0680'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-MUN-NOME-E            TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4100'                       TO WS01-PCL-POSICAO-X.
           MOVE '0760'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-CPF-CGC-E             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4100'                       TO WS01-PCL-POSICAO-X.
           MOVE '0840'                       TO WS01-PCL-POSICAO-Y.
           MOVE CC0004-INSCR-ESTADUAL-E      TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '3480'                       TO WS01-PCL-POSICAO-X.
           MOVE '0950'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'Cliente     :'              TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(s1p10v0s3b16602T'         TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '4100'                       TO WS01-PCL-POSICAO-X.
           MOVE '0960'                       TO WS01-PCL-POSICAO-Y.
           MOVE SF0001-PTD-ID-CLI            TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(s0p17.14h0s3b4102T'       TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0130'                       TO WS01-PCL-POSICAO-X.
           MOVE '1130'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'Pedidos    :'               TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(s1p10v0s3b16602T'         TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       960-20-PEDIDOS.

           EXEC SQL DECLARE CSR_SEL_960_P  CURSOR FOR       
                    SELECT DISTINCT ITD_ID_PDD
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                      AND  ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                      AND  ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                      AND  ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                    ORDER  BY ITD_ID_PDD
                END-EXEC.
 
           EXEC SQL OPEN   CSR_SEL_960_P
                END-EXEC. 
                
           MOVE WS01-PCL-POSICAO-Y           TO WS01-PCL-POS-AUX.
           ADD 10                            TO WS01-PCL-POS-AUX-R.

           MOVE ZEROS                        TO WS32-IND-VOLUMES.

       960-20-LOOP-PEDIDOS.

           EXEC SQL FETCH  CSR_SEL_960_P
                    INTO   :WQ01-ID-PDD-INST
                END-EXEC. 

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                          TO 960-20-FECHA-CURSOR-PDD.

           IF WS32-IND-VOLUMES  NOT LESS  10
                MOVE ZEROS                   TO WS32-IND-VOLUMES
                ADD 120                      TO WS01-PCL-POS-AUX-R
                INSPECT WS01-PCL-POS-AUX     CONVERTING SPACES TO ZEROS.


           IF WS01-PCL-POS-AUX-R  GREATER  1500
                GO                          TO 960-20-FECHA-CURSOR-PDD.

           ADD 1                             TO WS32-IND-VOLUMES.
       
           COMPUTE WS01-PCL-POS-AUX-X-R  =  
                                         30 + (WS32-IND-VOLUMES * 600). 

           INSPECT WS01-PCL-POS-AUX-X        CONVERTING SPACES TO ZEROS.

           MOVE WS01-PCL-POS-AUX-X           TO WS01-PCL-POSICAO-X.
           MOVE WS01-PCL-POS-AUX             TO WS01-PCL-POSICAO-Y.
           MOVE WQ01-ID-PDD-INST             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           GO                                TO 960-20-LOOP-PEDIDOS.
      
       960-20-FECHA-CURSOR-PDD.

           EXEC SQL CLOSE  CSR_SEL_960_P
                END-EXEC. 
                
           MOVE '(s0p17.14h0s3b4102T'       TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '0130'                       TO WS01-PCL-POSICAO-X.
           MOVE '4000'                       TO WS01-PCL-POSICAO-Y.
           MOVE 'Volumes    :'               TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(s1p10v0s3b16602T'         TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       960-25-VOLUMES.

           EXEC SQL DECLARE CSR_SEL_960_V  CURSOR FOR       
                    SELECT DISTINCT ITD_ID_VOL
                    FROM   H1SF.ITD_ITMFATURADO
                    WHERE  ITD_CD_MERC_DST  = :SF0001-PTD-CD-MERC-DST
                      AND  ITD_DTC_SEL_FTRM = :SF0001-PTD-DTC-SEL-FTRM
                      AND  ITD_LGON_FUNC    = :SF0001-PTD-LGON-FUNC
                      AND  ITD_ID_PTC_DSP   = :SF0001-PTD-ID-PTC-DSP
                    ORDER  BY ITD_ID_VOL
                END-EXEC.
 
           EXEC SQL OPEN   CSR_SEL_960_V
                END-EXEC. 
                
           MOVE WS01-PCL-POSICAO-Y           TO WS01-PCL-POS-AUX.
           ADD 10                            TO WS01-PCL-POS-AUX-R.

           MOVE ZEROS                        TO WS32-IND-VOLUMES.

       960-25-LOOP-VOLUMES.

           EXEC SQL FETCH  CSR_SEL_960_V
                    INTO   :WQ01-ID-VOL-INST
                END-EXEC. 

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                          TO 960-25-FECHA-CURSOR-VOL.

           IF WS32-IND-VOLUMES  NOT LESS  12
                MOVE ZEROS                   TO WS32-IND-VOLUMES
                ADD 120                      TO WS01-PCL-POS-AUX-R
                INSPECT WS01-PCL-POS-AUX     CONVERTING SPACES TO ZEROS.


           IF WS01-PCL-POS-AUX-R  GREATER  4400
                GO                          TO 960-25-FECHA-CURSOR-VOL.

           ADD 1                             TO WS32-IND-VOLUMES.
       
           COMPUTE WS01-PCL-POS-AUX-X-R  =  
                                        130 + (WS32-IND-VOLUMES * 500). 

           INSPECT WS01-PCL-POS-AUX-X        CONVERTING SPACES TO ZEROS.

           MOVE WS01-PCL-POS-AUX-X           TO WS01-PCL-POSICAO-X.
           MOVE WS01-PCL-POS-AUX             TO WS01-PCL-POSICAO-Y.
           MOVE WQ01-ID-VOL-INST             TO WS01-PCL-DADOS.
           MOVE WS01-PCL                     TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           GO                                TO 960-25-LOOP-VOLUMES.
      
       960-25-FECHA-CURSOR-VOL.

           EXEC SQL CLOSE  CSR_SEL_960_V
                END-EXEC. 
                
           MOVE '(s1p25v128s3b16602T'       TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '2400'                       TO WS01-PCL-RESET-X.
           MOVE '1890'                       TO WS01-PCL-RESET-Y.
           MOVE 'Instrucoes Especiais'       TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           MOVE '(s1p15v0s3b16602T'         TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

       960-30-INSTRUCOES.

           EXEC SQL DECLARE CSR_SEL_960  CURSOR FOR       
                    SELECT TXT_INS_ESP
                    FROM   H1ST.INSTRUCAO_ESPECIAL
                    WHERE  CD_T_MTZ = :SF0001-PTD-CD-T-MTZ
                      AND  ID_MTZ   = :WQ01-ID-MTZ-AUX
                      AND  ID_CLI   = :WQ01-ID-CLI-AUX
                      AND  ID_PDD   = :WQ01-ID-PDD
                      AND  CD_T_INS_ESP = 'INV'
                END-EXEC.
 
           EXEC SQL OPEN   CSR_SEL_960
                END-EXEC. 
                
           MOVE WS01-PCL-RESET-Y            TO WS01-PCL-POS-AUX.

           ADD 150                          TO WS01-PCL-POS-AUX-R.

       960-10-LOOP-INSTRUCAO.

           EXEC SQL FETCH  CSR_SEL_960
                    INTO   :ST0002-TXT-INS-ESP
                END-EXEC. 

           IF SQLCODE  EQUAL  WS31-CHV-NTFD-SQL
                GO                          TO 960-50-FECHA-CURSOR.

           ADD 150                          TO WS01-PCL-POS-AUX-R.

           IF WS01-PCL-POS-AUX-R  GREATER  3800
                GO                          TO 960-50-FECHA-CURSOR.

           INSPECT WS01-PCL-POS-AUX         CONVERTING SPACES TO ZEROS.

           MOVE '1250'                       TO WS01-PCL-RESET-X.
           MOVE WS01-PCL-POS-AUX             TO WS01-PCL-RESET-Y.
           MOVE ST0002-TXT-INS-ESP           TO WS01-PCL-DADOS-RESET.
           MOVE WS01-PCL-RESET               TO WS01-LINHA-IMPR-AUX.
           PERFORM 545-00-GRAVA-DETALHE-REL.

           GO                               TO 960-10-LOOP-INSTRUCAO.
      
       960-50-FECHA-CURSOR.

           EXEC SQL CLOSE  CSR_SEL_960
                END-EXEC. 
                
       960-99-INSTRUCOES-EXIT.
           EXIT.
